[
  {
    "poem": "孤鴻海上來，池潢不敢顧。側見雙翠鳥，巢在三珠樹。矯矯珍木巔，得無金丸懼？美服患人指，高明逼神惡。今我游冥冥，弋者何所慕？",
    "translate": "A solitary swan flew in from the sea, Passing on ponds without thinking twice. Looking sideways it sees a couple of kingfishers of fine feathers, With their nest on a treasured tree of pearls enshrined.Atop a tree of such eminence they perched daintily, Are they not afraid of powerful metal slingshot strikes? Well dressers draw attention, High positions attract the Deity’s scrutiny for vice.As for I, much like that lone swan in the infinite sky, Wouldn’t bird-hunters find me difficult to pinpoint and acquire?."
  },
  {
    "poem": "蘭葉春葳蕤，桂華秋皎潔；欣欣此生意，自爾為佳節。誰知林棲者，聞風坐相悅。草木有本心，何求美人折？",
    "translate": "In spring orchid leaves flourish,In autumn cinnamon trees blossom brightly.Such exhibition of vitality Portrays seasons lively.How hermits in the woodsIn these prospects take delight.The verdure knows to natural instincts keep,Why would it wish for discovery by the refined?."
  },
  {
    "poem": "幽人歸獨臥，滯慮洗孤清。持此謝高鳥，因之傳遠情。日夕懷空意，人誰感至精？飛沈理自隔，何所慰吾誠？.",
    "translate": "As a hermit I recline in isolation, Cleansing and clearing thoughts as reclusion intends. With such sincerity I acknowledge the wild birds of passage, Entrusting them to my sentiments towards the distant send.Day and night I dream in vain, Yet is there anyone who can sympathise and comprehend? In power or in the wild, different worlds they are, So how could my loyalty and devotion ever be consoled?.英文翻譯 / English Translation (2011)﹕As a hermit I recline in isolation, Cleansing and clearing thoughts as reclusion intends. With such sincerity I acknowledge the wild birds of passage, Entrusting them to my sentiments towards the distant send.Day and night I dream in vain, Yet is there anyone who can sympathise and comprehend? In the power and in the wild are worlds apart, So how will my loyalty and devotion ever be consoled?."
  },
  {
    "poem": "江南有丹橘，經冬猶綠林；豈伊地氣暖？自有歲寒心。可以荐嘉客，奈何阻重深？運命惟所遇，循環不可尋。徒言樹桃李，此木豈無陰？.",
    "translate": "South of the Yangtze, there grows a variety of red mandarins. Whose trees all winter long flourish green, Is it because of the warmer climes? But rather it is the cores of such mandarins that withstand the freeze.Such mandarins are befitting offerings to esteemed guests, Yet the distance keeps them from markets reach. One abides by circumstances for such is fate, Nature ravels not even to seekers who are keen.Yet the worldly only cared to peach and plum trees cultivate, Don’t these red mandarins trees provide also shade and foliage of green?.英文翻譯 / English Translation (2011)﹕South of the Yangtze, a kind of red mandarin grows. Whose trees all winter long have leaves that remain green, One would think it is because of the warmer land that bears them, But rather it is the core of the mandarins that is capable of withstanding the freeze.Such mandarins are befitting offerings to honoured guests, Yet the distance keeps them from markets reach. One abides by circumstances for such is fate, Nature ravels not even to seekers who are keen.Yet the worldly knows only to grow peach and plum trees, Haven’t these red mandarins trees also shade and foliage of green?."
  },
  {
    "poem": "暮從碧山下，山月隨人歸；卻顧所來徑，蒼蒼橫翠微。相攜及田家，童稚開荊扉；綠竹入幽徑，青蘿拂行衣。歡言得所憩，美酒聊共揮；長歌吟松風，曲盡河星稀。我醉君復樂，陶然共忘機。.",
    "translate": "I made my descent from the Zhongnan Mountains in the twilight, The mountain moon followed me down as it rose high. I looked back on the path taken, What a sight of viridian belts traversing the hillside.On my way I encountered a mountaineer and followed him home, Where children came to open a gate made of twigs intertwined. We passed through green bamboos onto a secluded path, As we walked on, our clothes brushed past winding vines.Pleasant conversations followed in the lodge where I could rest for the night, Accompanies by good wine, we were chatty all the while. We got on to sing folk songs like Wind in the Pines, By the time we had finished singing, many heavenly stars have retired.I was drunk in merriment and high in spirit was my company, In such ambience of joy, worldly concerns and politics were out of mind..英文翻譯 / English Translation (2011)﹕I made my descent from the Zhongnan Mountains that twilight had tainted blue, The mountain moon followed me down as it rose high. I looked back on the path taken, Only to see belts of viridian traverse the hillside.On my way I encountered a mountaineer and followed him home, Where children came to open a gate made of twigs intertwined. I passed the threshold to find a secluded path behind green bamboos, As we walked along, our clothes brushed pass various vines.Inside the lodge pleasant conversations abounded and I had a resting place for the night, Accompanies by good wine, we were chatty all the while. We got on to sing folk songs like Wind in the Pines, By the time we had finished singing, many heavenly stars have retired.I was drunk in merriment and in high spirit my company was, In such ambience of joy, the world of concerns and politics was out of mind.."
  },
  {
    "poem": "花間一壺酒，獨酌無相親；舉杯邀明月，對影成三人。月既不解飲，影徒隨我身；暫伴月將影，行樂須及春。我歌月徘徊，我舞影零亂；醒時同交歡，醉后各分散。永結無情游，相期邈雲漢。.",
    "translate": "In amongst flowers with a bottle of wine I drink alone for there is no one close by. I raise my chalice to invite the shining moon, The moon casts me a shadow and we have a triad.The moon never learns to drink, My shadow absent-mindedly follows me. Nevertheless I have them around me, Moments should be enjoyed as they be.I sing and the moon lingers, I dance and my shadow whirled under. In my sober moments we rejoiced together, Once I am drunk, it is a company no longer.Such fellowship shall endure despite our parted ways, Only heaven knows when we shall come together again..英文翻譯 / English Translation (2011)﹕In amongst flowers with a bottle of wine I drink alone for there is no one close by. I raise my chalice to invite the shining moon, The moon casts me a shadow and we have a triad.The moon never learns to drink, My shadow absent-mindedly follows me. Nevertheless I have them around me, Moments should be enjoyed as they be.I sing and the moon lingers, I dance and my shadow whirled under. In my sober moments we rejoiced together, It is a company no longer once I am drunk.Such fellowship shall last despite our parted ways, When we shall come together again is up to the remote heavens above.."
  },
  {
    "poem": "燕草如碧絲，秦桑低綠枝；當君懷歸日，是妾斷腸時。春風不相識，何事入羅幃？.",
    "translate": "Silky fine is the grass of the northern region of Yan, Low and green hang mulberry branches of our western region of Qin. When you have finally started to homecoming desire, Distressed by your absence heartbroken am I.Oh, breezes of spring, I know you not, Why disturb my chamber curtains, my bedtime?.英文翻譯 / English Translation (2011)﹕Silken fine is the grass of the northern Yan region, Low and green hang branches of mulberry trees of our western Qin region. When you have finally started to homecoming desire, Distressed by your absence heartbroken am I.Oh, breezes of spring, I know you not, Why disturb my chamber curtains, my bedtime?."
  },
  {
    "poem": "岱宗夫如何？齊魯青未了。造化鐘神秀，陰陽割昏曉。蕩胸生層雲，決眥入歸鳥。會當凌絕頂，一覽眾山小。.",
    "translate": "What of the Great Mountains that hither situate? Still green everywhere are once warring states. The creation of sky and earth gathers here heavenly splendour, Bearing and geography determine light and shade.My heart expands to take in layers of floating clouds, I look out far and wide, I see birds their homeward journey make. May I one day surmount the absolute highest, For an outlook that miniaturize all mountains there lay..英文翻譯 / English Translation (2011)﹕What of the Great Mountains that hither situate? Still green everywhere are once warring states. The creation of sky and earth gathers here heavenly splendour, Bearing and geography determine light and shade.What moves me is seeing vast layers of clouds afloat, I look out far and wide, I see birds their homeward journey make. One day if I could, I’d like to rise atop the summit of all peaks, Where I could gather a sight of all mountains there lay.."
  },
  {
    "poem": "人生不相見，動如參與商，今夕復何夕？共此燈燭光。少壯能幾時？鬢髮各已蒼。訪舊半為鬼，驚呼熱中腸。焉知二十載，重上君子堂。昔別君未婚，兒女忽成行；怡然敬父執，問我來何方。問答乃未已，驅兒羅酒漿。夜雨剪春韭，新炊間黃粱。主稱會面難，一舉累十觴；十觴亦不醉，感子故意長。明日隔山岳，世事兩茫茫。",
    "translate": "We have been unable to see each other for so long, We have been like morning and evening stars that never meet in the sky. What a night this has been? For us to share this candlelight. For how long does youth last? Your hair has greyed and so has mine. Of the old acquaintances I called upon, half of them have ghosts become, Aghast and gut-wrenched I cried. All of a sudden twenty years have gone by Before I could again call on where you reside. You were not engaged when we went our separate ways, You are now married with children after all this time. They courteously greet their father’s friend, And my journey enquire. Before I could their curiosity satisfy, You have your son bringing out the wine. We nibble on spring chives just gathered in the evening rain, In a fresh meal that rough grains contain, You marvel at how unexpected such a reunion is, In one raise of a cup, you gulp down more than a pint. Pints after, high in spirit you are, yet sober still, And I am grateful for your friendship so genuine. From tomorrow, there will be mountains to us separate, What the future holds is veiled and vague."
  },
  {
    "poem": "絕代有佳人，幽居在空谷。自云良家子，零落依草木。關中昔喪亂，兄弟遭殺戮；官高何足論？不得收骨肉。世情惡衰歇，萬事隨轉燭。夫婿輕薄兒，新人美如玉。合昏尚知時，鴛鴦不獨宿；但見新人笑，那聞舊人哭？在山泉水清，出山泉水濁。侍婢賣珠迴，牽蘿補茅屋。摘花不插髮，采柏動盈掬。天寒翠袖薄，日暮倚修竹。.",
    "translate": "A fair lady of unrivalled beauty Lived in a remote valley away from society. She told of a good lineage, But had fallen to the grass roots, and on no one could she rely.Within the Great Wall once disorder raged, All her brothers were massacred and family victimised. What of the power and the glory of office so high? When in the turmoil of war they couldn’t even remains find.The fickle and shrewd of the world loathed the down and out, Everything could change just like a candle in the wind might. She was married to a philanderer, He cast her aside and took another beauty as his other wife.Mimosa furls tight in the dark, Mandarin ducks do not sleep alone at night. Yet her husband only attended to smiles of new company, Never did he care whether she would cry.In the mountains, spring water would run pure and clear, Off the mountain, spring water would dirt gather and run vile. She would send her maid to jewellery pawn so as to life sustain, And to their thatched cottage maintain she put to use morning glory vines.When she flowers picked, they were not for her hair, She would however cypress leaves hold, for they fidelity signify. She would brave the cold in her jade-colour light clothing, As she leaned against slender yet virtuous bamboos in the twilight..英文翻譯 / English Translation (2011)﹕A fair lady of unrivalled beauty, Lived in a remote valley away from society. She told of a good lineage, But had fallen to the grass roots, and on no one could she rely.Within the Great Wall once disorder raged, All her brothers were massacred and family victimised. What of the power and the glory of office so high? When in the turmoil of war they couldn’t even remains find.The fickle and shrewd of the world loathed the down and out, Everything could change just like a candle in the wind might. She was married to a philanderer, He cast her aside and took another beauty as his other wife.Mimosa furls tight in the dark, Mandarin ducks do not sleep alone at night. Yet her husband only attended to smiles of new company, Never did he care whether she would cry.In the mountains, spring water would run pure and clear, Off the mountain, spring water would dirt gather and run vile. She would send her maid to jewellery pawn so as to life sustain, And to their thatched cottage maintain she put to use morning glory vines.When she flowers picked, they were not for her hair, She would however cypress leaves hold, for they fidelity signify. She braved the cold in her jade-colour light clothing, Leaning on slender, tall and virtuous bamboos in the twilight.."
  },
  {
    "poem": "死別已吞聲，生別常惻惻。江南瘴癘地，逐客無消息。故人入我夢，明我長相憶。君今在羅網，何以有羽翼？恐非平生魂，路遠不可測。魂來楓葉青，魂返關山黑；落月滿屋梁，猶疑照顏色。水深波浪闊，無使蛟龍得。.",
    "translate": "Seeing off the dead mourners lose their voice, Seeing off the living is often just as saddening. From south of the Yangtze, the malaria ridden land, Came no news of my exiled friend.At night I dreamt of this old friend of mine, It must have been a reflection of my thoughts of him in daytime. But he must be deep in toils, For how could he have wings to hither fly? What I saw may not be his living self, The journey would take far too long and anything could arise.In my dream he arrived amid maple green, When he left, deep in blackness was the dividing range. Moonlight shone all over roof raking and beams, I wondered whether it could return colour to his face. The water was deep and wild billows make, I’d like to cautioned him to flood dragons guard against..英文翻譯 / English Translation (2011)﹕Seeing off the dead mourners lose their voice, Seeing off the living is often just as saddening. From south of the Yangtze, the malaria ridden land, Came no news of my exiled friend.At night I dream of this old friend of mine, It must be a reflection of my thoughts of him in daytime. But he must be deep in toils, How could he have wings to hither fly? What I saw may not be his living self, The distance is far too great and anything could arise.In my dream he arrived amid maple green, When he left, deep in blackness was the dividing range. Moonlight shone all over roof raking and beams, I wondered whether it could return colour to his face. The water is deep and wild billows make, I’d like to cautioned him to flood dragons guard against.."
  },
  {
    "poem": "浮雲終日行，遊子久不至；三夜頻夢君，情親見君意。告歸常局促，苦道來不易。江湖多風波，舟楫恐失墜。出門搔白首，若負平生志。冠蓋滿京華，斯人獨憔悴。孰云網恢恢？將老身反累！千秋萬歲名，寂寞身後事。.",
    "translate": "Clouds float, all day long they roam, Yet I have not seen your travelling soul for so long In the past three nights I have dreamt of you, Cordial and affectionate you were as before.You showed unease when it was time to bid farewell, And told of a perilous journey over the past nights. The rivers and lakes en route were turbulent with billows On board you feared of tumbling and loss of life. Before you stepped away you scratched your silvered hair, And looked as if you regretted having failed to achieve the kind of life you aspired.The capital is full of powerful and glorious officers, Only you were cast aside languishing and away you pine. Says who the heavenly order is thorough and fair? As it burdens an ageing fellow with more political strife! Somewhere ages and ages hence honoured you will be, Albeit after your lonesome death in time..英文翻譯 / English Translation (2011)﹕Clouds float, all day long they roam, Yet I have not seen your travelling soul for a long while. In the past three nights I have dreamt of you, You were cordial and affectionate each time.You showed unease when it was time to bid farewell, And told of a perilous journey over the past nights. The rivers and lakes en route were turbulent with billows On board you feared of tumbling and loss of life. Before you stepped away you scratched your silvered hair, And looked as if you had failed to achieve the kind of life you aspired.The capital is full of powerful and glorious officers, Only you were cast aside languishing and away you pine. Says who the heavenly order is thorough and fair? As it burdens an ageing fellow with more political strife! Somewhere ages and ages hence honoured you will be, However, it will be after your lonesome death in time.."
  },
  {
    "poem": "下馬飲君酒，問君何所之？君言不得意，歸臥南山陲。但去莫復聞，白雲無盡時。",
    "translate": "I invited you to dismount and have some wine, \"Where to from here?\" I enquired. You acknowledged you weren't having your moment, To the foot of the Zhongnan Mountains you wished to retire. Off you went and I asked no further, I knew you'd find in observing white clouds everlasting delight.."
  },
  {
    "poem": "聖代無隱者，英靈盡來歸，遂令東山客，不得顧採薇。既至金門遠，孰云吾道非？江淮度寒食，京洛縫春衣。置酒長安道，同心與我違；行當浮桂棹，未幾拂荊扉。遠樹帶行客，孤城當落暉。吾謀適不用，勿謂知音稀！",
    "translate": "A capable reign gives no excuse for becoming a recluse, The able in the capital assemble to allegiance submit. Even noted hermits of the Eastern Mountains Would set aside garden tilling to the government rejoin.This time you've travelled far to the Golden Gate reach, Who would hold contempt of your attempt so sincere? Last spring, just north of the Yangtze was where you spent the Day of Cold Fare, This spring, just south of the Yellow River you had your robes mended.Today I set a farewell banquet along the State Avenue outside the capital,Today we shall part though we share the same ideals; Soon you shall set sail on board boats with laurel oars, Before long knocking on family's brushwood-door you will be. Along the way, trees and their reflection will line the path you take, And there will be twilight reflecting off isolated townships. Although you were unsuccessful this time round, That is not a reason to assume a lack of respect from your peers!."
  },
  {
    "poem": "言入黃花川，每逐青谿水；隨山將萬轉，趣途無百里。聲喧亂石中，色靜深松里；漾漾泛菱荇，澄澄映葭葦。我心素已閒，清川澹如此。請留盤石上，垂釣將已矣。",
    "translate": "They say the way to the Yellow Flower River Is by way of the waters of the Green Creek anywise;This waterway meanders the mountains taking thousands and thousands of turns,Though such winding in length is not quite a hundred miles.When on board boats you hear uproar of waters against gravels and pebbles,In contrast is the stillness of pine woods alongside.Waters ripple revealing water chestnuts and water verdure,The reflection of reeds is clear in the water so bright.These days my mind is at leisure,Here in the Green Creek I take generous delight.Why don't I on this boulder repose,And enjoy angling for the rest of my life.."
  },
  {
    "poem": "斜光照墟落，窮巷牛羊歸。野老念牧童，倚杖候荊扉。雉雊麥苗秀，蠶眠桑葉稀。田夫荷鋤立，相見語依依。即此羡閒逸，悵然吟式微。",
    "translate": "The setting sun fell on the countryside,Time for cattle and sheep to return to shabby alleyways.The old in anticipation of shepherd boys' returnLeaned against gates of twined twigs supported by their canes.Pheasants crowed and wheat fields flourished,Silkworms into slumbers fell as mulberry trees thin on leaves became.There came farmers carrying hoes on their shoulders,Reluctant to home retire just yet, they leisurely chatted away.In admiration of farm life's peacefulness that I had seen,Disillusioned about office, I recited from the Book of Songs to Nature embrace.."
  },
  {
    "poem": "艷色天下重，西施寧久微？朝為越溪女，暮作吳宮妃。賤日豈殊眾？貴來方悟稀。邀人傅脂粉，不自著羅衣。君寵益嬌態，君憐無是非。當時浣紗伴，莫得同車歸。持謝鄰家子，效顰安可希？",
    "translate": "Beauty was held dear by the world,How could Xishi servile remain?One morning she was a silk washer in a Yue creek,By evening into Wu's palace she was received and a concubine became.In her lowly days how was she different from her peers?Now Her Highness for her rare beauty came to fame.To powder her face she called on maids,To put on robes she never had to a finger raise. Lord Wu's affection for her added to her charm,  Around her he saw no reason why he would ever fail.Women who once waded with her in the creek Could not ride with her in her carriage of the State.Let this be a note to girls of her neighbourhood,They might her angina fake but how could they ever her beauty imitate?."
  },
  {
    "poem": "北山白雲裡，隱者自怡悅。相望始登高，心隨雁飛滅。愁因薄暮起，興是清秋發。時見歸村人，沙行渡頭歇。天邊樹若薺，江畔洲如月。何當載酒來？共醉重陽節。",
    "translate": "Up in the Northern Mountains among white clouds,Being a recluse I easily in my environs took delight.Imagining that I might see you I started to climb,No sight of you saw my hope dashing away with the wild geese that flew by.Melancholy rose as the veil of twilight fell, Early autumn seemed the time when sentiments run spry. Every now and then I could see returning villagers,On the sands they trod and by the dock they waited for ferry rides.In the distance trees towered into the sky in the shape of shepherd's purse, By the river the sand bar appeared small and moon-like.I wondered if we could have a vat of wine carted up here?And we shall on the Double Ninth drink to the good old times.."
  },
  {
    "poem": "山光忽西落，池月漸東上。散髮乘夜涼，開軒臥閒敞。荷風送香氣，竹露滴清響。欲取鳴琴彈，恨無知音賞。感此懷故人，中宵勞夢想。",
    "translate": "In the mountains the sun set abruptly in the west, The moon emerged from the pond in the east.I let my hair loose enjoying the coolness of the night,I lay in the chamber with windows wide open to indulge in air so carefree.A light breeze wafted in the fragrance of lotus,Off bamboo leaves dew drops dripped in trickling beats.I thought of taking out my cittern to play,Yet regretfully there was no kindred spirit around for my music to please.Thus I thought of you, wishing you were here,On this thought I dwelled and in vain I dreamed.."
  },
  {
    "poem": "夕陽度西嶺，群壑倏已暝，松月生夜涼，風泉滿清聽。樵人歸欲盡，煙鳥棲初定，之子期宿來，孤琴候蘿徑。",
    "translate": "The sun sets over the western hills, Suddenly darkness comes over valleys and runs deep, Moonlight through pine trees brings an evening chill, Sounds of the wind and springs have my ears attentively take heed.Loggers have all but gone home, In the twilight haze, birds have just their nests reach, You were supposed to be here for a reunion, Alone with my cittern I wait, on a path where old man's beard decorated trees.."
  },
  {
    "poem": "高臥南齋時，開帷月初吐；清輝澹水木，演漾在窗戶。苒苒幾盈虛？澄澄變今古。美人清江畔，是夜越吟苦。千里其如何？微風吹蘭杜。",
    "translate": "Leisurely reclining in the South Study with my cousin,I had the curtains lifted and saw the moon that had just over the horizon climb.Moonlight so clear and pure quietly on woods and waters fell,Reflections on windows and curtains sprightly shined.Yet I wondered how many rounds had the moon waxed and waned?How different times have evolved into history under its shine.For an eloquent man like you residing next to clear waters,Bemoaning in local melodies you would been on such a night.What could we do about the thousands of miles between you and me?I only hope that breezes could fragrances of orchid and azalea diffuse far and wide.."
  },
  {
    "poem": "絕頂一茅茨，直上三十里。扣關無僮僕，窺室惟案几。若非巾柴車，應是釣秋水。差池不相見，黽勉空仰止。草色新雨中，松聲晚窗里。及茲契幽絕，自足蕩心耳。雖無賓主意，頗得清淨理。興盡方下山，何必待之子？",
    "translate": "Hoping to visit you at your mountain-top hermitage,It must have been tens of miles of climb upward.I knocked at the entry but no servant nor pupil came to the door answer,I looked through the window but saw only furniture.I took it that you were out riding on your cart,Or out fishing in autumn waters.Regretfully I missed out on an encounter,In vain was my attempt to admire you in person.Then I saw rain had given grass a new green,Then I heard pine trees rustling in the evening and the sound windows traversed. Appealed to my senses this secluded place did,And cleansed me of troubling sight and sound of the world.Although I had not the benefit of your presence,This experience had been calming and serene.Satisfied with what I came here for, Why indeed must I wait for your return?."
  },
  {
    "poem": "幽意無斷絕，此去隨所偶。晚風吹行舟，花路入溪口。際夜轉西壑，隔山望南斗。潭煙飛溶溶，林月低向後。生事且彌漫，願為持竿叟。",
    "translate": "Here secluded tranquillity has no bounds, Along the creek on a boat I am hoping to row as I please. The evening breeze helps launch my boat, At the end of this flower-decorated path I slide my boat into the creek.Night falls and a turn to the west takes me into a ravine, Over the mountains in the south the Little Dipper beams. Over a deep pond hovers a haze thick and dense, The moon sets low behind the woods in the gleam.I reflect on how unpredictable life is on earth, I'd rather be an angling old man who is at peace and at ease.."
  },
  {
    "poem": "清溪深不測，隱處惟孤雲。松際露微月，清光猶為君。茅亭宿花影，藥院滋苔紋。余亦謝時去，西山鸞鶴群。",
    "translate": "The creek here is clear but its depth unmeasured, Where resides a hermit clouds drift isolated. Over pine trees moonlight gleams, Pure and unblemished perchance for a hermit's sake.Low-lying shadows of flowers in the thatched pavilion overnight stay,In the herb garden mosses grow ingrained.Here I am about to leave behind the worldly,To the Western Mountains retire and abide with rare birds and wild cranes.."
  },
  {
    "poem": "塔勢湧如出，孤高聳天宮。登臨出世界，磴道盤虛空。突兀壓神州，崢嶸如鬼工；四角礙白日，七層摩蒼穹。下窺指高鳥，俯聽聞驚風。連山若波濤，奔湊如朝東。青槐夾馳道，宮館何玲瓏！秋色從西來，蒼然滿關中。五陵北原上，萬古青濛濛。淨理了可悟，勝因夙所宗。誓將挂冠去，覺道資無窮。",
    "translate": "The pagoda rises above the earth sublimely, Its isolated height into heaven ascends supremely. We climb atop and feel out of this world, As we mount the stone stairs, suspended in the air is the feel.Over the entire China it seems to tower over, As if built by uncanny craftsmanship to such elevation achieve; The four corners of the pagoda rise tall to the white-hot sun obstruct, Soaring to reach the vault of heaven are its seven storeys.The pagoda’s top offers a bird’s eye view that could even high flying birds guide, Leaning over we hear gusts of wind roar and scream.Mountains undulate like the surging sea, Waters rush and gather as if paying homage to the east. Lining the capital’s main avenue are pagoda trees, How the palace and buildings delicate miniatures seem! Twilight in the colour of fall casts over the city from the west, The remains of the day diffuse within the capital keeps. To the north lie five mausoleums on the plateau, Through history and dynastic changes those fields remain evergreen.I’ve come to understand the Buddhist true essence, I’ve always endeavoured to my integrity maintain and virtues seek. I hereby vow to resign from office, Buddhist principles are of eternal value to the mortal life indeed..Edited on 2019.08.20"
  },
  {
    "poem": "昔歲逢太平，山林二十年。泉源在庭戶，洞壑當門前。井稅有常期，日晏猶得眠。忽然遭時變，數歲親戎旃。今來典斯郡，山夷又紛然。城小賊不屠，人貧傷可憐？是以陷鄰境，此州獨見全。使臣將王命，豈不如賊焉？令彼徵斂者，迫之如火煎。誰能絕人命？以作時世賢。思欲委符節，引竿自剌船，將家就魚麥，歸老江湖邊。",
    "translate": "In the days of peace, For twenty years I lived among mountain woods. With a fresh water source close by, Across from my door were caves and valley nooks. The tax season was regular in those days, I could sleep unruffled even when the sun had made a fair approach towards noon.Till a sudden change of times, Many years have passed by with me in armour fighting the gloom. Now I have come to guard this state, And gangs of bandits have once more made their move. Are townships of Dao too small for the wicked to make a killing, So they take pity on the poor? While bandits raided neighbouring states, They leave the state of Dao undisturbed.Are Officers of Taxation not envoys of the Emperor, How could they in comparison to bandits be not as good? There are those pursuing taxes of various kinds who Powerless people push and on helpless people punitive pressure put. Who is there to these people save? And be a model to the world, a man of virtue.Right now I contemplate handing over my army seal, To my own boat pole and moor. I shall take my family to where we could fish and grow grains, And take my retirement by a lake or a river soon.."
  },
  {
    "poem": "兵衛森畫戟，宴寢凝清香。海上風雨至，逍遙池閣涼。煩疴近消散，嘉賓復滿堂。自慚居處崇，未睹斯民康。理會是非遣，性達形迹忘。鮮肥屬時禁，蔬果幸見嘗。俯飲一杯酒，仰聆金玉章。神歡體自輕，意欲淩風翔。吳中盛文史，群彥今汪洋。方知大藩地，豈曰財賦強？",
    "translate": "Armed guards solemnly stand watch outside, In the private chamber incense burns and its refreshing fragrance intensifies. Winds and rain drift in from the sea Cooling the pond, the pavilion and the mind.The sultry and irritating weather has all but vanished, Distinguished and respectable guests a full house gather to dine.Shame on me for although I have achieved high office, I have become too far removed from commoners' everyday life.Yet so long such disparity is brought to the fore, dealt with it shall be, Formality restricts not knowledgeable and generous minds.Though seafood and meats of red and white are limited on rations, Fortunately vegetables and fruits remain available delights. I bow to take a sip of wine, And look up to attend to compositions of poems and idylls so fine.A cheerful and satisfied soul can also the body lighten, As if to make it capable of riding the wind and flying in the sky.The Wu region has always claimed fame for cultural heritage, At this moment we have gathered here noteworthy scholars so diversified. Bearing testimony to the cultural affluence and accomplishment of this province, Says who abundance of wealth and levies is the region's only might?."
  },
  {
    "poem": "悽悽去親愛，泛泛入煙霧；歸棹洛陽人，殘鐘廣陵樹。今朝為此別，何處還相遇？世事波上舟，沿洄安得住？",
    "translate": "Parting with beloved kins and confidants is saddening and sorrowful, There sail ferry boats venturing in a heavy haze. Your boat sails forth carrying those Luoyang bound, Faint evening toll that I hear must be from the bells in the woods of the Guangling Plains.Today we bid each other farewell, Where and when would we reunite again?Life is much like boats in waves, How could anyone in steams and whirls steer and hold a level plane?."
  },
  {
    "poem": "今朝郡齋冷，忽念山中客；澗底束荊薪，歸來煮白石。欲持一瓢酒，遠慰風雨夕。落葉滿空山，何處尋行迹？",
    "translate": "It is now morning in the residence study where the cold has set in, I am suddenly reminded of the outsider who in the mountains resides; He is probably tying up some twigs and firewood by the creek To return and a decoction make, to stony doctrines follow for a spiritual life.I would like to bring him a ladle of wine, And offer him some comfort from afar in the storm of night. Yet amid piles of fallen leaves in the uninhabited mountains, Where would I his whereabouts find?."
  },
  {
    "poem": "客從東方來，衣上灞陵雨。問客何為來？采山因買斧。冥冥花正開，颺颺燕新乳。昨別今已春，鬢絲生幾縷？",
    "translate": "You arrived in Changan from the east,You had on you still Baling's spring rain. I asked, “what brings you here today?”You said you came to buy an axe so as to a clearing make.Under a moist and darkened sky it is time for flowers to bloom, And for fledgling young swallows to take to the sky and plane.   It seems only yesterday when we parted, now spring is around,  How time has passed, how many more strands of hair on your temples have turned grey?."
  },
  {
    "poem": "落帆逗淮鎮，停舫臨孤驛。浩浩風起波，冥冥日沈夕。人歸山郭暗，雁下蘆洲白。獨夜憶秦關，聽鐘未眠客。",
    "translate": "The sails were brought down for mooring by a town on the River of Huai, A roadhouse for officers stood alone by the dockside. A sudden wind caused waves to surge, As sunset turned into dimming skies.Mountains were in the shade of night and it was time to return home, By the reeds wild geese rested in flocks under the moonlight. In solitude I reminisced about my time in the capital, Then came toll of bells, heard by those having a sleepless night.."
  },
  {
    "poem": "吏舍跼終年，出郭曠清曙：楊柳散和風，青山澹吾慮。依叢適自憇，緣澗還復去。微雨靄芳原，春鳩鳴何處？樂幽心屢止，遵事跡猶遽；終罷斯結廬，慕陶直可庶。",
    "translate": "Growing tired of the burden of office all year long, At morning's first light I wander out of town to ease the mind;Willows leisurely sway in the gentle wind, The mountain green quells worries and concerns of mine.Against some thickets I rest in comfort, Along the creek I stroll to and fro taking my time. A drizzle falls across the meadow, Where are the turtle doves that I hear cooing, why are they nowhere in sight?Though longing for serenity I am subject to shuffles and missions, My pace inevitably hastens when I have imperial orders to abide by; One day when it is time to retire I shall return here to build a cottage, So as to Tao Yuanming's example follow and live with a contented mind.."
  },
  {
    "poem": "永日方慼慼，出行復悠悠。女子今有行，大江泝輕舟。爾輩苦無恃，撫念益慈柔。幼為長所育，兩別泣不休。對此結中腸，義往難復留。自小闕內訓，事姑貽我憂。賴茲托令門，仁恤庶無尤。貧儉誠所尚，資從豈待周！孝恭遵婦道，容止順其猷。別離在今晨，見爾當何秋？居閒始自遣，臨感忽難收。歸來視幼女，零淚緣纓流。",
    "translate": "I have been anxious the whole day, You departed home to a long journey take. My girl is getting married today, Upstream in the main river a small boat shall you convey.Unfortunately you and your sister had to grow up without a mother, With as much tender love and care as I could provide, you were raised.Your younger sister was brought up by you, Parting brought out endless tears from both of you on this unbearable day. Gut-wrenched I was in seeing you like this, Yet get married you rightfully should and could not have stayed.You don't have a mother to teach you on how to be a wife and a daughter-in-law, I am somewhat worried that you might fall short in serving you parents-in-law. Fortunately they are a gentle and well-reputed family, Your parents-in-law should be kind and sane.Living within means is a virtue to be adhered to, Therefore there should be no reliance on a dowry being considerable and great! Be respectful and observe your duties as a married lady, Be modest and traditions follow on how you appearance and manners maintain.This morn we bade our farewells, Who knows when we shall meet again?Though I am used to sentiments endure and quell, I cannot such gripping emotions rein. After seeing your off I returned home and saw my younger daughter, Down the ribbons off my hat more teardrops came.."
  },
  {
    "poem": "汲井漱寒齒，清心拂塵服。閒持貝葉書，步出東齋讀。真源了無取，妄跡世所逐。遺言冀可冥，繕性何由熟？道人庭宇靜，苔色連深竹；日出霧露餘，青松如膏沐。淡然離言說，悟悅心自足。",
    "translate": "To freshen up I gargle with well water that chilled my teeth, With a clear mind I pat off dust on my robes. I serenely pick up a copy of the Buddhist Scriptures, I recite as I walk towards the east quarter.Buddhist true essence is all but misconstrued by the profane,  The worldly suppose the absurd and preposterous to be hope. The Buddhist teachings can purify the spirit deep within, Yet how do we make amends to save the soul?In the courtyard of these austere practitioners all is sobering still, From verdant moss to green bamboos Nature vividly unfolds; The sun rises over the remains of morning fog and dew, As if they have been anointed, mature pines glisten and glow. In repose feeling no need for words and eloquence, Pleased with an enlightenment I feel contented and whole.."
  },
  {
    "poem": "久為簪組束，幸此南夷謫。閒依農圃鄰，偶似山林客。曉耕翻露草，夜榜響谿石，來往不逢人，長歌楚天碧。",
    "translate": "I have long been restrained by the attire of office, An exile to a remote southern state comes as a blessing in disguise. I'd spend my spare time with neighbouring farmers and growers, Into the mountains and woods I'd wander sometimes. At dawn I till the land and tend to dewy weeds, I pole my own boat striking stones in the creek at night, Where I live is out of people's way, Allowing me to sing on and on to the blue southern skies.."
  },
  {
    "poem": "蟬鳴空桑林，八月蕭關道。出塞復入塞，處處黃蘆草。從來幽并客，皆共塵沙老。莫學遊俠兒，矜誇紫騮好。",
    "translate": "In a wood of withered mulberry trees loudly creaked cicadas, Such is the August scenery of the Xiaoguan Pass. We have been to the border repeatedly and back, Where there are reeds, yellowed they all have. History has it that soldiers sent to the You and Bing regions Would eventually bite the dust or waste away like dust. One should neither envy nor take after a wandering cavalier, Who spends his time bragging about his nag.."
  },
  {
    "poem": "飲馬渡秋水，水寒風似刀。平沙日未沒，黯黯見臨洮。昔日長城戰，咸言意氣高。黃塵足今古，白骨亂蓬蒿。",
    "translate": "We set foot in autumn waters to bring our horses to drink, The waters are freezing and the wind piercing like a knife. The desert stretches on, over which the sun has not yet set, Discernible is the town of Linyao in what remains of twilight. History speaks of battles here at the Great Wall, How spirited were the soldiers dispatched from the capital with their hopes so high. The yellow dust says it all of those gathered here today and those of long ago, Pushing daisies in the wild are heroic remains in piles.."
  },
  {
    "poem": "明月出天山，蒼茫雲海間；長風幾萬里，吹度玉門關。漢下白登道，胡窺青海灣。由來征戰地，不見有人還。戍客望邊色，思歸多苦顏；高樓當此夜，歎息未應閒。",
    "translate": "The bright moon rises over the Sky Mountains,  Amidst a boundless sea of clouds it waxes and wanes; The wind gusts through and continues for thousands of miles, All the way past the Gate of Jade.The Han army was on their way to the Baideng Pass, When the Hun coveted for the shores of the Blue Lake. For so long it had been a war zone That had not allowed any to return safely.Soldiers on duty would gaze at the sights of this borderland, Though they hope for homecoming, bitter are most of their faces; Those wives on upper levels on nights like this Would be restlessly sighing time and again.."
  },
  {
    "poem": "秦地羅敷女，采桑綠水邊；素手青條上，紅妝白日鮮。蠶饑妾欲去，五馬莫留連。",
    "translate": "Here on the land of Qin, I see a young lady, By the green waters she picks mulberry leaves; Her tender arms move among fresh sprigs,Her bright red clothes rival the glowing sunbeam. Yet she is about to leave to her silk worms feedOh, linger not, my good Prefecture Chief.."
  },
  {
    "poem": "鏡湖三百里，菡萏發荷花；五月西施采，人看隘若耶。回舟不待月，歸去越王家。",
    "translate": "The Mirror Lake spreads for many a square mile, Lotus buds have started to flowers give; May was the month Xishi used to lotus flowers harvest,Many would come crowding the creek to her beauty admire. Before long she needed not wait for the rise of moon to flowers collect, Soon she was hand-picked and presented to the the Yue Palace.."
  },
  {
    "poem": "長安一片月，萬戶搗衣聲；秋風吹不盡，總是玉關情。何日平胡虜？良人罷遠征。",
    "translate": "Tonight the moon shines across all of Changan,Tens of thousands of homes resound with the pressing of winter garments; The wind of autumn blows away not the melancholy of heart,Missing their men over at the Gate of Jade women's thoughts drift far.When can the northern tribes be pacified?So their men could make their return from such long marches.."
  },
  {
    "poem": "明朝驛使發，一夜絮征袍。素手抽針冷，那堪把剪刀！裁縫寄遠道，幾日到臨洮？",
    "translate": "Tomorrow the messenger is set to depart, Tonight I am sewing a padded battle cape in haste. My hands are cold making needles hard to pull, Let alone working a pair of scissors to a piece of garment tailor!I intend to this stitchery over a long distance send, Yet for it to reach Linyao, I wonder how many days it would take?."
  },
  {
    "poem": "妾髮初覆額，折花門前劇；郎騎竹馬來，繞床弄青梅。同居長干里，兩小無嫌猜。十四為君婦，羞顏未嘗開；低頭向暗壁，千喚不一回。十五始展眉，願同塵與灰；常存抱柱信，豈上望夫臺？十六君遠行，瞿塘灩澦堆；五月不可觸，猿聲天上哀。門前遲行跡，一一生綠苔；苔深不能掃，落葉秋風早。八月蝴蝶黃，雙飛西園草。感此傷妾心，坐愁紅顏老。早晚下三巴，預將書報家；相迎不道遠，直至長風沙。",
    "translate": "I had only started to wear my hair banged, Playing around I was picking flowers in the yard at the front; You came around on your bamboo horseEncircling chairs and benches and dangling in your hand was a branch of green plums. We both lived in the region of Changgan, Two youngsters who hadn't thought much. At the age of fourteen I became your wife, Diffident and shy, low I held my head; I would retreat to a corner in the shadow, And would not answer to your call after call. At fifteen my brows started to ease, And fell for you till death do us part; You vowed to keep your promises to me, So why would I find myself on the lookout for your homecoming?  Yet when I was sixteen you had to leave home to travel far Through the Yangtze Gorges passing the Yanyu river rock, Which in May would give rise to formidable rugged waters, Gibbons' howling would come from precipices on both sides and resonate skywards.The hesitated footprints from the day you left Have already become moss-covered and green. The moss has grown so thick that sweeping could not do away, Till autumn comes early and leaves fall to the moss conceal. August sees butterflies turn yellow and frail, And in pairs they'd fly over the west chamber garden, over grass blades. Such a scene saddens me, As I sit in sorrow and wait my youth away.One day whether soon or late on your return through the towns of Ba, Do write a letter home beforehand; I care not how far I'd have to travel to receive you on your way, Even if I have to go all the way to Changfengsha.."
  },
  {
    "poem": "梧桐相待老，鴛鴦會雙死；貞婦貴殉夫，捨生亦如此。波瀾誓不起，妾心井中水。",
    "translate": "Boughs and foliage of phoenix trees cross and overlap as they age, Mandarin ducks that paddle in the water in pairs also die in pairs; Most dignified of chaste wives are ones who follow their husband even in death, Like a lone mandarin duck they'd honour their men by choosing to their own lives end.A widow's vow of chastity will any billow quell,  Her heart shall be composed and still like the waters of a deep well.."
  },
  {
    "poem": "慈母手中線，遊子身上衣；臨行密密縫，意恐遲遲歸。誰言寸草心，報得三春輝？",
    "translate": "A loving mother busied herself with needlework On clothes for a son who was going away; On the eve of his departure she sewed thread after thread, Worrying that his return would be delayed and late. How could the love of grass only inches tall Ever reciprocate spring after spring of sunshine day after day?."
  },
  {
    "poem": "前不見古人，後不見來者；念天地之悠悠，獨愴然而淚下。",
    "translate": "Those of the past were before my time,Who would be there in future I know not; I think of how heaven and earth continue on perpetually,Alone I dwell in sorrow and down flow my tears.."
  },
  {
    "poem": "男兒事長征，少小幽燕客，賭勝馬蹄下，由來輕七尺；殺人莫敢前，鬚如蝟毛磔。黃雲隴底白雪飛，未得報恩不能歸。遼東小婦年十五，慣彈琵琶解歌舞，今為羌笛出塞聲，使我三軍淚如雨。",
    "translate": "A man should fight for his nation, And should from an early age chivalrous aspire to be. Success is determined on horseback and under horse hoofs failed pledges, A man must not place importance on the corporeal; He kills and others dare not approach, Like a porcupine with flaring spines he a beard, moustache and sideburns keep.White snow drifts between clouds and fields of ochre, When there is no victory to the emperor's grace repay, there shan't be a return.A young lady of Liangdong aged only fifteen, Is well-known for her dances and skilled pipa play, Today she performs the Jiang flute for those of us going away to the frontier, Bringing our mighty army of soldiers to tears that fall like rain.."
  },
  {
    "poem": "四月南風大麥黃，棗花未落桐葉長。青山朝別暮還見，嘶馬出門思舊鄉。陳侯立身何坦蕩？虯鬚虎眉仍大顙。腹中貯書一萬卷，不肯低頭在草莽。東門酤酒飲我曹，心輕萬事皆鴻毛；醉臥不知白日暮，有時空望孤雲高。長河浪頭連天黑，津口停舟渡不得。鄭國遊人未及家，洛陽行子空歎息。聞道故林相識多，罷官昨日今如何？",
    "translate": "The southerlies of April comb through the barley field of gold, Jujube trees are still with flowers and phoenix trees thick with leaves. You bid farewell to blue mountains in the morning though you'd see them still at twilight, Outside, horses neigh, you think of your homeland as you leave.Sir, how magnanimous and liberal a man you are! You have a stout face with awe-inspiring eyebrows and a dragon beard. Within you stores a library of ten thousands scrolls,  Not content to the uncultivated yield your ideals.You often invited us to drink with you, Worldly matters bother you not, for they are slight in your mind; Once tipsy you'd recline and sleep caring not when the sun had gone down, Sometimes you'd just stare at a solitary cloud high in the sky.The Yellow River has become turbulent with billows reaching the darkened sky, At the wharf boats have stopped to people ferry.  You, a son of the Zheng region, probably has not yet home arrived, I, a traveller from Luoyang, can only let out a sigh of worry.I hear you have many acquaintances back in your home town, Being dismissed from office was then, how fare you now?."
  },
  {
    "poem": "主人有酒歡今夕，請奏鳴琴廣陵客。月照城頭烏半飛，霜淒萬樹風入衣；銅鑪華燭燭增輝，初彈淥水后楚妃。一聲已動物皆靜，四座無言星欲稀。清淮奉使千餘里，敢告雲山從此始。",
    "translate": "Tonight the host has brought out the wine for a feast, And engaged to melodies perform is a cittern master of Guangling pieces. The moon has risen high shining all over town, flying in mid sky are magpies and crows, Frost has formed on boughs and twigs and the wind sends chills through the robes;The bronze burner of exquisite incense brightly glows, First plucked and strummed is the tune of the Lu Waters, then Chu Concubine follows. Once music arises, all else in silence fall, A muted full house listened on till the sight of stars is about to be lost. I am ten thousands miles away from home assigned to the clear waters of Huai, How I wish to resign this instant so as to among clouds and mountains reside.."
  },
  {
    "poem": "蔡女昔造胡笳聲，一彈一十有八拍。胡人落淚沾邊草，漢使斷腸對歸客。古戍蒼蒼烽火寒，大荒沈沈飛雪白。先拂商絃後角羽，四郊秋葉驚摵摵。董夫子，通神明，深山竊聽來妖精。言遲更速皆應手，將往復旋如有情。空山百鳥散還合，萬里浮雲陰且晴。嘶酸雛雁失群夜，斷絕胡兒戀母聲。川為靜其波，鳥亦罷其鳴；烏孫部落家鄉遠，邏娑沙塵哀怨生。幽音變調忽飄灑，長風吹林雨墮瓦；迸泉颯颯飛木末，野鹿呦呦走堂下。長安城連東掖垣，鳳凰池對青瑣門，高才脫略名与利，日夕望君抱琴至。",
    "translate": "Lady Cai of Han gave rise to tunes specific to Tartar reed pipes. And composed a song of eighteen verses. Tartars were touched weeping on grass over the border, Even the Han envoy sent to bring her home felt her parting sorrow and felt for her. This watch tower stands in the cold in an old battlefield, Drifting snow brings a wash of white to the gloom of the Great Desert. The player started with a high note in Shang followed by low keys of Jue and Yu, Abuzz in the background is the autumnal leaves rustling in the outskirts.Master Dong, how your musical attainments do heaven reach, Even fairies deep in the mountains would come to listen in and heed. Change the tempo between slow and quick is nothing but a few gestures of your hands, Every turn of a tune is so charming with an ever affectionate feel. In the remote mountains where hundreds of birds scatter in the sky would here gather, An overcast sky for thousands of miles would suddenly sunshine beam. There resounds the sadness of fledglings of wild geese separated from their flock at night, Much like Lady Cai's Tartar sons crying for their mother not to leave. Even rivers could be made to quieten down and ease their waves, And birds would take notice and stop their tweets. Betrothed to the distant Wusun tribe far from home, the Han princess bewailed her fate, Even a general like Xue Rengui would over dusty Luosuo's remoteness grieve. A sudden wind comes to drift these mourning notes as they turn and intensify, In the gusty wind, woods rustle and whistle, and rain falls hard on roof tiles; Cascading off tips and tops of soughing trees are springing rainwater, Wild deer underneath feebly bleat doleful cries.By the eastern keep of Changan where you are assigned to take up residence, There stands the Gate of Jadeite opposite the Pond of Phoenix, Fame and fortune should shackle you not for you are a talented and learned scholar, Day and night, how I wish for you to hither arrive with your cittern.."
  },
  {
    "poem": "南山截竹為觱篥，此樂本自龜茲出。流傳漢地曲轉奇，涼州胡人為我吹。傍鄰聞者多歎息，遠客思鄉皆淚垂。世人解聽不解賞，長飆風中自來往。枯桑老柏寒颼飀，九雛鳴鳳亂啾啾，龍吟虎嘯一時發，萬籟百泉相與秋。忽然更作漁陽摻，黃雲蕭條白日暗。變調如聞楊柳春，上林繁花照眼新。歲夜高堂列明燭，美酒一杯聲一曲。",
    "translate": "Bamboos from the Zhongnan Mountains are used to make reeded pipes, This type of instrument originated from Qiuci way out in the west. Once it has spread to China, the tunes have evolved and unique become, Here is a Tartar from Liangzhou playing me a piece of note. Nearly all those around me let out a sigh or two as they listen, Moving those far from home, bringing tears to flow.Folks listen but often fail to its essence appreciate, In stormy winds ascends and descents lonely music of varying scales. Sometimes it's like withered mulberry and ancient cypress trees soughing in the chill, Or the frenzied screaming of nine phoenix fledglings,  Other times it's like the coming together of dragon hum and tiger roars, A symphony of springs, streams and various sounds narrating subdued autumnal serenity.Suddenly the tune turns to resemble the Lament of Yuyang, Projecting the lonesomeness of ochre clouds and the greying white sun. Yet another turn brings about the Spring of Willows, Depicting the royal garden in full bloom and its magnificence glow. On this New Year's Eve, the hall is lined with candles burning bright, Here I am savouring a concert in the company of good wine.."
  },
  {
    "poem": "山寺鐘鳴晝已昏，漁梁渡頭爭渡喧；人隨沙路向江村，余亦乘舟歸鹿門。鹿門月照開煙樹，忽到龐公棲隱處；巖扉松徑長寂寥，惟有幽人自來去。",
    "translate": "From a temple in the mountains comes bell toll, the day has seen the sun set, At the Yuliang wharf, uproarious are people in a hurry to board ferries; Along the sandy path there are those turning to their riverside settlements, While I'm on my boat on my return to Lumen. Lumen in the moonshine is a picture of trees and their shadows amid misty waters, Inadvertently I come to where Master Pang secluded his life; There rests solitude gated by rocky mountains and detached by a path lined with pines, Only a recluse would ever come here to retire.."
  },
  {
    "poem": "我本楚狂人，鳳歌笑孔丘。手持綠玉杖，朝別黃鶴樓；五嶽尋仙不辭遠，一生好入名山遊。廬山秀出南斗傍，屏風九疊雲錦張；影落明湖青黛光，金闕前開二峰長。銀河倒挂三石梁，香爐瀑布遙相望。迴崖沓障淩蒼蒼，翠影紅霞映朝日，鳥飛不到吳天長。登高壯觀天地間，大江茫茫去不還。黃雲萬里動風色，白波九道流雪山。好為廬山謠，興因廬山發。閑窺石鏡清我心，謝公行處蒼苔沒。早服還丹無世情，琴心三疊道初成。遙見仙人綵雲裏，手把芙蓉朝玉京。先期汗漫九垓上，願接盧敖遊太清。",
    "translate": "I've always been like the madman of Chu, Singing satires on Confucian ideals. In my hand is a cane as green as jade, As I farewell the Tower of Yellow Storks at daybreak; Distance matters not as I go around visiting the five eminent peaks hoping to find sages, For I love climbing renowned mountains in my living days.The Lu Mountains divide the land with the Archer drawing bow overhead, The landscape expands like a screen of nine folds embellished with clouds in the sky; There ripple reflections of mountains in the lake shining green dazzles, The Stone Gate Summit sits like a palace flanked by two peaks by its sides. Waters stream from hills like the Milky Way overhung, straddled by three stone bridges, Over there cascades a waterfall off the Peak of Fragrant Furnace on the other side. Surrounded and barricaded by precipices among boundless fog, I feel like I'm taking flight. Mountains are brilliantly green and clouds aglow in the morning sun, There is not a bird on the wing in the vast domain of the Wu skies. Having surmounted such height to look far into the world, There the Yangtze rushes away spectacularly, never to return. The weather is about to change as thousands of miles of glowing clouds drift in the wind, Waterfalls cap mountains like snow, down they flow on their separate ways into nine rivers.I come up with a lyric on the Lu Mountains to a folk song, As I my moments in the Lu Mountains enjoy. By the Stone Mirror I reflect on myself to clear my mind, Where Master Xie left his footprints has long been covered by layers of moss. Maybe in order to the worldly forget I should resort to alchemy, To help me accumulate intrinsic strength and focus on the essence of Taoist practice. I seem to see a sage riding among colourful clouds, She has a lotus in her hand as she makes her way towards the celestial palace. I've made a pact with you to journey to the farthest, beyond the nine levels of skies, And join the legendary Lu Ao on our way to sightsee heaven's grandness.."
  },
  {
    "poem": "海客談瀛洲，煙濤微茫信難求；越人語天姥，雲霓明滅或可覩。天姥連天向天橫，勢拔五嶽掩赤城；天臺四萬八千丈，對此欲倒東南傾。我欲因之夢吳越，一夜飛渡鏡湖月。湖月照我影，送我至剡溪；謝公宿處今尚在，淥水蕩漾清猿啼。腳著謝公屐，身登青雲梯，半壁見海日，空中聞天雞。千巖萬壑路不定，迷花倚石忽已暝。熊咆龍吟殷巖泉，慄深林兮驚層巔。雲青青兮欲雨，水澹澹兮生煙。列缺霹靂，邱巒崩摧，洞天石扇，訇然中開；青冥浩蕩不見底，日月照耀金銀台。霓為衣兮風為馬，雲之君兮紛紛而來下；虎鼓瑟兮鸞回車，仙之人兮列如麻。忽魂悸以魄動，怳驚起而長嗟！惟覺時之枕席，失向來之煙霞。世間行樂亦如此，古來萬事東流水。別君去兮何時還？且放白鹿青崖間，須行即騎訪名山，安能摧眉折腰事權貴，使我不得開心顏？",
    "translate": "Seafarers speak of uncharted lands in the East Sea, Yet all anyone has ever seen of it are billows and fog, nothing to prove such a belief.South of the Yangtze's mouth, they speak of the Heavenly Matriarch Mountains, Though around it hover clouds bright or dim, visible sometimes it her countenance.The Heavenly Matriarch touches the sky and across the it her mountains range, Her imposing manner rivals the five eminent peaks and eclipses Mount Crimson Gate; The Sky Terrace Mountains may be a hundred miles high, Yet it seems it may topple over in the south-eastern corner any day.I'd love to dream my way there and the land of Wu and Yue visualise, And take flight across the Mirror Lake and the reflected moon overnight. I'd like to reflect myself in the reflected moon, And flow with the waters to where the creek of Shan begins; There I would still be able to locate where Master Xie used to reside, Among rippling green waters and occasional howling of gibbons so clear. Donning a pair of wooden shoes like Xie, I would in a haze stairs climb as if they are the stairway to heaven, To rise above on a cliff to watch the sun emerge from the sea, And hear heavenly crows in the open sky of a summit. Among thousands of precipices and valleys, hard to follow is a trail, It's hard not to lose your way in the shade among flowers or come to boulders face. I'd hear dragons hum and bears roar surrounded by murmurs of creeks, With fear, the deep woods, forests and stratified cliffs seem to shake. Clouds livid turn and rain is about to pour, From the placid waters rises a smoky haze. Suddenly lightning strikes with thunderbolts, And the mountains crumble away, A stone gate to a cavebreaks open in a thud; Out comes the sun in an abysmally deep blue sky, On the Terraces of Immortals shines the light of day. Donning glowing clouds for robes and riding the wind like a courser, The pagan gods of clouds arrive treading on air one after another. There is a tiger playing zither while green phoenixes drive carriages, More immortals appear to their places take. Suddenly horror-stricken and aghast with apprehension, I wake up frightened to a deep breath take! There remain only the pillow and bed that I slept on, Vanished are the glowing clouds and smoky fog. Without exception such is the nature of worldly pleasures, Ever since the beginning of time everything passes away like eastbound waters.Now I bid you all farewell, I wonder when I could hither return? Release for me a white deer in a green valley, So that when I must travel far, I could ride it to eminent mountains visit, Why agree to bow my head and break my back to serve the influential and the rich, And deprivation of my happiness and an ear-to-ear grin?."
  },
  {
    "poem": "風吹柳花滿店香，吳姬壓酒喚客嘗；金陵子弟來相送，欲行不行各盡觴。請君試問東流水，別意與之誰短長？",
    "translate": "Willow catkins scatter in the wind and into the tavern breezes a flowery scent, A charming Wu lady calls out to customers to taste wine just fermented; My Jingling friends have arrived to bid me farewell, About to go yet cannot bear to break away I drink up with them goblet after goblet. Consider this, my friends, the endlessly eastbound waters And parting sorrow in comparison, which persists for a greater length?."
  },
  {
    "poem": "棄我去者、昨日之日不可留；亂我心者、今日之日多煩憂。長風萬里送秋雁，對此可以酣高樓。蓬萊文章建安骨，中間小謝又清發，俱懷逸興壯思飛，欲上青天覽明月。抽刀斷水水更流，舉杯銷愁愁更愁。人生在世不稱意，明朝散髮弄扁舟。",
    "translate": "Gone away from me Is the day of yesterday that cannot be held on to; What disturbs me Is the day today happens to be that is full of worries and gloom. For thousands of miles the wind blows sending autumn geese on their way, We shall drink to our hearts' content here on a tower with a commanding view.At the Secretariat you write time-honoured pieces, Akin to that of Xie Tao they are also refreshing and full of grace, Harbouring aspirations enthusiastic, brave and lofty, As if it could lift one into the sky to gaze at the moon up close.I could brandish my glaive at water but that interrupts not its flow, I could chalice after chalice drink up to quell the melancholy only to sink further below. Such is life that hardly expectations satisfy, Why not let the hair down tomorrow morn and set sail on a little boat.."
  },
  {
    "poem": "君不見走馬川行雪海邊，平沙莽莽黃入天。輪臺九月風夜吼，一川碎石大如斗，隨風滿地石亂走。匈奴草黃馬正肥，金山西見煙塵飛，漢家大將西出師。將軍金甲夜不脫，半夜軍行戈相撥，風頭如刀面如割。馬毛帶雪汗气蒸，五花連錢旋作冰，幕中草檄硯水凝。虜騎聞之應膽懾，料知短兵不敢接，車師西門佇獻捷。",
    "translate": "Do you not see Along the Galloping River towards the Great Salt Lake the army trudge, In the broad desert feeling at sea, whirling in the sky is ochre dust. At the Town of Wheelbase, winds of September roar at night, Shattered are rocks and even boulders on the riverbed that has become dry, Rolling in the wind are stones and pebbles scattering about far and wide. Over in the Hun territory, the grasses are turning yellow and horses well fed, Through the dust storm comes an emergency from the Golden Mountains' west, That requires a Han general to lead his troops to westwards expedite.Even at night General Feng never takes off his armour, During night marches, weapons and arms would scrape and clank one another, As their faces are exposed in the wind that cuts like swords. On horses and their mane fall snowflakes that soon are melted by sweat, And turn to frost once the horses stop, regardless if they are thoroughbreds. Even the inkwell used for drafting summonses to arms have become frozen inside the tent. Upon hearing of our intent, the Hun would no doubt suffer a fright, It is to be expected that they may not be willing to engage in a close fight, And may already be waiting at the Jushi Tribe's West Gate to submit their sacrifice .."
  },
  {
    "poem": "輪臺城頭夜吹角，輪臺城北旄頭落。羽書昨夜過渠黎，單于已在金山西。戍樓西望煙塵黑，漢兵屯在輪臺北。上將擁旄西出征，平明吹笛大軍行。四邊伐鼓雪海湧，三軍大呼陰山動。虜塞兵氣連雲屯，戰場白骨纏草根。劍河風急雪片闊，沙口石凍馬蹄脫。亞相勤王甘苦辛，誓將報主靜邊塵。古來青史誰不見？今見功名勝古人。",
    "translate": "Bugles blare in the evening from the tower of the Town of Wheelbase, Down come the flags and their tassels north of Wheelbase. A summons to arms was received last night from Quli, The Hun chieftain has amassed troops on the Golden Mountains' west. Looking to the west from the watch tower, there is only smoke and dust in the dark, Yet our Han corps are stationed at Wheelbase's north. The general intends to fly the flag and banners and westwards charge, At daybreak the sound of whistles shall begin the great march.From all sides war drums bellow billowing a sea of cloud, All corps sing military songs to even the Yin Mountains shake. Over the Hun territory where their soldiers gather, clouds seem to accumulate, Entangled in grass roots are white bones suggesting where battles once took place. Near the Sword River blow gusty winds and drifts snow far and wide, Off freezes the stony Sand Corridor, not even horse hoofs could get by.For the emperor, the general willingly all hardship and difficulties undertakes, Vowing to settle the dust at the borders to repay His Majesty's grace. Throughout time, who could forget those who history takes note of?  His achievement to date surely leaves that of many ancients in his wake.."
  },
  {
    "poem": "北風捲地白草折，胡天八月即飛雪；忽如一夜春風來，千樹萬樹梨花開。散入珠簾濕羅幕，狐裘不暖錦衾薄。將軍角弓不得控，都護鐵衣冷猶著。瀚海闌干百丈冰，愁雲黲淡萬里凝。中軍置酒飲歸客，胡琴琵琶與羌笛。紛紛暮雪下轅門，風掣紅旗凍不翻。輪臺東門送君去，去時雪滿天山路；山迴路轉不見君，雪上空留馬行處。",
    "translate": "The northerlies storm through snapping straw-like grass, Snow begins to drift in the Hun skies in August; It is all as sudden as the arrival of spring breezes overnight, At once snow falls like when thousands and thousands of pear trees blossom and thrive. Through the beaded screen snowflakes flit moistening curtains of silk, This weather makes fox coats lacking in warmth and brocade robes light for chills. The general's bow freezes and stiffens making it difficult to draw, His protective armour gets cold yet he wears it still.The boundless desert has frozen over deeply, far and wide, Under a sky of low-hanging gloomy clouds, overcast is the plight for thousands of leagues. The marshal has put out wine to bid you goodbye, With Hun lute, pipa and Jiang flute performances to entertain. Outside the tent snow continues to fall into the evening,  The wind seems to be holding the red banners still from fluttering among snowflakesI bid you farewell at the east gate of the Town of Wheelbase, The Sky Mountain pass comes under heavy snow as you take your leave; Soon I lose sight of you as you follow the turns into the mountains, All there is on the snow are hoof marks where the horses have been.."
  },
  {
    "poem": "國初以來畫鞍馬，神妙獨數江都王。將軍得名三十載，人間又見真乘黃。曾貌先帝照夜白，龍池十日飛霹靂，內府殷紅瑪瑙盤，婕妤傳詔才人索。盤賜將軍拜舞歸，輕紈細綺相追飛；貴戚權門得筆跡，始覺屏障生光輝。昔日太宗拳毛騧，近時郭家獅子花，今之新圖有二馬，復令識者久歎嗟。此皆騎戰一敵萬，縞素漠漠開風沙。其餘七匹亦殊絕，迥若寒空動煙雪；霜蹄蹴踏長楸間，馬官廝養森成列。可憐九馬爭神駿，顧視清高氣深穩。借問苦心愛者誰？後有韋諷前支遁。憶昔巡幸新豐宮，翠花拂天來向東；騰驤磊落三萬匹，皆与此圖筋骨同。自從獻寶朝河宗，無復射蛟江水中。君不見金粟堆前松柏裏，龍媒去盡鳥呼風。",
    "translate": "Ever since our empire's establishment, of artists who paint horses, The late Duke of River City would irrefutably be the most ingenious. Over the past thirty years, General Cao holds similar fame, Enabling us mortals to again admire the verve of great steeds. He once painted Night Lightning, Xuanzong's courser, So realistic was his painting that for ten days lightning struck over the Dragon Pond, A plate made of crimson agate from the treasure vault was bestowed upon him, Retrieved by a bedchamber maid on the imperial concubine's order. General Cao acknowledged the award with a dance before returning with it, From there on many visited him for a painting and came prepared with scrolls of silk; Royal relatives and the influential have been keen to his works obtain, Thinking his works could decorative screens become at home and brilliance bring.There is a drawing bearing resemblance to Taizong's steed with mane of ochre, And to contemporary General Guo's lion-head courser, In this new painting he showcases these two horses, Inspiring awe in those who have come to them adore. Both are coursers that could fend off ten thousand opponents, Though captured on fabric, unrestrained is their vigour that could ride out a storm. The other seven steeds on the painting are also extraordinary, Galloping in the freezing air smoky with snow with a remarkable flair; Leaving a series of hoof marks in snow along the catalpa-lined path, Where stable officers and boys are on standby at their service. Adorable are these nine steeds, each eager to show their animated vitality, Looking after one another with steady and noble integrity. I wonder who really loves them with painstaking zeal? Nowadays there is Wei Feng where once there was Zhi Dun the zealot.I recall when the former emperor toured towards the Summer Palace of the New Great, As the parade progressed towards the east, in the sky banners undulated; About thirty thousand horses trotted and galloped elegantly, All as spirited as the ones depicted in this painting. Ever since the passing away of Xuanzong, There hasn't been any more gallantry like river dragon slaying. Do you not see In the cypress and pine woods of the Mount of Golden Grains, Never seen again are coursers except for birds crying in the wind in vain.."
  },
  {
    "poem": "將軍魏武之子孫，於今為庶為清門。英雄割據雖已矣！文采風流猶尚存。學書初學衛夫人，但恨無過王右軍。丹青不知老將至，富貴於我如浮雲。開元之中常引見，承恩數上南薰殿。淩煙功臣少顏色，將軍下筆開生面。良相頭上進賢冠，猛將腰間大羽箭，褒公鄂公毛髮動，英姿颯爽來酣戰。先帝天馬玉花驄，畫工如山貌不同。是日牽來赤墀下，迥立閶闔生長風。詔謂將軍拂絹素，意匠慘澹經營中；斯須九重真龍出，一洗萬古凡馬空。玉花卻在御榻上，榻上庭前屹相向；至尊含笑催賜金，圉人太仆皆惆悵。弟子韓幹早入室，亦能畫馬窮殊相；幹惟畫肉不畫骨，忍使驊騮氣凋喪。將軍畫善蓋有神，偶逢佳士亦寫真；即今漂泊干戈際，屢貌尋常行路人。途窮反遭俗眼白，世上未有如公貧；但看古來盛名下，終日坎壈纏其身。",
    "translate": "The general is a descendant of Cao Wu, the Lord of Wei, But now you have been relegated to the status of a commoner of little means and ways. Gone are the days of heroic vigour of your antecedents! Yet there remain with you literary talent, certain elegance and grace. At first he studied up on the calligraphic style of Lady Wei of Jin dynasty, Only to realise you would never surpass what Wang Xizhi had achieved. Then you turned to painting and lost yourself in it as years pass you by, Meaning nothing more than floating clouds are worldly wealth and prestige.During the Kaiyuan years you were often summoned into the palace, You were graced many times and granted presence in the Southern Main Hall. The painting of Great Statesmen in the Pavilion of Billowing Smoke had faded over time, It came alive again with your creative and animated brush strokes. Virtuous premiers were each adorned with a honour crest, Fierce generals had by their waist giant bows and feathered arrows, Even the hair and beards of honoured masters were vividly painted, Bearing themselves ready for a challenge with courage in a glow. The late Xuanzong had a heavenly steed, a stallion named Jade Flower, Many artists have depicted it giving different renditions but none its verve recorded. That day it was led along to the front steps to the Great Hall, It stood tall by the gate, energetic and strong. The late emperor ordered the general to portray it on a silk canvas, Quietly you let your craftsmanship work its role; Soon enlivened were the dragon of heaven, Dashing through to make slight of all ordinary horses ever born. This painting of Jade Flower hung by the emperor's couch, A veracious comparison to its real self standing in front of the Hall; His Majesty smilingly ordered for an award of gold, Leaving stable officers and keepers feeling rather dejected and despondent.The general had a disciple when he was young, Who could also paint horses and their various appearance; Yet he painted only their exterior but not their essence, Delivering portrayals of thoroughbreds with withered spirit.The general paints well expressing such imagination, Occasionally you would also draw portraits for gentlemen; In this day and age in the tumult of war you wander, While on the road you'd draw for fellow wayfarers. At the end of your tether you have come to suffer disdainful looks and cold shoulders, There is perhaps no other artists quite as down and out as yourself; It seems that when all the fame and reputation have faded, There leaves the individual to entangle in poverty and distress.."
  },
  {
    "poem": "今我不樂思岳陽，身欲奮飛病在床。美人娟娟隔秋水，濯足洞庭望八荒。鴻飛冥冥日月白，青楓葉赤天雨霜。玉京群帝集北斗，或騎麒麟翳鳳凰。芙蓉旌旗煙霧落，影動倒景搖瀟湘。星宮之君醉瓊漿，羽人稀少不在旁。似聞昨者赤松子，恐是漢代韓張良；昔隨劉氏定長安，帷幄未改神慘傷。國家成敗吾豈敢？色難腥腐餐楓香。周南留滯古所惜，南极老人應壽昌。美人胡為隔秋水？焉得置之貢玉堂。",
    "translate": "Feeling dispirited today I think of you, my friend in Yueyang, How I struggle and wish I could fly towards you, yet bed-ridden I am. My esteemed friend, separated by waters and waters of autumn we are, Relaxing your feet in Lake Dongting you must be, looking out at the neglected and barren. Deep in the sky, in daylight and under moonshine, flights of wild geese pass me by, Green maple leaves have begin to redden, frosty is the atmosphere.In the heavenly court all dignitaries congregate around their true north, Riding on the back of a unicorn or a phoenix on an amble. There the banners embroidered with hibiscus tremble in mistiness, Casting inverted images in the waters where flow together the Xiao and Xiang. In the starry palace, the worthy have inebriated become on fine wine, Not around are winged sages who are rare to forgather. Yesterday I seemed to recall hearing about the Red Cypress Wiseman, Who I'm afraid is no other than Zhang Liang of Han; He followed the Liu family and helped establishing the capital in Changan, Though he could still an army command, he'd find current affairs extremely demanding.How dare I comment on the rise and fall of our nation? Shunning the grim and grime, some would rather dine on maple fragrance. The great historian of Han would rather in Luoyang lingered, a decision pitied by all, The appearance of the Southern Stars suggest the arrival of longevity and affluence. My esteemed friend, why do you by the autumn waters remain? How you should be called to the emperor's aid and enter the Hall of the the Great.."
  },
  {
    "poem": "孔明廟前有老柏，柯如青銅根如石；雙皮溜雨四十圍，黛色參天二千尺。君臣已與時際會，樹木猶為人愛惜。雲來氣接巫峽長，月出寒通雪山白。憶昨路繞錦亭東，先主武侯同閟宮。崔嵬枝干郊原古，窈窕丹青戶牖空。落落盤踞雖得地，冥冥孤高多烈風。扶持自是神明力，正直元因造化功。大廈如傾要梁棟，萬年回首丘山重。不露文章世已驚，未辭剪伐誰能送？苦心豈免容螻蟻？香葉終經宿鸞鳳。志士幽人莫怨嗟，古來材大難為用。",
    "translate": "In front of a shrine dedicated to Kongming stands an ancient cypress, It has boughs that are bronze-like and roots boulder-like; Its trunk of snow white barks and moist branches measures some forty arm lengths, Leaves of shady green soar for some two thousand feet toward the sky. The master and the minister have had their meet, Ever fonder of such a tree people have grown to be. The clouds above unite with those over the Magic Gorge, The chill of the moon corresponds with the frosty white of the Snow Mountain range.I'm reminded of a visit to the east of the Magnificent Pavilion some days ago, Where shrines named after the master and the premier stand side by side.  The towering ancient cypresses there have branches reaching for time-worn fields, Windows and doors of the shrines are lacking panes and the paintings mottled and pied. Such an old cypress tree may be firmly grounded and well located, Yet a solitary, lofty height is inevitably subject to more  turbulent winds. What supports them is no less than the miraculous, Allowing them to grow upright and tall is Nature's divine will.An imbalanced tower needs load-bearing beams and columns, So that tens of thousands of years later they would still be stable as hills. He flaunted not his literary skills yet he already the world astonished, There hasn't been anyone to stop a felling for good timber, yet who dares to topple it? How could the solid core escape from being eaten away by ants and mole crickets? Nevertheless, amongst its fragrant leaves and boughs still rest phoenixes. People of ideals and recluses of integrity need not complain and lament, Those of high calibre have forever found the pursuit of a congenial employment difficult.."
  },
  {
    "poem": "昔有佳人公孫氏，一舞劍器動四方。觀者如山色沮喪，天地為之久低昂。霍如羿射九日落，矯如群帝驂龍翔，來如雷霆收震怒，罷如江海凝清光。絳唇珠袖兩寂寞，晚有弟子傳芬芳。臨穎美人在白帝，妙舞此曲神揚揚。與余問答既有以，感時撫事增惋傷。先帝侍女八千人，公孫劍器初第一。五十年間似反掌，風塵澒洞昏王室。梨園子弟散如煙，女樂餘姿映寒日。金粟堆前木已拱，瞿塘石城草蕭瑟。玳筵急管曲復終，樂極哀來月東出。老夫不知其所往？足繭荒山轉愁疾。",
    "translate": "Once there was a fair lady by the name of Gongsun, She used to cause a great sensation all over when she danced with swords. Crowds would gather and build up, surprised and astonished they would be, Even heaven and earth would come together for her performance in accord. Her dancing shone like the flare when Hou Yi shot down the nine suns, And her moves were as swift as the heavenly gods on the fly in dragon chariots, She used to commence a dance with the power of thunderbolts topping all fury, And end like still rivers and seas where a clear reflection of the moon would come to port. Lonesomeness would have begun to show on her crimsoned lips and graceful sleeves, At least in her late years she had a disciple to her artistic skills pass on.This fair lady of Lingying has come to Baidi, She performed a high-spirited dance of vigour without a flaw. I went over to talk to her for a while, I couldn't help becoming sentimental as we speak of the times forever gone.The late emperor had maids of some eight thousands, Gongsun's dancing skills with swords came number one. In a turn of a hand gesture readily gone were fifty years of history, As upheavals and dust storms had the imperial court engulfed. The operatic circle of the Pear Garden had since scattered like smoke, What remains of operatic ladies' charm now cheerlessly reflects in the frosty sun. Before Xuanzong's tomb on the Golden Grain Mound now arch mature trees, The stone castle by the Qutang Gorge is surrounded by a deary field where grass rustles. Coming to an end is a lavish banquet and a busy orchestra, As music fades, sadness takes place, over in the east the moon is up. Which way should an old man like me head towards? On my callous feet in the desolate mountains, my thoughts are turning glum.霍：應為〔火霍〕合字，灼也。."
  },
  {
    "poem": "石魚湖，似洞庭，夏水欲滿君山青。山為樽，水為沼，酒徒歷歷坐洲島。長風連日作大浪，不能廢人運酒舫。我持長瓢坐巴丘，酌飲四座以散愁。",
    "translate": "Lake Stone Fish,  very much like Lake Dongting it is, The summer flow swells around a boulder in the shape of green Mount Sovereign. We take the lake as our pond and the hollow of the boulder as the crock for our wine, My fellow drinkers one after another take a seat on irregular rocks nearby. For days on end, strong winds have been stirring up giant waves, Yet it stops not people from floating tugboats of wine in the lake. On a miniature hill of the Ba Mountains I a long ladle hold out, Offering more wine in scoops to those around to the doldrums drown.."
  },
  {
    "poem": "山石犖确行徑微，黃昏到寺蝙蝠飛。升堂坐階新雨足，芭蕉葉大梔子肥。僧言古壁佛畫好，以火來照所見稀。舖床拂席置羹飯，疏糲亦足飽我饑。夜深靜臥百蟲絕，清月出嶺光入扉。天明獨去無道路，出入高下窮煙霏。山紅澗碧紛爛漫，時見松櫪皆十圍。當流赤足蹋澗石，水聲激激風吹衣。人生如此自可樂，豈必局束為人鞿？嗟哉吾黨二三子，安得至老不更歸？",
    "translate": "Mountain rocks, there were many of them, rough and tough, along a narrow trail, I arrived at a temple in the wild at twilight, overhead flew bats making sail.Towards the hall I made my way and sat on the terrace to admire the new rain by my feet, There were banana leaves broad and long, and gardenia petals plump and animated.The resident monk praised the ancient murals of Buddha inside the temple, I lit a torch to see, they were truly unique and I was amazed. He prepared a bed for me, frisked away dust and brought me a meal, It was light and vegetarian with brown rice, yet more than enough to my hunger satiate. At night I lay in silence and I heard not a hum of insects, A clear moon rose over the hills casting shine through the window panes.At daybreak I left alone unable to find my way, Up there and down below, everywhere was engulfed in a haze. As it cleared, crimson flowers and the green ravine weaved a brilliant landscape. Common were pines and oaks, they were mature with impressive waists, I stepped onto boulders under the current of the waters barefoot, As the wind stirred my robe, the waters around me loquaciously babbled and rippled away.A moment like this in life should be enjoyed, Why constrain oneself to how worldly people should behave? Oh, my fellow associates sharing the same ideals, Why haven't you retired, now that you have all reached old age?."
  },
  {
    "poem": "纖雲四卷天無河，清風吹空月舒波。沙平水息聲影絕，一杯相屬君當歌。君歌聲酸辭且苦，不能聽終淚如雨。洞庭連天九疑高，蛟龍出沒猩鼯號。十生九死到官所，幽居默默如藏逃。下牀畏蛇食畏藥，海氣濕蟄熏腥臊。昨者州前槌大鼓，嗣皇繼聖登夔皋。赦書一日行萬里，罪從大辟皆除死。遷者追回流者還，滌瑕蕩垢清朝班。州家申名使家抑，坎軻祇得移荊蠻。判司卑官不堪說，未免捶楚塵埃間。同時輩流多上道，天路幽險難追攀。君歌且休聽我歌，我歌今與君殊科。一年明月今宵多，人生由命非由他；有酒不飲奈明何？",
    "translate": "Ribbons of clouds gather and spread, not visible is the Milky Way in the sky, A light breeze wafts through, in the water softly ripples moonshine. Next to the quiet waters is the sand among the stillness of seclusion, I raise my chalice to you urging you to give us a recital. However your singing is aggrieved and your lyric bitter, Before you could finish, before I could hear all, my tears fall like rain as I cry.The waters of Dongting expand to the heaven joined by the soaring Doubtful Mountains, Water dragons creep in the water, overland gibbons and foxes howl. We've survived too many deadly setbacks to arrive at our posts on one last stretch of luck, Quietly we take up residence here as if we are hiding out. When we get out of bed and when we eat, there are snakes and poisons to fear, The moist sea air dampens everything giving rise to mould that smells rotten and foul.It seemed only yesterday when drum rolls came from the State Office, Broadcasting a prince's enthronement who is willing to employ the virtuous highbrow. Then came a decree of pardon apace as if hastened through thousands of miles a day, Allowing even those sentenced to death to carry on living. Those in exile and banished got to return to where they were, The Court was to undergo a reform for a thorough cleansing. The State Office have nominated us for review but suppressed by the Inspectors we are, We've been unfortunate and could only follow our transfer to this uncultured land of Jing. Low ranking secretarial officers we are, there's nothing to write home about, Any error could see us grovel in the dust and fall victims to a beating. Those who came with us have all but left to be on their way, The road to the capital is a difficult climb becoming ever more perplexing.Oh, have a rest, my friend, and give me a turn to sing you a bout, I have something quite different to sing about. In the space of a year, tonight's moon is the brightest and the roundest, Life is determined by fate, not by any other route; Why not drink when there is wine so we wouldn't the bright moon let down?."
  },
  {
    "poem": "五嶽祭秩皆三公，四方環鎮嵩當中。火維地荒足妖怪，天假神柄專其雄。噴雲泄霧藏半腹，雖有絕頂誰能窮？我來正逢秋雨節，陰氣晦昧無清風。潛心默禱若有應，豈非正直能感通？須臾靜掃眾峰出，仰見突兀撐青空。紫蓋連延接天柱，石廩騰擲堆祝融。森然魄動下馬拜，松柏一逕趨靈宮。粉牆丹柱動光彩，鬼物圖畫填青紅。升堦傴僂薦脯酒，欲以菲薄明其衷。廟內老人識神意，睢盱偵伺能鞠躬。手持盃珓導我擲，云此最吉餘難同。竄逐蠻荒幸不死，衣食纔足甘長終。侯王將相望久絕，神縱欲福難為功。夜投佛寺上高閣，星月掩映雲曈曨。猿鳴鐘動不知曙，杲杲寒日生於東。",
    "translate": "Customary services honouring the Five Great Mountains can be hosted by dignitaries only, Situated amidst the four mountains in four corners is the fifth, Mount Song. Denoting the element of fire, this land is barren and full of evil spirits, Heaven thus bestowed upon the mountain's spirit mighty power to the territory oversee. On the hillside, clouds and fog wreathe around, There are peaks above, yet who can the summit surmount and stand on its top?The timing of my visit coincides with the season of autumn rain, There is not a breeze in this gloomy weather that is hazy and moist. I pray quietly mustering great concentration, if I could spirits touch, Wouldn't it be because probity can really heaven reach and nature call forth? Shortly after, the weather clears up and many peaks appear, I raise my head to admire the soaring mountain range holding up a blue dome. The Peak of Violet Crown stretches over to join the Peak of Heavenly Monolith, As the Peak of Piling Boulders seems to tower over the Peak of Fire God. This awe-inspiring landscape moves me to dismount and pay my respect, Along the trail, pines and cypresses lead me to the Mountain Temple of Song. Whitewashed walls with crimson columns stand animated and glorious, Paintings of the spiritual are full of colours that interlock. I hunched my back with respect as I presented preserved meat and wine up the stairs, They represent my sincerity and faith, though immaterial are my offerings.The elder of the temple knows how to god's intent read, His eyes are wide open, bright and piercing, and still capable of bowing is his body. He holds divination wedges in his hands and teaches me how to give a proper toss, He then says my toss returned a most auspicious forecast matched by no other. I suppose being still alive after an exile to savage lands for so long, I'd be satisfied if for the rest of my life I never had to worry about food and clothes. Forever gone for me is the hope of becoming a general, a minister or a nobleman, Not even the blessing of the mountain's spirit could make it come off.In the tower of the temple I take up my lodging for the night, The moon and stars are enshrouded by clouds, and their shine obscured. Amid howling of gibbons and tolling of bells, there arrives dawn unnoticed, I wake up and see the frosty sun gaining height in the east inspiring awe.."
  },
  {
    "poem": "張生手持石鼓文，勸我試作石鼓歌。少陵無人謫仙死，才薄將奈石鼓何？周綱淩遲四海沸，宣王憤起揮天戈；大開明堂受朝賀，諸侯劍佩鳴相磨。搜于岐陽騁雄俊，萬里禽獸皆遮羅。鐫功勒成告萬世，鑿石作鼓隳嵯峨。從臣才藝咸第一，揀選撰刻留山阿。雨淋日炙野火燎，鬼物守護煩撝呵。公從何處得紙本？毫髮盡備無差訛。辭嚴義密讀難曉，字體不類隸與蝌。年深豈免有缺畫？快劍砍斷生蛟鼉。鸞翔鳳翥眾仙下，珊瑚碧樹交枝柯。金繩鐵索鎖鈕壯，古鼎躍水龍騰梭。陋儒褊詩不收入，二雅褊迫無委蛇。孔子西行不到秦，掎摭星宿遺羲娥。嗟予好古生苦晚，對此涕淚雙滂沱。憶昔初蒙博士徵，其年始改稱元和。故人從軍在右輔，為我度量掘臼科。濯冠沐浴告祭酒，如此至寶存豈多？氈包席裹可立致，十鼓祇載數駱駝。薦諸太廟比郜鼎，光價豈止百倍過。聖恩若許留太學，諸生講解得切磋。觀經鴻都尚填咽，坐見舉國來奔波。剜苔剔蘚露節角，安置妥帖平不頗。大廈深簷與蓋覆，經歷久遠期無佗。中朝大官老於事，詎肯感激徒媕婀？牧童敲火牛礪角，誰復著手為摩挲？日銷月鑠就埋沒，六年西顧空吟哦。羲之俗書趁姿媚，數紙尚可博白鵝。繼周八代爭戰罷，無人收拾理則那。方今太平日無事，柄任儒術崇丘軻。安能以此上論列？願借辯口如懸河。石鼓之歌止於此，嗚呼吾意其蹉跎。",
    "translate": "Zhang Ji had in his hand a copy of the Stone Drum inscriptions, He urged me to try and write an ode to the inscribed stone drums. Poets like Du Fu of Shaoling and Li Bai of transcendent genius had died, How could I his request comply when I am not talented enough?Failure to adhere to law and discipline caused Zhou dynasty's to suffer civil unrest, Emperor Xuan exerted himself and led an battle to bring about a restoration; Assembled in a grand hall he accepted the congratulations of the lords, Where swords and jades by their waist clattered as they with each other shoulders rubbed. Out on an autumn hunt on the sunny side of Mount Chi he showed his omnipotence, Capturing every bird and beast over tens of thousands of square fathoms. Recording officers made notes of his greatness to history pass on, And chiselled drums out of rocks by smoothing away all corners and roughness. His courtiers had first-rate talent and skills, Prudently they selected a number of pieces to leave there in the mountains.Though these stone drums have suffered the elements of weather and wild fire, They have been protected and looked after by spirits and souls sedulously.My friend, from where did you obtain a copy of these inscriptions? The script appear intact and without smudges. The phrases and sentences are strictly worded and profound, The script is neither clerical nor archetypical. Since the inscriptions are of great antiquity, could they be lacking in brush strokes? Vigorous are the strokes, like swift sword movements that could dragons slash asunder. Some strokes seem like phoenixes fluttering in the wind carrying heavenly gods, Or like green coral branches with sprigs and sprays that interlock. Some seem to have the strength of golden strings and iron wires, tightly intertwined, Or like an ancient tripod aplomb in the water over which a dragon shuttles. Submissive scholars did not include these inscriptions into the Book of Songs, The two Refined Texts are scanty in their collections, rendering them rather unsubstantial. When Confucius toured towards the west, he never made it as far as Qin, His collection of texts was like that of celestial bodies but without the moon and the sun.For I am an admirer of antiquities, it is my regret that I was born ages to late, Seeing a rubbing of these inscriptions makes my tears pour and run. I remember the days when I was just bestowed a doctorate and professorship,  That was also the year we the Yuanhe era entered upon. I have a friend who is a major in the army, He made arrangements to excavate sites for these stone drums. So I gave myself an ablution and prepared for a ceremony, I reminded them, there couldn't be many of them extant, could there? They should have any uncovered wrapped in felt mats, Then they should be able to haul the ten drums here on camel-back. They should be consecrated in the Great Shrine like the tripods from the Gao region, Their worth would be beyond a hundredfold the labour and tug. If our emperor could allow them to be kept in the Great Academy, Then all pupils could participate in discussions to the inscriptions study. The Han script was regularised on a stele erected by the Grand City Gate for all to see, Many came from all over travelling great distances to transcribe and take a rubbing. After gouging out and picking off the mosses to reveal the edges and turns of the strokes, They should be placed in a secure environment protected from harm and roughness. Under a mansion of extensive coverage and wide overhanging eaves, The artefacts would be able to ages survive without enduring sufferings.The dignitaries of our court are experienced officers at work, Why couldn't they weigh in on this matter to indecision resolve? The drums were left behind for shepherd boys to fire strike and bulls their horns sharpen, Who would be there to heritage hold on to and culture cultivate? By and by, with the setting of the sun and waning of the moon they'd suffer neglect, For the past six years this matter in the west has occupied my mind, yet all is in vain, Not concerned with accuracy, Wang Xizhi used to sell his elegant writing, It would only take a few sheets of his scrawl in exchange for white geese that he loved. After Zhou, there have been eight dynasties of chaos and warring, Without someone to the society set straight, orderliness could only stumble. Nowadays in quiet times, peace reigns, Followers of the revered Confucianism are praising Kong Qiu and Meng Ke, How could I ever make them see the merit of my recommendation? How I wished I could rely on their eloquence to support my suggestion. My ode to the Stone Drum Inscriptions comes to an end on this note, Aye, my idea and ideal could only idle way in my consciousness.."
  },
  {
    "poem": "漁翁夜傍西巖宿，曉汲清湘燃楚燭。煙銷日出不見人，欸乃一聲山水綠。迴看天際下中流，巖上無心雲相逐。",
    "translate": "An old angler I am, I put up by a bluff on the west side of the river for the night, At dawn I draw water from the crystalline Xiang and with bamboos of Chu I build a fire. Fog has faded and scattered away yet there is still no other in sight, In the green of the mountains and waters I pole my boat away as I heave a sigh. I turn around to see the distant horizon, from where pour torrents of white water, Over the bluff drift mindless clouds chasing one another in the sky.."
  },
  {
    "poem": "漢皇重色思傾國，御宇多年求不得。楊家有女初長成，養在深閨人未識。天生麗質難自棄，一朝選在君王側。回眸一笑百媚生，六宮粉黛無顏色。春寒賜浴華清池，溫泉水滑洗凝脂；侍儿扶起嬌無力，始是新承恩澤時。雲鬢花顏金步搖，芙蓉帳暖度春宵；春宵苦短日高起，從此君王不早朝。承歡侍宴無閒暇，春從春遊夜專夜。后宮佳麗三千人，三千寵愛在一身。金星妝成嬌侍夜，玉樓宴罷醉如春。姊妹弟兄皆列士，可憐光彩生門戶。遂令天下父母心，不重生男重生女。驪宮高處入青雲，仙樂風飄處處聞。緩歌謾舞凝絲竹，盡日君王看不足。漁陽鼙鼓動地來，驚破霓裳羽衣曲。九重城闕煙塵生，千乘萬騎西南行。翠華搖搖行復止，西出都門百余里；六軍不發無奈何，宛轉蛾眉馬前死。花鈿委地無人收，翠翹金雀玉搔頭。君王掩面救不得，回看血淚相和流。黃埃散漫風蕭索，雲棧縈紆登劍閣。峨嵋山下少人行，旌旗無光日色薄。蜀江水碧蜀山青，聖主朝朝暮暮情。行宮見月傷心色，夜雨聞鈴腸斷聲。天旋地轉回龍馭，到此躊躇不能去。馬嵬坡下泥土中，不見玉顏空死處。君臣相顧盡沾衣，東望都門信馬歸。歸來池苑皆依舊，太液芙蓉未央柳；芙蓉如面柳如眉，對此如何不淚垂？春風桃李花開日，秋雨梧桐葉落時。西宮南內多秋草，落葉滿階紅不掃。梨園子弟白發新，椒房阿監青娥老。夕殿螢飛思悄然，孤燈挑盡未成眠。遲遲鐘鼓初長夜，耿耿星河欲曙天。鴛鴦瓦冷霜華重，翡翠衾寒誰與共？悠悠生死別經年，魂魄不曾來入夢。臨邛道士鴻都客，能以精誠致魂魄；為感君王輾轉思，遂教方士殷勤覓。排空馭气奔如電，升天入地求之遍；上窮碧落下黃泉，兩處茫茫皆不見。忽聞海上有仙山，山在虛無縹緲間。樓閣玲瓏五雲起，其中綽約多仙子。中有一人字太真，雪膚花貌參差是。金闕西廂叩玉扃，轉教小玉報雙成。聞道漢家天子使，九華帳里夢魂驚；攬衣推枕起徘徊，珠箔銀屏迤邐開。雲鬢半偏新睡覺，花冠不整下堂來。風吹仙袂飄飄舉，猶似霓裳羽衣舞。玉容寂寞淚闌干，梨花一枝春帶雨。含情凝睇謝君王，一別音容兩渺茫。昭陽殿里恩愛絕，蓬萊宮中日月長。回頭下望人寰處，不見長安見塵霧。唯將舊物表深情，鈿合金釵寄將去。釵留一股合一扇，釵擘黃金合分鈿；但教心似金鈿堅，天上人間會相見。臨別殷勤重寄詞，詞中有誓兩心知，七月七日長生殿，夜半無人私語時：在天願作比翼鳥，在地願為連理枝。天長地久有時盡，此恨綿綿無絕期。",
    "translate": "Tang Emperor Xuanzhong lusted after a beauty worthy of taking a country to war for,For so many years of his reign, unfulfilled his wish remained.There was a Yang family whose daughter had come of age,She was well kempt in her boudoir unknown to the social scene.Yet her natural beauty had spelt her destiny that could not be forsaken,Into the palace she did go and by the Emperor's side she was received.As she turned her head, one smile enchanted all,Outshining all women in the Palace who in comparison had their colour lost.In spring chill, the Emperor bestowed on her a bath in the Splendid Pond,A natural thermal spa with salubrious waters to her milky skin cleanse; A maid helped to support her lady-like delicacy,Thus began the Emperor's adoration of this fair lady. She had a florid face and cloud-soft hair adorned with glittering golden beads that swayed, Behind bedchamber curtains painted with lotus, springtime passion was in play; Springtime passion made speed of night and in no time the sun had risen high,The Emperor stopped attending the morning assembly on state affairs.Pleasing the Emperor and accompanying him at banquets took up all of her time,Springtime is for garden wayfaring and the night-time for bedchamber private affairs.The Emperor's beauty mansions held three thousand fair ladies,Whom the Emperor could have adored but he chose to dote on Lady Yang alone.In her gilded chamber she prepared for the Emperor's night entertainment,After a banquet on a majestic pavilion she'd waver down in sensual high.All of her brothers and sisters were awarded with prominent official titles,All the power and glory because of her on one family fell.Hence all fathers and mothers of the world,Would rather than boys girls bear and raise.The Li Palace soared into the sky among clouds,From there heavenly music drifted in the wind far and wide.Soothing singing and amatory dancing intertwined with strings and pipes,The Emperor indulged day and night ever wanting more.Until suddenly war drums from Yuyang had the capital's earth quaking,Sprung out of tune  was Lady Yang's dance in the Rainbow Dress and Feather Robe.The revolt stormed near bringing smoke and dust to the palace towers,The Emperor decided to south-west retreat with his cavalry of tens of thousands.The Emperor's coach with a jade flower flag made way and stops now and again,West of the capital for mere tens of miles they rode; Then the army refused to continue course, the Emperor in dilemma had to consent To the now wailing Lady's execution at once in front of horses for all to see.Strangled she was, her bejewelled hair pieces were left scattered on the ground,Jade and golden ornaments that used to adorn her hair.The Emperor could not the fair lady rescue nor bear to watch,When he did look back, he wept tears that flowed also blood.The bleakness lingered in the bitter wind storming the yellow earth sky high,The retreat continued through alpine passes from the Cloudy to the Sword-like.The foot of the Emei Mountains in the Shu region used to little traffic see,Yet lacklustre was the feel of the Emperor's flag and daylight appeared weak. The waters of Shu were blue and its mountains green,The Emperor however was day after day consumed by the remembrance of love lost.At his temporary residence, the moon offered nothing but added to his grieve,The rain and bells at night rang the sound of his heart broken in pieces.After moving heaven and earth, the Emperor returned in his dragon coach,Stopping at where his Lady died, unable to move on, long he lingered.For beneath the soil of the Mawei Slopes must be where his lady lied,Though her beautiful face of pure jade might have in vain sacrificed.The Emperor and his courtiers looked on, their collars damp with tears,Their loosely reigned horses sauntered eastward towards the capital gates.The palace gardens and ponds were as they had always been in their comeback,The hibiscus in the Taiye Pond blossomed, the willows in the Weiyang Mansion thrived; The hibiscus was like the late Lady's face and the willows her eyebrows,With such scenery, how could the Emperor not be reminded of the Lady's countenance?How they had seen together the peach and plum blossoms in the spring breeze,How they had watched the leaves leave phoenix trees in autumn rain.The Emperor now resided in the south-western mansion full of autumn vegetation,Where stairs were covered in reddened leaves and no one would come by to sweep. The operatic circle students' hair had begun to turn grey,Eunuchs and maids at the late Lady's mansion had aged and faded away.The palace had a lonely place become, even fireflies of night could not it enliven,The Emperor's lament would wear a lone candle to its end on sleepless nights.Night-hour gongs gonged the start of long nights,Starry light lighted so bright resembling daybreak time.Palace roof figurines of mandarin ducks were covered cold in heavy frost,With whom could the Emperor share the now warmth-lacking kingfisher feather quilt? In a daze, the passing of the late Lady had been a year in time,Yet her spirit never once the Emperor's dream entered for a rendezvous.A Taoist priest from Lingqiong of the region of Shu,Claimed to with his sincere and pure faith dead spirits reach; As the Emperor seemed forever engrossed in the remembrance of the late Lady,The priest was summoned to seek attentively for her spirit.In lightening speed he glided in thin air and navigated the clouds,He searched everywhere in the sky and on the earth but failed to her spirit find; He exhausted all avenues in heaven and the nether world,Boundless and vast as they were, he could not her existence bring to light.Then he heard of tales of a celestial mountain in the sea,That lay in the mid of misty nowhere. In the mountains amongst clouds of rainbow colours existed delicate architecture,And there lived many beautiful fairies.Of them there was a fairy named True Faith, same as the late Lady,With whom the fairy shared much similar snow-white skin and flowery face.The priest came to the gate of the golden West Hall to knock on a door of jade,And asked the heavenly maid and matron to their fairy lady notify.Upon hearing the arrival of the Emperor's envoy,The Lady resting behind her canopy of nine flowers was startled and aroused; She pushed aside her pillow to get dressed, then she hesitated and paced,Surrounded she was by veils of golden beads and silvery mirror panes. Her luxuriant mane was lopsided from having just woken up,She came to the main hall with her crooked laureate unadjusted.Her clothes and sleeves were fluttering in the breeze,It was like a scene from the Lady's dance of the Rainbow Dress and Feather Robe.Her beauty is marred by loneliness with her tears in streams,Muck like a pear flower blooming after the rain.She gazed at the priest in silence to her gratitude to the Emperor convey,Since parting they could not each other's voice hear nor visage behold.Their warmth and love were left behind in the Mansion of Morning Sun,Her days in the fairy court were long and indefinitely prolonged was time.When she looked back to the temporal world,She could not see Changan the capital but dusty and misty skies.What remained of the bygone days were two keepsakes,A jewellery casket and a golden hairpin for the priest to the Emperor take.One half of the hairpin and one tray of the casket she would keep,Breaking the pin and the box into parts; She hoped the Emperor's love would be as unflinching as their pledge,So they could be reunited in heaven or on earth in another life.Upon bidding farewell to the Emperor's emissary she reminded him repeatedly,To relay to the Emperor a poem wherein contained their secret oath, Once on the seventh night of the seventh moon in the Hall of Eternity,When no one was around they whispered words of love in the depth of night: \"In heaven above let us be one-winged birds and only in pairs fly,On earth let us be neighbouring trees with our branches intertwined.\"Yet even if eternal heaven and earth ever had an end, Never-ending would be this couple's immortal regret.."
  },
  {
    "poem": "潯陽江頭夜送客，楓葉荻花秋瑟瑟。主人下馬客在船，舉酒欲飲無管弦；醉不成歡慘將別，別時茫茫江浸月。忽聞水上琵琶聲，主人忘歸客不發。尋聲暗問彈者誰？琵琶聲停欲語遲。移船相近邀相見，添酒回燈重開宴。千呼萬喚始出來，猶抱琵琶半遮面。轉軸撥弦三兩聲，未成曲調先有情。弦弦掩抑聲聲思，似訴平生不得志。低眉信手續續彈，說盡心中無限事。輕攏慢撚抹復挑，初為霓裳後六么。大弦嘈嘈如急雨，小弦切切如私語：嘈嘈切切錯雜彈，大珠小珠落玉盤。間關鶯語花底滑，幽咽泉流水下灘。水泉冷澀弦凝絕，凝絕不通聲漸歇。別有幽愁暗恨生，此時無聲勝有聲。銀瓶乍破水漿迸，鐵騎突出刀鎗鳴。曲終收撥當心畫，四弦一聲如裂帛。東船西舫悄無言，唯見江心秋月白。沈吟放撥插弦中，整頓衣裳起斂容。自言本是京城女，家在蝦蟆陵下住。十三學得琵琶成，名屬教坊第一部。曲罷曾教善才服，妝成每被秋娘妒。五陵年少爭纏頭，一曲紅綃不知數。鈿頭銀篦擊節碎，血色羅裙翻酒汙。今年歡笑復明年，秋月春風等閑度。弟走從軍阿姨死，暮去朝來顏色故；門前冷落車馬稀，老大嫁作商人婦。商人重利輕別離，前月浮梁買茶去。去來江口守空船，繞船月明江水寒。夜深忽夢少年事，夢啼妝淚紅闌干。我聞琵琶已歎息，又聞此語重唧唧。同是天涯淪落人，相逢何必曾相識？我從去年辭帝京，謫居臥病潯陽城。潯陽地僻無音樂，終歲不聞絲竹聲。住近湓江地低濕，黃蘆苦竹繞宅生。其間旦暮聞何物？杜鵑啼血猿哀鳴。春江花朝秋月夜，往往取酒還獨傾。豈無山歌與村笛？嘔啞嘲哳難為聽。今夜聞君琵琶語，如聽仙樂耳暫明。莫辭更坐彈一曲，為君翻作琵琶行。感我此言良久立，卻坐促弦弦轉急。淒淒不似向前聲，滿座重聞皆掩泣。座中泣下誰最多？江州司馬青衫濕。",
    "translate": "Seeing off my guests at night at the Xunyang terminal of the Yangtze, Maple leaves and white reed flowers scatter over a green field an autumn scene. I had dismounted from my horse and boarded a boat were my guests, We raised our drinks to toast but there was no music to the atmosphere complement; Inebriated we became but gathered little enjoyment as parting drew near, By this time, soaking in the vast river waters was a reflection of the moon. Suddenly from over the waters came the sound of pipa play, That had me forgetting to home return and my guests reluctant to set their sail. We followed the melody and enquired, “who plays?”The performance stopped and hesitating was the reply. We floated our boat over to request a meeting, Then we called for more wine and dishes to go with it, and had the lamps rekindled. It was after many invitations, call after call, before she showed herself, Even then, she held her pipa close and revealed only half of her countenance. She picked a few notes as she her pipa strings tightened and tuned, Evoking a sentimental appeal even before a melody was played. It was as if every string held suppressed emotions released note by note, As if recounting her disappointing life that didn't her expectations meet, not even close. She lowered her head and continue to casually pick and strum, Emptying out what had been repressed within, her misery and sorrows. Her was skilled with the strings, be it a light pluck, a slow stroke, a strum or a pick, Firstly she played the tune, the Rainbow Dress and Feather Robes, then the Little Six. Like pelting rain, the bass strings give a deep and raucous timbre, Like a whisper, the treble strings spring a light and gentle tone; Notes high and low a composition form as she played, It was like countless beads of large and small falling onto a jadeite plate. At one time it flowed agreeably like the warble of orioles flitting through flowers, Then it turned into a seemingly suppressed sob of spring water over a sandy trail. Frigid seemed the strings uttering notes sounding like springs cold and jolted, Cold and jolted, it came to a halt. Muted was the music, yet gloomy was the stillness that had begun to regret manifest, Right then, no sound could compete with what such a resounding silence could carry. All of a sudden, it was like an exploding water bottle bursting forth splashes and sprays, Or like the clanking of crossing swords when the cavalry makes a raid. At the end of a tune, she gathered the strings in the heart of the pipa in a stroke, The music from all four strings end on a silk tear of a note. There was her boat and there was ours, both carrying silence, In the river waters there reflected the autumn moon brightly aglow.In her reticence she replaced the pick among the pipa strings, She then smoothed her clothes to stand up and put on a reserved expression. She said: “I had my origin in the capital, My home was in the southern red-light district. At the age of thirteen, I became learned in pipa, In the performers' circle, I was the one with top-notch distinction. At the end of my performance, even music masters would offer their compliments, With make-up my visage would sicken many a courtesan with jealousies. Young men of the capital's noble hills would rush before me to riches proffer, For every tune I played, I received countless pieces of silk and satin. Many of my hairpins and jewellery fell to pieces as I clapped to the beats as I sang, My scarlet silk skirt was used to becoming stained with tipped over drinks. Year after year time went by in cheers as I made my living, In my neglect, beautiful scenes of the changing seasons had slid by. One day, my brother was conscripted by the army and my aunt died, Gone was dawn and arrived dusk, overnight my looks were a thing of the past; Coaches seldom came by my door to bring any to attention pay, Being past my prime, I had little option but to marry a trader.In business, parting plays second fiddle to achievable profits, Just last month he set off for Fuliang to buy tea. Leaving me here by the terminal minding the boat. A bright moon makes the waters seem colder as I stay on board and afloat. Deep in the night I'd dream of my youthful years, Sometimes I'd wake up with tears running rusty streaks on my powdered face.”Her pipa play already had me heaving sighs of lament, Hearing her account further depressed me deep in grief. We are both disadvantaged wayfarers of this world, Must we be acquaintances in order to compassion show as our paths cross? “As for me, I left the capital last year, To come to my demoted post here in the town of Xunyang, and fell ill. Xunyang is remote in location and there is no music around, All year round I've heard not a note of orchestral sound. Where I live is close to the Pen River, a damp low-lying area, Yellow reeds and bitter bamboos around my cottage thrive. In such an environment what do I have to listen to day and night? Nothing but blood-weeping cuckoos and howling gibbons. Be it a flowering spring day on the river or a moonlit autumn night, I would often take out some wine to drink by myself. You may ask, aren't there folk lores and local flutes?Yet harsh and hoarse they seem, hardly music to ears. Tonight upon hearing your pipa play, It was like immersing in heavenly sounds enlightening my sense of hearing. Please decline not, play us an encore, I shall write for you a poem on your pipa play, an ode.”She heard me and there long she stood, Then she sat down, tightened the strings and plucked a tune of rapid movement. Sad and sombre was the tone, unlike the sonorous melodies of before, This time everyone there covered their faces to sob. Among them who shed tears the most?It had to be a lieutenant of the River State, so drenched in tears was his blue robe.."
  },
  {
    "poem": "元和天子神武姿，彼何人哉軒與羲。誓將上雪列聖恥，坐法宮中朝四夷。淮西有賊五十載，封狼生貙貙生羆。不據山河據平地，長戈利矛日可麾。帝得聖相相曰度，賊斫不死神扶持。腰懸相印作都統，陰風慘澹天王旗。愬武古通作牙爪，儀曹外郎載筆隨，行軍司馬智且勇，十四萬眾猶虎貔，入蔡縛賊獻太廟，功無與讓恩不訾。帝曰汝度功第一，汝從事愈宜為辭。愈拜稽首蹈且舞：金石刻畫臣能為，古者世稱大手筆，此事不係於職司，當仁自古有不讓。言訖屢頷天子頤。公退齋戒坐小閣，濡染大筆何淋漓。點竄堯典舜典字，塗改清廟生民詩。文成破體書在紙，清晨再拜舖丹墀。表曰臣愈昧死上。詠神聖功書之碑。碑高三丈字如斗，負以靈鰲蟠以螭。句奇語重喻者少，讒之天子言其私。長繩百尺拽碑倒，麤沙大石相磨治。公之斯文若元氣，先時已入人肝脾，湯盤孔鼎有述作，今無其器存其辭。嗚呼聖皇及聖相，相與烜赫流淳熙。公之斯文不示後，曷與三五相攀追？願書萬本誦萬過，口角流沫右手胝，傳之七十有二代，以為封禪玉檢明堂基。",
    "translate": "The emperor of the Yuanhe era was holy and mighty, Who was he if not another god comparable to the ancient Xuanyuan and Fuxi. He was determined to emerge from former eras' disgrace and imperial radiance revive, And sit on high in the Hall of Ordinance to receive allegiance of all foreign tribes.For fifty years, west of the State of River Huai had been troubled by rebels, Those wolves and hyena had been breeding generations of ravenous wildcats. They held on not to geographical strongholds but plains, Seemingly commanding even the sun, they brandished their spears and pikes. Emperor Xianzong had the help of a fine premier by the name of Pei Du, Who by the will of gods rebels' assassination survived. With the seal of a premier by his waist he was given an army to command, On a gloomily windy day, they marched out with banners in the name of the empire. He had Li Suo, Han Gong Wu, Li Dao Gu and Li Wen Tong as his vanguards, And many civil servants attending as military secretaries by his side, His marching lieutenant Han Yu  was wise and brave, One hundred and forty thousand solders fought like bears and tigers, After Caizhou was quelled and the head rebel caught as an offering to the Great Shrine, Boundless was the emperor's grace as he their merit, reward and modesty umpired.The emperor said: “Pei Du, your achievement ranks first and foremost, Your subordinate Han Yu should for this event an essay write.” Overwhelmed with joy Han Yu kneeled and bowed in appreciation and said:  “A composition for a stone monument, that I am able to provide, In the old times they call such a person a man with an exaggerated brush, This is a matter of nothing to do with official position or rank, And modesty never applies when it comes to shouldering benevolent acts.”His words had the emperor nodding again and again to his approval emphasise.After the assembly Han had an ablution and entered into abstinence, on a pavilion An uninhibited writing with exhaustive details came from his brush of literary style. He easily adapted from the volumes on Yao and Shun to Xianzong describe, And borrowed from chapters within the Book of Songs as he poetised. His composition was like no other put on display on paper, At dawn he laid it out on the red steps inside the Palace and to the emperor he recited. Then he submitted it and said: “you foolish subject now dares his life to this present.” In praise of the emperor's feats, such writing was to be on a monument inscribed.A thirty-feet monument in stone was erected with large characters, Carved with vignettes of dragon totems and sea tortoises at the base to support signify. For the sentences were exceptional and profound, very few could comprehend, Accusing him of selfish motives, some approached the emperor to him vilify. The monument was pulled down with a rope of a hundred feet, They sanded with grits and stones till there was nothing left of the inscribed. Nonetheless Han's composition was like integrity inherent of heaven and earth, Its spirit had been readily absorbed by all and taken root deep inside. Like the inscriptions on the plate of Tang and the tripod of Kong, No longer in existence are those vessels, yet those writings have survived.Aye, the holy emperors and exceptional premiers of history Left their eminence clear and aglow for ages that followed. Since Han's composition had not the opportunity to be preserved for posterity, Why don't I and a few friends follow it with devotion? We are willing to transcribe it and recite it ten thousand times each, Till we are foaming at the mouth and our right hand callused and coarse, So that it could be passed on for seventy two generations to come, As a model for prayer box inscriptions and litanies for enthronement and ceremonies.."
  },
  {
    "poem": "漢家煙塵在東北，漢將辭家破殘賊。男兒本自重橫行，天子非常賜顏色。摐金伐鼓下榆關，旌旆逶迤碣石間。校尉羽書飛瀚海，單于獵火照狼山。山川蕭條極邊土，胡騎憑陵雜風雨。戰士軍前半死生，美人帳下猶歌舞！大漠窮秋塞草腓，孤城落日鬭兵稀。身當恩遇常輕敵，力盡關山未解圍。鐵衣遠戍辛勤久，玉筋應啼別離後；少婦城南欲斷腸，征人薊北空回首。邊庭飄颻那可度？絕域蒼茫更何有。殺氣三時作陣雲，寒聲一夜傳刁斗。相看白刃血紛紛，死節從來豈顧勳？君不見沙場征戰苦？至今猶憶李將軍。",
    "translate": "Han has a troubling and volatile frontier in the north-east, Han's soldiers have to leave their home to battle a cruel and ferocious breed. Young men on the battlefield are supposed to be driven by impulse with a vengeance, This is extraordinarily well received by His Majesty. They march to the rhythm of gongs and drums towards the Elm Gate, In the Stony Mountains their banners and flags a long procession decorate. From the colonel on the frontier come summons to arms over the sea of desert, The Hun chieftain's army and beacon have arrived at Mount Wolverine and are in place.At the frontier it is an endless stretch of deserted landscape, The Hun cavalry charge down the hills like torrential windswept rain. There perish half of the soldiers at the front fighting to their death, Yet in the rare in the camp dancing to melodies are beautiful ladies! Grasses over the border have shrivelled, ending the season of fall over the Great Desert, In the fading sun, the solitary border town is scarce on soldiers and fighters. Basked in royal grace they stoutly face the enemy regardless of their might, Even though it is not enough to lift the siege, they have given every endeavour.Far and away at the borders, soldiers donning armour garrison hard and long, Back home tears begin to flow the morning their husbands are gone; Gut-wrenched are young ladies south of the border town, As soldiers dispatched to north of the Ji region in vain fond memory recall. What is one to do with time in the unpredictable wilds over the border? Unapproachable is the vast territory of oblivion. Overcast with a combative air is the weather all day long, The bronze bells could ring any minute in the cold of night calling to cross swords. Visible everywhere is blood on swords and glaives, If they are willing to fight to their end, how could it be for rewards and fame? Do you not see how miserable a soldier's life is on the battlefield? Long live the spirit of General Li of Han, who is held venerable by all to this day.."
  },
  {
    "poem": "白日登山望烽火，黃昏飲馬傍交河。行人刁斗風沙暗，公主琵琶幽怨多。野雲萬里無城郭，雨雪紛紛連大漠。胡鴈哀鳴夜夜飛，胡兒眼淚雙雙落。聞道玉門猶被遮，應將性命逐輕車。年年戰骨埋荒外，空見葡萄入漢家。",
    "translate": "During the day we mountains climb to military beacon fires observe, At dusk we lead the horses to the Border River for water. Soldiers dread the sound of midnight bronze bells, for gloomier than dust storms they are, Like the Han princess's lute play during her life in the Wusun Tribe, grievous and bitter.In the wild under clouds that stretch on for miles, there is not a  trace of a township, Heavy draughts of snow fall like rain over the boundless desert. Wild geese cry their way through overhead night after night,  Evoking sadness and bringing tears to even the barbarians.They say that still shut off from traffic is the Pass of Jade, Those sent out there can only soldier on and more battles brave. Ever more remains are buried in the wilds year after year, Vainly in exchange for Hun's submission to Han's Court of allegiance and grapes.."
  },
  {
    "poem": "洛陽女兒對門居，纔可容顏十五餘。良人玉勒乘驄馬，侍女金盤膾鯉魚。畫閣朱樓盡相望，紅桃綠柳垂簷向。羅帷送上七香車，寶扇迎歸九華帳。狂夫富貴在青春，意氣驕奢劇季倫。自憐碧玉親教舞，不惜珊瑚持與人。春牕曙滅九微火，九微片片飛花璅。戲罷曾無理曲時，粧成祇是薰香坐。城中相識盡繁華，日夜經過趙李家。誰憐越女顏如玉，貧賤江頭自浣紗。",
    "translate": "Across from where I live in Luoyang resides a young girl, She is a modest beauty just over fifteen years of age. Her husband rides a bluish white steed wearing a bridle decorated with jade, And her maids would bring her delicately prepared cuisine of carp in gilded plates. Her residence is a complex of red chambers and picturesque pavilions with a view each, Over their eaves hang green willows and red blossoms of peach trees. She is escorted by silk screens leading her to board her coach made of fragrant wood. As she returns, they'd take out precious fans to welcome her into a opulent canopy.Her husband, wealthy and honoured in the bloom of youth, Is rather arrogant and extravagant, even more so than Jin dynasty's Shi Jilun. He has a concubine that he treats well and to whom he teaches dances in person, And he flaunts his heroic spirit at the expense of squandering away coral treasures. Daylight breaks as the flames of the nine-wick lamp dim out, Sending sparkles and small fireworks from the nine wicks flying about. All day long at play they are, so much for singing and dancing practices, After make-up the lady at home would just sit by the incense. Her husband's acquaintances are all affluent, indulging in luxury, He walks among the likes of royal relatives, the influential and families with means. Who is there to cherish an elegant lady like the historic Yue beauty?  Poverty-stricken she was, she came down to washing raw silk yarn by the creek.."
  },
  {
    "poem": "少年十五二十時，步行奪得胡馬騎。射殺山中白額虎，肯數鄴下黃鬚兒。一身轉戰三千里，一劍曾當百萬師。漢兵奮迅如霹靂，虜騎崩騰畏蒺藜。衛青不敗由天幸，李廣無功緣數奇。自從棄置便衰朽，世事蹉跎成白首。昔時飛箭無全目，今日垂楊生左肘。路旁時賣故侯瓜，門前學种先生柳。蒼茫古木連窮巷，寥落寒山對虛牖。誓令疏勒出飛泉，不似穎川空使酒。賀蘭山下陣如雲，羽檄交馳日夕聞。節使三河募年少，詔書五道出將軍。試拂鐵衣如雪色，聊持寶劍動星文。願得燕弓射天將，恥令越甲鳴吾君。莫嫌舊日雲中守，猶堪一戰取功勳。",
    "translate": "At the tender age of fifteen or twenty, On foot he could grab a Hun horse from the field to take as his ride. Once in the mountains, he shot dead a white-forehead tiger, Just like the yellow-beard son of Lord Cao from the Ye Shire. He is capable of battling from place to place for over five hundred miles, Armed with a sword he could the onslaught of a million fighters survive. The Han army's attacks were as quick as thunderbolts, Dispersed were Hun's battle array as if they were daunted by puncture vines. The ever victorious Grand General Wei Qing had never lost a battle on heaven's wish, It had to be fate that General Li Guang's valour didn't result in military feats.Like Li, this old general has been cast aside, gradually his physique has feeble become, Life goes on, wasted is time, leaving him a head of grey. Once his dashing arrows would go for prey's eyes, Now his elbows dangle like drooping willows that sway. When idle, sometimes you'd see him looking after a stall of melons,  Or willows that he planted by his door after Tao Yuanming the sage. Along the humble alleyway only ancient trees are there to stay, And his windows look out to the lonesomeness of cold mountains. He still aspires to being like the Di Gong faithful enough to find water in Shule, And to never be like Guan Fu from the Ying River who was rash when intoxicated.These days, there are reports of emergencies at the foothills of the Helan Mountains, Day and night, frequently comes the delivery of military reports to and fro. The governor of the Three Rivers region has been recruiting youths to the army join, And the emperor has issued five edicts to his service re-employ. The general strokes his white and shiny armour, He could feel the engraving on the grip of his treasured sword. Now he hopes for a great bow from the Yan region to take down the other side's warriors, He may perish but letting his emperor be menaced by enemies is not what he would allow. Disfavour not this general who used to guard the High Cloud Fort, He is still capable of going all out for a noble exploit.."
  },
  {
    "poem": "漁舟逐水愛山春，兩岸桃花夾古津。坐看紅樹不知遠，行盡青溪不見人。山口潛行始隈隩，山開曠望旋平陸。遙看一處攢雲樹，近入千家散花竹。樵客初傳漢姓名，居人未改秦衣服。居人共住武陵源，還從物外起田園。月明松下房櫳靜，日出雲中雞犬喧。驚聞俗客爭來集，競引還家問都邑。平明閭巷掃花開，薄暮漁樵乘水入。初因避地去人間，及至成仙遂不還。峽里誰知有人事，世中遙望空雲山。不疑靈境難聞見，塵心未盡思鄉縣。出洞無論隔山水，辭家終擬長游衍。自謂經過舊不迷，安知峰壑今來變。當時只記入山深，青溪幾曲到雲林？春來遍是桃花水，不辨仙源何處尋？",
    "translate": "On a fishing boat he followed the waters admiring spring mountain scenes, At the ferry, both banks were lined with blossoms on peach trees. Taking in sights of more reddened trees, he flowed with the tide losing track of how far, Then he came to where the clear blue creek trailed off yet there was no one to be seen.He ventured awkwardly into a cave that was deep and narrow, Which led to an open plain as he came out of the mountain hollow. From a distance, over woods rose stalks of smoke, It turned out to be a settlement of thousands among flowers and bamboos up close. The visitor introduced himself as a woodsman under Han's reign, As the locals have not caught up with the times, there they were still dressed in Qin robes.The locals all lived in this Wuling fountainhead, They here established their families and habitat after migrating from the outside world. The moon shone through pines on peaceful cottages, The sun rose through clouds amid crowing of roosters and barking of dogs.Surprised at hearing of an outside visitor, villagers hurriedly a crowd gathered, Each eagerly invited him to their home and of their native land enquired. At dawn they swept alleyways clean of fallen petals and leaves, As dusk veiled the sky, the fishing boat and woodsman again the waters followed.They said they secluded themselves there from wars of the world, Then they decided to take root there to leave the worldly behind. Who was to know that there gathered people in the valley, There seemed only uninhabited mountains with layers of clouds from afar on the outside.The woodsman didn't think that such a utopia is a rare sight, Still a worldly soul he was, attached to his hometown he remained. Regardless how separated by mountains and waters, he intended to exit the cave And bid his family farewell before coming back to protract a stay. He believed he wouldn't lose his way since he had been, He never could have known that peaks and valleys have since shifted their place.He only remember that it was deep in the mountains, Yet how many turns on the creek did it take to reach the woods among clouds? In spring, where there is water, there bloom peach blossoms, How could he tell where hides the heavenly fountainhead?."
  },
  {
    "poem": "噫吁戲！危乎高哉！蜀道之難難於上青天。蠶叢及魚鳧，開國何茫然。爾來四萬八千歲，始與秦塞通人煙。西當太白有鳥道，可以橫絕峨眉巔。地崩山摧壯士死，然後天梯石棧方鉤連。上有六龍回日之高標，下有衝波逆折之回川。黃鶴之飛尚不得過，猿猱欲度愁攀援。青泥何盤盤，百步九折縈巖巒，捫參歷井仰脅息，以手撫膺坐長歎。問君西游何時還？畏途巉岩不可攀。但見悲鳥號古木，雄飛雌從繞林間；又聞子規啼夜月，愁空山。蜀道之難難於上青天，使人聽此凋朱顏。連峰去天不盈尺，枯松倒挂倚絕壁。飛湍瀑流爭喧豗，砯崖轉石萬壑雷。其險也若如此！嗟爾遠道之人，胡為乎來哉？劍閣崢嶸而崔嵬，一夫當關，萬夫莫開；所守或匪親，化為狼與豺。朝避猛虎，夕避長蛇，磨牙吮血，殺人如麻。錦城雖云樂，不如早還家。蜀道之難難于上青天，側身西望長咨嗟。",
    "translate": "Ah, yikes! How dangerously high! The daunting route into the region of Shu is more daunting than climbing the sky. The ancestral pioneer, the king figure of Shu, When he the region reclaimed, how distant into the past was the times. It was some forty-eight thousand years after that Before peoples of Shu and Qin came to cross paths. West of Qin stands the Great White Mountains that only birds can fly past, Its trails arduous, cutting across even the Emei Mountains' peaks. The opening of this route sacrificed many heroic men to landslides and earthquakes Before there was a planked passage built along many a cliff face. Its highest is the point of return for the Sun God's carriage pulled by six dragons, Its lowest in the valley gushes and whirls white water between boulders and rocks. It's a canyon that not even yellow storks can flit across, A gorge that not even gibbons and monkeys could clamber and climb.The trail on the Green Mud Peak winds and winds, Nine turns in a hundred steps along an entangling track in a rocky terrain, The idea that perhaps a raise of hand could touch heaven above shortens the breath, Thus the need to take a seat to let out a sigh and calm a heaving chest. I wonder when you shall return from your journey westwards? It is such a formidable route next to being insurmountable. Among soaring ancient trees you'd see birds hum glumly, The male would take flight followed by the female as they encircle in the woods; Come night again, there'd be cuckoos warbling under the moon, Filling the uninhabited mountains with gloom.The daunting route into the region of Shu is more daunting than climbing the sky, Hearing of this is enough to ashen any face any time, Peaks short of touching the sky by a mere foot join to form mountain ranges, And off abrupt and sheer precipices hang withered pines. Waterfalls and white water race to uproars create, Splashing on rocks in thousands of valleys to thunders aggregate.  Such is the route's hazardous nature! Oh, you are a guest from afar, Why have you bothered coming this way?Speaking of the steep and soaring Sword Pass, One guard at the passage  Could an army of ten thousands ward off; Whoever garrisons there is either a bandit gang's henchman Or someone no different to a jackal. In the daytime there are fierce tigers to flinch from, And at night there are pythons to avoid, Who are looking to grind their teeth and suck your blood, Making kills that they have already done far too many times before. Although the Magnificent City is said to be a paradise, It is never as good as home. The daunting route into the region of Shu is more daunting than climbing the sky, I turn to look to the west and cannot help but heave sigh after sigh.."
  },
  {
    "poem": "長相思，在長安。絡緯秋啼金井闌，微霜淒淒簟色寒。孤燈不明思欲絕，卷帷望月空長歎。美人如花隔雲端，上有青冥之高天，下有淥水之波瀾。天長路遠魂飛苦，夢魂不到關山難。長相思，摧心肝。",
    "translate": "How I long for you, yet in Changan you reside. By the ornate railings of the well, cicadas their autumn song recite, Lightly frosted and miserable is the weather, bamboo mats are getting as cold as ice. A shady solitary lamp shades my yearning that only intensifies, I roll up the screen, as I gaze at the moon I could only let out very vain sighs. A beauty as beautiful as flowers is as far away from me as clouds at their great height, High above is the blue and lofty sky, Underneath a clear pond undulating with ripples lies. The road is long, the sky sublime, such is the distance troubling our pining souls, Even in dreams our kindred spirits are unable to the dividing range surmount and reunite.How I long for you, how longing tortures this heart of mine.."
  },
  {
    "poem": "日色已盡花含煙，月明欲素愁不眠。趙瑟初停鳳凰柱，蜀琴欲奏鴛鴦弦。此曲有意無人傳，願隨春風寄燕然。憶君迢迢隔青天，昔日橫波目，今成流淚泉。不信妾腸斷，歸來看取明鏡前。",
    "translate": "All glow of the sun has faded away, a fog has spread to flowers conceal, Although moonlight grows clear and bright, misery brings insomnia instead of sleep. I get up to strum the Zhao zither, then I mute it by holding its phoenix neck and fret, Then I take out the Shu cittern to play a tune on this instrument used for wooing. Sadly there is no one to help deliver my play bearing my mood, I do hope the spring breeze could my notes carry all the way over the Yanran Peak. I think of you without end, yet an endless stretch of sky lies in between, My eyes that used to coquetry portray, Now they are like springs as they tears weep. If you have doubt believing how distraught I feel, Why don't you come back to have a look at the mirror before me.."
  },
  {
    "poem": "金樽清酒斗十千，玉盤珍羞值萬錢。停杯投筯不能食，拔劍四顧心茫然。欲渡黃河冰塞川，將登太行雪暗天。閒來垂釣碧溪上，忽復乘舟夢日邊。行路難！行路難！多歧路，今安在？長風破浪會有時，直挂雲帆濟滄海。",
    "translate": "A serve of spirit in a golden chalice has a price of ten thousand pence, And ten times more for delicacies dished out on a platter made of jade. Yet in the face of such a feast I could not bring myself to taste, With wrath I draw my sword and I look around, feeling completely at a loss.Frozen over the Yellow River has when I wish to it cross, Enshrouded in snow is the sky when I wish to the Taihang Mountains climb. In a pristine creek I angle, idling away my time, Suddenly on board a boat I seem to be, dreaming my way to the capital am I.What a trying journey! Such a trying journey! So full of forked paths before, now where are the ways? There shall come a day with gusty winds to help cleave through the waves, For me to make full sail and an open boundless sea navigate.."
  },
  {
    "poem": "大道如青天，我獨不得出。羞逐長安社中兒，赤雞白狗賭梨栗。彈劍作歌奏苦聲，曳裾王門不稱情。淮陰市井笑韓信，漢朝公卿忌賈生。君不見、昔時燕家重郭隗，擁篲折節無嫌猜；劇辛樂毅感恩分，輸肝剖膽效英才。昭王白骨縈爛草，誰人更掃黃金臺？行路難，歸去來！",
    "translate": "There are avenues and ways as broad as blue skies, Yet I find myself confined. I feel ashamed and unwilling to gather with aristocratic youths, Who place bets and gamble on red roosters and white hounds with crop yields.I'd strike my sword singing my grievances like Guo Huan of history, A life relying on noblemen's hospitality clashes with my will. I have not forgotten how General Han Xin was insulted by street philistines, Nor the Han courtiers' jealousy towards the talented Jia Yi.Do you not see How Lord Zhao of Yan honoured Guo Wei, Putting aside his status to pay respect to the talented. To this very lord Ju Xin and Yue Yi owed gratitude, And thus to His Lordship they their utmost loyalty sincerely pledged. The remains of Lord Zhao had long been buried among rotten weeds, Who is there now to the celebrated Golden Terrace sweep and maintain? On such a trying journey, perhaps homeward is the way!."
  },
  {
    "poem": "有耳莫洗穎川水，有口莫食首陽蕨。含光混世貴無名，何用孤高比雲月？吾觀自古賢達人，功成不退皆殞身。子胥既棄吳江上，屈原終投湘水濱。陸機雄才豈自保？李斯稅駕苦不早。華亭鶴唳詎可聞？上蔡蒼鷹何足道。君不見、吳中張翰稱達生，秋風忽憶江東行。且樂生前一杯酒，何須身後千載名？",
    "translate": "There is no need to cleanse ears with the waters of River Ying, Nor is it necessary to feed on ferns of the Shouyang Mountains. Being unheard of aids the seclusion of virtues of a virtuoso from the worldly, Why focus on portraying one's aloofness in comparison to the sky-high moon and clouds?My observations of the gifted and the heroic suggest Misfortune and death befell those who failed to retreat from public eyes in their success. Zixu took his own life and the Lord of Wu had his body tossed into River Wu, Qu Yuan threw himself into River Xiang where his patriotic heart perished.Lu Ji had a great mind but could he his own fate divine? Li Si could only regret why he had not sooner retired. Is it any wonder that Lu never visited again the Florid Pavilion to listen to wild geese cry? It goes without saying that Li never went to hunt with his eagle over the Gate of Shangcai.Do you not see  Zhang Han of the Wu region was the one who is really liberal and liberated, He'd turn and head for the river's east as an autumn wind suddenly recall home to mind. Saying as he left, life should be enjoyed in the moment with a chalice of wine, What of a good reputation and long-lasting fame beyond one's time?."
  },
  {
    "poem": "君不見、黃河之水天上來，奔流到海不復回？君不見、高堂明鏡悲白髮，朝如青絲暮成雪？人生得意須盡歡，莫使金樽空對月。天生我材必有用，千金散盡還復來。烹羊宰牛且為樂，會須一飲三百杯。岑夫子，丹丘生，將進酒，杯莫停。與君歌一曲，請君為我側耳聽：鐘鼓饌玉不足貴，但願長醉不願醒。古來聖賢皆寂寞，惟有飲者留其名。陳王昔時宴平樂，斗酒十千恣讙謔。主人何為言少錢？徑須沽取對君酌。五花馬，千金裘，呼兒將出換美酒，與爾同銷萬古愁。",
    "translate": "Do you not see The waters of the Yellow River come pouring from the sky, Rushing towards the sea and never coming back? Do you not see Our elders' grievance over grey hair when they a mirror look into, That was once ebony, now white as snow in their twilight years? We should fully enjoy ourselves when we feel pleased, Let not golden chalices mirror the moon without spirits. There has to be a way and a purpose for a being like me, The riches I've spent shall one day be reacquired. Butcher and cook lamb and beef for a happy feast, Whenever there is an opportunity, have three hundred sips of liquor at least.Master Cen, Danqiu, my friend, Please drink up, let not your chalice lay neglected. Let me sing you a song, Please lend a ear and listen as I sing: A grand banquet with an orchestra is not as precious as it seems, How I wish for intoxication and how I wish from which I never wake. Throughout time sages and men of virtue have only the company of solitude, Only those who drink leave behind a reputation next to their name. Duke Chen of Wei gave a banquet at the Temple of Joy and Peace, Providing pecks of wine at ten thousand pence each for all to indulge freely. Being a host why would I excuse myself claiming lack of means? I'd readily buy however much required to drink to our hearts' content. A steed with vivid shades of hair, a fur coat worthy of a thousand gold pieces, In exchange for more great wine I'll have my son pawn these, To share with you in smoothing away our millennia of sorrow, gloom and grief.."
  },
  {
    "poem": "車轔轔，馬蕭蕭，行人弓箭各在腰。耶嬢妻子走相送，塵埃不見咸陽橋。牽衣頓足攔道哭，哭聲直上干雲霄。道旁過者問行人，行人但云點行頻。或從十五北防河，便至四十西營田。去時里正與裹頭，歸來頭白還戍邊。邊亭流血成海水，武皇開邊意未已。君不聞、漢家山東二百州，千村萬落生荊杞？縱有健婦把鋤犁，禾生隴畝無東西。況復秦兵耐苦戰，被驅不異犬與雞。長者雖有問，役夫敢申恨？且如今年冬，未休關西卒。縣官急索租，租稅從何出？信知生男惡，反是生女好；生女猶得嫁比鄰，生男埋沒隨百草。君不見，青海頭，古來白骨無人收？新鬼煩冤舊鬼哭，天陰雨濕聲啾啾。",
    "translate": "Coaches rattle and rumble, horses neigh, People in the march each has a bow and arrows hanging by their waist. Parents, wives and children have come to bid farewell, Hard to discern is the Xianyang Bridge behind a dusty veil that traffic has raised. They cling onto leavers' clothes, stomping as they cry getting in the way, Crying so loudly, piercing skies and clouds all the way.Passers-by ask where they are marching towards, These leaving men reply, “we've been conscripted, it happens quite often these days. Some were deployed to guard the north of the Yellow River when only fifteen, Then sent to the west at the age of forty to land reclaim. Some departed so young that neighbourhood elders had helped with their head cloths, Even when it was time for their return, they still the borders guarded with a head of grey. On the borders there has been such shedding of blood, so much it pools like a sea, Yet the emperor's desire for territorial expansion by force remains. Have you not heard, In the two hundred shires east of the Hua Mountains, Thousands of counties and villages therein have become unattended, lying waste?  There may be women with a solid build ploughing the land, What grow in the fields are crops in disarray. Then there are soldiers holding strong their fort in the west battling hard, No different to disturbed dogs and fowls are people pressured to various duties pay.”“Though you have kindly asked, Yet how dare we complain? Take this winter for example, The soldiers out west don't get to rest, they have been deployed to another battle engage. County clerks are in a hurry to taxes collect, Yet how could they expect these demands be met? Nowadays people believe having a boy is a nightmare, Instead, having a girl is a relief. Girls can be married off to neighbours, Boys only get drafted to die on battlefields among all sorts of weeds.”Do you not see over there by the Great Salk Lake, White remains accumulate throughout time, yet there is no one to dig a grave? New lost souls lament their misery as old ones continue their cry, The overcast skies seem to hiss sibilant sounds in the dampness of rain.."
  },
  {
    "poem": "三月三日天氣新，長安水邊多麗人。態濃意遠淑且真，肌理細膩骨肉勻。繡羅衣裳照暮春，蹙金孔雀銀麒麟。頭上何所有？翠微㔩葉垂鬢唇。背後何所見？珠壓腰衱穩稱身。就中雲幕椒房親，賜名大國虢與秦。紫駞之峰出翠釜，水精之盤行素鱗。犀箸饜飫久未下，鸞刀縷切空紛綸。黃門飛鞚不動塵，御廚絡繹送八珍。簫鼓哀吟感鬼神，賓從雜遝實要津。後來鞍馬何逡巡？當軒下馬入錦茵。楊花雪落覆白蘋，青鳥飛去銜紅巾。炙手可熱勢絕倫，慎莫近前丞相嗔。",
    "translate": "So fine and bright is the day on the third of March, By the riverside of Changan gather many a lady on a spring excursion. They are full-figured, high-spirited and genuinely noble, With delicate flesh and skin over an even bone structure. Glowing in the twilight of spring are their luxurious silk robes, Embroidered with peacocks in gilded threads and unicorns in silvery yarn. What adorns their head?Jade hairpins with decorative flowery pieces that hang by their sideburns. What embellishes their rear? Accentuating their waist are belts studded with pearls. In amongst them are the sisters of Lady Yang, the emperor's queen figure, Who have been bestowed grand titles to their ladyship honour.The violet camel hump delicacies they dine on were prepared in pots made of jade, Fresh fish are presented on exquisite crystal platters. Seemingly full they hesitate with their chopsticks made of rhinoceros horns, Yet they still have the royal kitchen busily knifing intricate food sculptures. Imperial eunuchs dash to and fro to service provide and dust avoid, Royal cooks continue without rest to dish up classic cuisines containing the eight rarities. Flute play and drumming add to entertain the atmosphere and all souls invigorate, Of the numerous guests there, every single one holds an important post.And who is this that comes late strolling on an austere steed? By the marquee curtains the rider hops off onto a carpet of verdure. Willow flowers, like snow, drift and float over duckweed, Here comes a bluebird bearing a piece of red cloth to a message deliver. This is a man of cardinal power, absolutely unrivalled, Do take care not to approach too close and challenge that temper of our premier.."
  },
  {
    "poem": "少陵野老吞生哭，春日潛行曲江曲；江頭宮殿鎖千門，細柳新蒲為誰綠？憶昔霓旌下南苑；苑中景物生顏色。昭陽殿里第一人，同輦隨君侍君側。輦前才人帶弓箭，白馬嚼齧黃金勒。翻身向天仰射雲，一箭正墜雙飛翼。明眸皓齒今何在？血污游魂歸不得。清渭東流劍閣深，去住彼此無消息。人生有情淚沾臆，江水江花豈終極？黃昏胡騎塵滿城，欲往城南望城北。",
    "translate": "Sobbing in silence is a desolated old man from Shaoling, Lurking in the most winding of the Winding River on a spring day; The palace by the river has locks on its thousand doors, For whom the willows and cattails have come green again?I still remember the emperor's visit to the South Garden escorted by colourful banners, That enhanced glow and shine to the scenes there. The very mistress of the Morning Glory Hall Rode along by the emperor's side in the royal coach to his every whim serve. Before the coach led maids girt with bows and arrows, While white steeds masticated on the gilded bridle. Then a maid would take a shot at the clouds at a turn of her figure, One shot could take down a pair of flitting birds.Now where can the bright-eyed beauty with a brilliant grin be found? For blood-stained is her soul that can never return. Forever running eastwards is the limpid River Wei, and the Sword Pass, ever so remote, Between an expedition to take refuge and a journey home, they had lost each other. Sentiments drive emotions and evoke tears to roll and one's chest wet, Will feelings like the ever-flowing river waters and splashes ever cease and disappear? In the twilight of Changan, the Hun cavalry rove through raising dust all over, Hoping to return to the city's south, I look to the newly-instated court in the north.."
  },
  {
    "poem": "長安城頭頭白烏，夜飛延秋門上呼；又向人家啄大屋，屋底達官走避胡。金鞭斷折九馬死，骨肉不待同馳驅。腰下寶玦青珊瑚，可憐王孫泣路隅。問之不肯道姓名，但道困苦乞為奴。已經百日竄荊棘，身上無有完肌膚。高帝子孫盡隆准，龍種自與常人殊。豺狼在邑龍在野，王孫善保千金軀。不敢長語臨交衢，且為王孫立斯須。昨夜東風吹血腥，東來橐駝滿舊都。朔方健兒好身手，昔何勇銳今何愚？竊聞天子已傳位，聖德北服南單于。花門剺面請雪恥，慎勿出口他人狙。哀哉王孫慎勿疏，五陵佳氣無時無。",
    "translate": "Over Changan fly ominous white-head crows, Crowing at night on the southern city gate; They'd dash through noblemen's residences peckish for food, Under those roofs, all aristocrats have left town to get out of Hun's way.The imperial coach has fled, breaking the golden whip and drove to death his nine steeds, He could not even all his offspring take. I saw an aristocrat with a semi-round green coral pendant hanging off his waist, He was crying pitifully in a corner by a roadway. When I asked for his name, he would not give it,  He only said he was down and out, ready to beg and be enslaved. For over a hundred days he had been hiding in thorny bushes, Leaving him not a patch of skin and flesh unscathed. Descendants of the dynasty-establishing emperor all have a full and pronounced nose tip, The descendants of imperial dragons are different to commoners by nature. Jackals have come to our capital invade driving away our dragon into the wild, An aristocrat like him should take care of his priceless self and status.I dared not speak much at the crossroads, But for a while with him I stayed. The easterlies came through the night before with air reeking with blood, Many camels have come from the east to what used to be the capital of our state. General Gesu's army used to be well trained, Yet what happened to their fierceness that seems so feeble nowadays? Rumour has it the emperor had passed on his crown to his son, Who has persuaded a couple of northern chieftains. Carving his face a chieftain did vowing to help us revenge, Then I cautioned the aristocrat from letting on such intelligence for his own safety. Oh, dear nobleman, neglect not your well-being, Long live the spirit of your forefathers in the mausoleum that five imperial tombs contain.."
  },
  {
    "poem": "夫子何為者，栖栖一代中。地猶鄹氏邑，宅即魯王宮。歎鳳嗟身否，傷麟怨道窮。今看兩楹奠，當與夢時同。",
    "translate": "What was the esteemed master aiming for and focusing on? That had you living a life of unease in a disturbing time. Zou is still the name of this place where you had your roots, What in the Han era became part of Lord Lu's estate was where you used to reside. You sighed of ill fate and the disappearance of fair phoenixes, andLamented over poached unicorns and the compromise of morals you considered prime. Today the altar flanked by columns in the main hall are well-tributed, This should your dream of achieving widespread acceptance of your teachings satisfy.."
  },
  {
    "poem": "海上生明月，天涯共此時。情人怨遙夜，竟夕起相思。滅燭憐光滿，披衣覺露滋。不堪盈手贈，還寢夢佳期。",
    "translate": "A bright moon rises over the sea, Wherever we are, in different far corners, we the same moon share at the same time. The tender-hearted complain of how night-time stretches on, Inevitably giving rise to sentiments of yearning throughout the night. Seeing as the moonlight is so lovely I put out candlelight, And put on a robe to sustain the chill of a dewy kind. Regretfully I could not hold on to this so as to offer you the scene, I should turn in, and perhaps dream of a rendezvous I might.."
  },
  {
    "poem": "城闕輔三秦，風煙望五津。與君離別意，同是宦遊人。海內存知己，天涯若比鄰。無為在歧路，兒女共霑巾。",
    "translate": "The walls of Changan hold history of a past so long, The key river crossings into Shu lie far beyond the landscape in the winds and smoke.  I am filled with sadness that we should have to part, Such is life for regional officers moving from pillar to post that says of us both.Forget not we are close friends though scattered all over we may be, Like neighbours we shall be regardless of how distant and remote our posts. Let us not wallow in sorrow as our paths diverge, And cry unreservedly like the young at home.."
  },
  {
    "poem": "西陸蟬聲唱，南冠客思侵。那堪玄鬢影，來對白頭吟。露重飛難進，風多響易沉。無人信高潔，誰為表予心。",
    "translate": "West of here, cicadas sing their songs, Besieging this imprisoned southerner with homesickness. I cannot help but lament as autumn cicadas flap their wings as ebony as youthful hair, And in the face of a greying man they flit and sing. As autumn dew weighs on wings so thin, Their symphonies tend to plunge in crosswinds. No one believes them to be a virtuous kind, Who is there to my innocence appreciate and vindicate?."
  },
  {
    "poem": "獨有宦遊人，偏驚物候新。雲霞出海曙，梅柳渡江春。淑氣催黃鳥，晴光轉綠蘋。忽聞歌古調，歸思欲霑巾。",
    "translate": "Although I am a regional officer used to shifts of scenes, Change of landscape and seasons still much surprises me. I see daybreak flushing clouds and the sea reflecting the morning glow, Here comes spring crossing the Yangtze bringing blossoms to plum and willow trees. In the pleasant weather orioles find the urge to warble, The sun shines brightly enlivening even duckweed.  Unexpectedly comes a letter with your well-versed poem, Evoking nostalgia that brings tears dampening my handkerchief.."
  },
  {
    "poem": "聞道黃龍戍，頻年不解兵。可憐閨裡月，長在漢家營。少婦今春意，良人昨夜情。誰能將旗鼓，一為取龍城？",
    "translate": "They say those garrisoning outside the Town of Yellow Dragon Haven't been allowed off duty for years in recent time. Ruthless is the moon which they once saw from their bedchamber,  Here over the barracks of Han the same moon shines. Their young wives for their spouse yearn, In much the same way these young men did last night. Who can this army lead and charge, And surmount the Dragon Town in one strike?."
  },
  {
    "poem": "陽月南飛雁，傳聞至此回，我行殊未已，何日復歸來？江靜潮初落，林昏瘴不開。明朝望鄉處，應見隴頭梅。",
    "translate": "In October wild geese to the south migrate, They'd end their exodus here and stay on till it's time to their homeward flight take.  Here I am, exiled to such a foreign place, When could I my homeward journey make? The river runs quietly after the tide has ebbed away, Forests of marshes and wetlands are swamped by a sky of gloom. Tomorrow morn as I climb the Dayu Mountains and towards the north look, I shall be greeted by the plum trees on the Plum Peak flowering a bloom.."
  },
  {
    "poem": "客路青山外，行舟綠水前。潮平兩岸闊，風正一帆懸。海日生殘夜，江春入舊年。鄉書何處達？歸雁洛陽邊。",
    "translate": "I am a traveller roving by the green mountains, I sail my boat to the fresh waters before my eyes. Wide apart are the shores at high tide, One full sail is all the boat requires in the wind that is just right. The sun rises above the sea out of  the remains of night, Gone is last year as at the river shores arrives springtime. How could I have delivered a letter for home? Could you drop a letter in Luoyang for me? I say to the homing geese of the wild.."
  },
  {
    "poem": "清晨入古寺，初日照高林。竹徑通幽處，禪房花木深。山光悅鳥性，潭影空人心。萬籟此俱寂，惟餘鐘磬音。",
    "translate": "At the break of dawn I wandered in the ruins of an ancient temple, On lofty trees of the woods the morning sun cast its rays. Following a path amongst bamboos I came to a secluded place, Hidden deep amidst lush flowery vegetation, it used to be a chamber for meditation.Birds by nature took delight in mountain scenes, In the pond, a mind cleansed by the waters a lucid reflection made. Everything gave way to silence right there and then, Save for the tolling of bells that resonates.."
  },
  {
    "poem": "聯步趨丹陛，分曹限紫微。曉隨天仗入，暮惹御香歸。白髮悲花落，青雲羡鳥飛。聖朝無闕事，自覺諫書稀。",
    "translate": "We walk alongside in our approach towards the imperial court, Filed in different divisions, we are separated by those in the middle from State Affairs. In the morning we follow the royal guards to the emperor's court enter, In the evening we return home smothered in royal incense. Feeling sorry for blossoms that are falling adrift is a greybeard, Towards the high-flying bird who soars to its eminence, there is envy.In times of peace little is presented for review, There appears to be far fewer submissions calling for remonstration and introspection.."
  },
  {
    "poem": "吾愛孟夫子，風流天下聞。紅顏棄軒冕，白首臥松雲。醉月頻中聖，迷花不事君。高山安可仰？徒此挹清芬。",
    "translate": "How I adore Mister Meng, Well known in the world for his literary talent all round, In his youth he cast way wealth and fame, In his old age he takes to a reclusive life under pine trees and floating clouds. Under the moon a merry saint he frequently becomes, a tipsy kind, Instead of serving an emperor, he'd rather be attending to plants and flowers. How could the ordinary ever truly learn to such a tall order admire?In vain I have tried to follow his pure essence, here is to him I take a bow.."
  },
  {
    "poem": "渡遠荊門外，來從楚國遊。山隨平野盡，江入大荒流。月下飛天鏡，雲生結海樓。仍憐故鄉水，萬里送行舟。",
    "translate": "Having fared forth leaving the Jingmen Mountains far behind, We have sailed into the region of Chu to roam its landscape. Mountain scenes give place to open country and plains, Waters of creeks and streams aggregate into a river of full spate.The moon casts on the waters a reflection of a heavenly mirage, In the sky at dawn, clouds gather to build a castle in the air.  How I cherish the waters from home, That have carried our boat thousands of miles far and away.."
  },
  {
    "poem": "青山橫北郭，白水繞東城。此地一為別，孤蓬萬里征。浮雲游子意，落日故人情。揮手自茲去，蕭蕭班馬鳴。",
    "translate": "Blue mountains traverse the landscape to the north of town,A stretch of white water winds around the town's east. Here we are bidding farewell, From here on you are like a lone dandelion on a ten-thousand-mile journey. A traveller like you roams like floating clouds, Like the declining sun must set you must leave. We wave at each other and off you go, There goes a neighing horse separated from its pack, neighing its grief.."
  },
  {
    "poem": "蜀僧抱綠綺，西下峨眉峰；為我一揮手，如聽萬壑松。客心洗流水，餘響入霜鐘。不覺碧山暮，秋雲暗幾重？",
    "translate": "A Shu Monk holding a cittern of silky smooth timbre, Comes down the west side of the Emei Peak. He plays for me, I hear what seems like a sonata of rustling pines in tens of thousands of ravines. It is as if there was cleansing spring water running through my mind, Fused with bell toll, the tune lingers on in my ears. Before I know it, the blue mountains have dusky become, I wonder if the weathered clouds a few shades dimmer feel?."
  },
  {
    "poem": "牛渚西江夜，青天無片雲；登舟望秋月，空憶謝將軍。余亦能高詠，斯人不可聞。明朝挂帆席，楓葉落紛紛。",
    "translate": "On a night here by Mount Niuzhu on the western shore of the Yangtze, There is not a cloud in the deep blue sky. On board a boat gazing at the autumn moon, I think of General Xie who here by chance a gifted scholar's worth recognised, I am well versed in the literary, Yet I've met no one of his like. Tomorrow morn shall see me fill the sail, As falling maple leaves scatter in the wind drifting by.."
  },
  {
    "poem": "今夜鄜州月，閨中只獨看。遙憐小兒女，未解憶長安。香霧雲鬟濕，清輝玉臂寒。何時倚虛幌，雙照淚痕乾。",
    "translate": "Back in Fuzhou, at tonight's moon Alone in her chamber gazes my wife. I miss my children from a distance, I've run aground in Changan yet they may be too young to my presence pine.My wife may have gathered mist in her hair as she by the window yearn, Her arms may feel the cold of moonshine. I wonder when we shall be together again to the window curtains lean against, To let the moon shine on our tears till their trails are dry.."
  },
  {
    "poem": "國破山河在，城春草木深。感時花濺淚，恨別鳥驚心。烽火連三月，家書抵萬金。白頭搔更短，渾欲不勝簪。",
    "translate": "The nation is in sunder, yet mountains and rivers still their stances hold and courses run, Spring has come to Changan overgrown with unruly grass and trees. Current affairs have me deep in sentiments, and tears overcome me at the sight of flowers, Detesting separation from family so much, even the twitter of birds frightens me. Military unrest has been continuing for months on end, More valuable than tons of gold is a letter from family and kin. My hair has greyed and grown thin, There remains almost too little for the use of a hairpin.."
  },
  {
    "poem": "花隱掖垣暮，啾啾棲鳥過。星臨萬戶動，月傍九霄多。不寢聽金鑰，因風想玉珂。明朝有封事，數問夜如何。",
    "translate": "Within the walls of the Division blossoms shadow one another in twilight, Chirping on their way through are birds on their way home. As stars ascend, lights by the main palace gate vividly glisten, The moon rises high up in the sky shining on all. I cannot sleep as I listen attentively for the turn of the golden gate lock, A breeze reminds me of the seashell wind chimes over the portals. In the morning I'm about to a sealed report submit, In the meantime I cannot help but ask for the time every so often.."
  },
  {
    "poem": "此道昔歸順，西郊胡正繁。至今殘破膽，應有未招魂。近得歸京邑，移官豈至尊？無才日衰老，駐馬望千門。",
    "translate": "Down this avenue the Hun used to travel to their allegiance pledge and tribute pay, Today in the western outskirts of the capital the Hun heavily populate. Fragile and easily frightened I have become, My soul remains lacking of spirit that has been scared away. It was only recently that I could to the capital return, Is it really the esteemed emperor's will to have me posted away? I suppose talent I have not yet growing senile I am by the day, I cannot help but hold my horse to turn around for another look of the main palace gate.."
  },
  {
    "poem": "戍鼓斷人行，秋邊一雁聲。露從今夜白，月是故鄉明。有弟皆分散，無家問死生。寄書長不達，況乃未休兵。",
    "translate": "Gongs from the watch tower resonates on empty streets, A call from a wild goose shriek across autumn skies. Tonight sees dew turns to frost, Home is where the moon always brighter shines. I have lost touch with both my younger brothers, Broken up is our family, unknown to me is whether they are dead or alive. I have been writing letters though they seldom managed to destinations reach, Besides, the military upheaval has not yet ceased fire.."
  },
  {
    "poem": "涼風起天末，君子意如何？鴻雁幾時到？江湖秋水多。文章憎命達，魑魅喜人過。應共冤魂語，投詩贈汨羅。",
    "translate": "The northerlies bring chills from the edge of the sky yonder, I wonder what is on you mind? When could wild geese bring me letters from you, I suppose they are held back by rivers and lakes high with autumn tides. A smooth life offers little drive for those honing their literary works, Where you are posted are the land of ghosts and spirits hoping to encounter human lives. Perhaps you should the wronged spirit of Qu Yuan converse with, And offer the Miluo River a poem or two as a tribute to him, a sacrifice.."
  },
  {
    "poem": "遠送從此別，青山空復情。幾時盃重把？昨夜月同行。列郡謳歌惜，三朝出入榮。江村獨歸處，寂寞養殘生。",
    "translate": "I've come far to bid you farewell, Staying behind with the blue mountains is my reluctance to see you go. When could we again enjoy a drink together? Like we did last night under the moon's glow. People from as far as neighbouring counties have come to pay tribute, For you are an officer of honour having served three emperors in a row. Back to a riverside township I shall return by myself, To survive the rest of my humble life with loneliness in tow.."
  },
  {
    "poem": "他鄉復行役，駐馬別孤墳。近淚無乾土，低空有斷雲。對碁陪謝傅，把劍覓徐君。唯見林花落，鶯啼送客聞。",
    "translate": "I'm on may way roaming towards my post in the regional, I stop my horse by your tomb to say goodbye. Around where I stand, no earth could keep dry from my tearful cry, Above me patches of clouds float in the low hanging skies. In the face of an impending storm, Xie An and the like could calmly play a game of chess, Ji Zi bestowed his sword upon a tree by Xu Jun's grave to his spirit sympathise. Blossoms falling adrift in the woods say it all, Amid a few warbles of orioles away I ride.."
  },
  {
    "poem": "細草微風岸，危檣獨夜舟。星垂平野闊，月湧大江流。名豈文章著？官應老病休。飄飄何所似？天地一沙鷗。",
    "translate": "On the shores the grass gently sways in the breeze, The mast of the boat stands tall and alone in the night. Stars rise over fields that spread far and wide. The river that perpetually gushes through reflects the moon and its shine. Does my reputation owe only to my literary works?I have grown senile with illness and should perhaps retire. I've been roaming without much of a purpose, what says that of me?No more than a gull with no fixed abode on earth prowling the skies.."
  },
  {
    "poem": "昔聞洞庭水，今上岳陽樓。吳楚東南坼，乾坤日夜浮。親朋無一字，老病有孤舟。戎馬關山北，憑軒涕泗流。",
    "translate": "I've heard what people say of the magnificent Dongting Lake, Today high up on the Yueyang Tower I see it for myself. Its broad and expansive waters defines Wu to the east and Chu to the south, The sun and the moon rise and fall over its vast confines. No word has reached me from kith and kin, Illnesses, senility and a lonely boat are all that could be considered mine. I hear that over the dividing range warfare continues in the north, Leaning against the balustrade I mourn, I sob, I weep and  I cry.."
  },
  {
    "poem": "寒山轉蒼翠，秋水日潺湲。倚杖柴門外，臨風聽暮蟬。渡頭餘落日，墟里上孤煙。復值接輿醉，狂歌五柳前。",
    "translate": "Mountain green has darkened in the cold, Autumn waters have eased to a murmuring rill. Supported by a cane outside my timber gate, I face the wind to listen as evening cicadas sing. Over at the ferry the setting sun left some afterglow, In the isolated village yonder smoke begins to rise from stoves lit. I am reminded of your time here, intoxicated and unfettered you were, Singing uninhibitedly in front of me right here.."
  },
  {
    "poem": "空山新雨后，天氣晚來秋。明月松間照，清泉石上流。竹喧歸浣女，蓮動下漁舟。隨意春芳歇，王孫自可留。",
    "translate": "Here in the hollow of the mountains, Autumn-like is the weather in the evening. Through pines the moon, so bright, casts its shine. Over rocks and stones murmurs spring water, so pure and clean. Through the bamboo groves return ladies finished with their laundering, Fishing boats are lowered into the waters stirring lotus flowers and leaves. Spring pasture lingers on taking its time before the season turns, Noblemen sauntering through are welcome to stay on for keeps.."
  },
  {
    "poem": "清川帶長薄，車馬去閑閑。流水如有意，暮禽相與還。荒城臨古渡，落日滿秋山。迢遞嵩高下，歸來且閉關。",
    "translate": "Winding along the forest is a clear brook, Riding leisurely along I am on a horse-drawn coach. The gurgling waters seems to know where goes my mind, Flying in dusk over me are birds on their way home. There lies the ruins of a town and an old ferry crossing, As the sun declines, a mountain of autumn landscape basks in its afterglow. Towards the foot of the soaring Mount Song over yonder I make my return and I shall soon have my door to the worldly closed.."
  },
  {
    "poem": "太乙近天都，連山接海隅。白雲迴望合，青靄入看無。分野中峰變，陰晴眾壑殊。欲投人處宿，隔水問樵夫。",
    "translate": "The Taiyi Peak stands close to the heavenly capital, The mountains range towards the sea. I turn around and see white clouds gather, Then I walk into a hazy obscurity, there I see not a thing. The central peak dominates the skyline, Distinctive of every ridge and valley is its contour and its scene. I'm after a place to stay for the night, I shall ask of that logger over there from across the creek.."
  },
  {
    "poem": "晚年惟好靜，萬事不關心。自顧無長策，空知返舊林。松風吹解帶，山月照彈琴。君問窮通理，漁歌入浦深。",
    "translate": "In my old age I've come to a serene life appreciate, Letting slide all worldly matters, leaving them far behind. I've searched my soul and discovered no competent propositions to contribute, It'd be best if I return with my lack of knowledge to the woods where I'm used to reside. Breezes through pines would the belt around my robe untie, In the mountains under the moon I'd play my cittern in the still of night. If you wish to the essence of my predilection comprehend, I pray you listen attentively to the singing of fishermen along the riverside.."
  },
  {
    "poem": "不知香積寺，數里入雲峰。古木無人徑，深山何處鐘？泉聲咽危石，日色冷青松。薄暮空潭曲，安禪制毒龍。",
    "translate": "I know not the exact location of the Temple of Garnering Incense, For miles and miles I've been walking amid a cloudy fog from peak to peak. There is no sign of foot traffic but soaring ancient trees, Whence come tolling of bells in the mountains so remote and bleak? Spring water over stones and rocks of riprap sobs, Daylight diffuses coldness through pines of layered green. Yet as dusk sets in over this quiet deep pond in a labyrinth, Suddenly I am disencumbered of the creeping serpent and feel at ease.."
  },
  {
    "poem": "萬壑樹參天，千山響杜鵑。山中一夜雨，樹杪百重泉。漢女輸橦布，巴人訟芋田。文翁翻教授，不敢倚先賢。",
    "translate": "In countless valleys and ravines, towards the skies soar ancient trees,  On as many mountains cuckoos warble everywhere in glee. In the mountains rain fell overnight, Rainwater trickle off tree boughs and sprigs like hundreds of springs. Over there women fabric weave from flowers of tong trees, Local men sometimes over tuber crops and land disagree. You are like Wen Weng of the Han dynasty endeavouring to civilisation cultivate, Who dare not on efforts of the ancients and wise men of the past idly rely and lean.."
  },
  {
    "poem": "楚塞三湘接，荊門九派通。江流天地外，山色有無中。郡邑浮前浦，波瀾動遠空。襄陽好風日，留醉與山翁。",
    "translate": "The three shires of Xiang meet on the bounds of the Chu region, Off the Jinmen Mountains, the Yangtze branches into many a stream. Beyond the horizon, waters of rivers and creeks gush and flow, The mountainous landscape undulates varying scenes. Next to an approaching dock appear a township and villages, Billows of the tide rise and fall to the distant sky stir and beat. Here in Xiangyang, warm is the sun and balmy the breeze, Perhaps I should stay on in the mountains and drink with local greybeards for a treat.."
  },
  {
    "poem": "中歲頗好道，晚家南山陲。興來每獨往，聖事空自知。行到水窮處，坐看雲起時。偶然值林叟，談笑無還期。",
    "translate": "I grew to favour the Buddha's teachings in my middle age, By the foot of the Zhongnan Mountains I've come to retire now I am old. I'd go out for a walk alone when I so please, What a pleasure this brings, only I would know. I'd stroll to seek the fountainhead, And there take a seat to admire the sky and watch clouds grow. Sometimes I'd cross path with a greybeard of the woods, And becoming too engrossed in a friendly chat to return home.."
  },
  {
    "poem": "八月湖水平，涵虛混太清。氣蒸雲夢澤，波撼岳陽城。欲濟無舟楫，端居恥聖明。坐觀垂釣者，空有羡魚情。",
    "translate": "In August Lake Dongting is a picture of calm, At the horizon its edge meets the sky and its vast waters the heaven reflect and imitate. Over the Cove of the Cloudy Dream rises vapour and mist, Vibrant is the town of Yueyang by the waters that undulates. I wish to row towards her but have no boat nor oars, Conscious-stricken towards His Majesty I am as I could only idle myself away. I sit down to watch fishermen angle, Abiding by what fate has dealt me, I envy them as they fish gain.."
  },
  {
    "poem": "人事有代謝，往來成古今。江山留聖跡，我輩復登臨。水落魚梁淺，天寒夢澤深。羊公碑字在，讀罷淚沾襟。",
    "translate": "People and worldly matters must endure ups and downs, As time comes and goes, today becomes history in one day. Places of historic interest remain in the landscape, Allowing our generation to visit and their significance embrace. As tides ebb away, apparent are weirs in shallowing waters, The Cove of the Cloudy Dream appears deeper on cold days. On the mountain top the monument honouring Yang Hu still stands, Reading of the inscription brings tears to everyone always.."
  },
  {
    "poem": "林臥愁春盡，開軒覽物華。忽逢青鳥使，邀入赤松家。丹灶初開火，仙桃正發花。童顏若可駐，何惜醉流霞？",
    "translate": "I recline in the woods worrying the passing of spring, I leave the window open to gather the sight of golden hours. In a trance comes the Bluebird, the celestial envoy, Inviting me to the abode of Red Pine, the legend who could rain bring about. His furnace has just been turn on burning bright, We are surrounded by blossoms of heavenly peach trees outside. If youth could ever be held to last, Why the need to hold dear the heavenly wine in the name of Rosy Clouds?."
  },
  {
    "poem": "北闕休上書，南山歸敝廬。不才明主棄，多病故人疏。白發催年老，青陽逼歲除。永懷愁不寐，松月夜窗虛。",
    "translate": "I shall make no more submissions to the Palace in the north, I should return south to the Zhongnan Mountains to my humble retreat. Forsaken by our wise emperor is my mediocrity, My sickliness has acquaintances their distance keep. My greying hair hastens the onset of old age, Just as spring comes along to edge away the wintry remains of a year. Forever holding a regret makes a good night's sleep hard to acquire, Moonshine filters through pines and windows dispersing feeble gleams.."
  },
  {
    "poem": "故人具雞黍，邀我至田家。綠樹村邊合，青山郭外斜。開軒面場圃，把酒話桑麻。待到重陽日，還來就菊花。",
    "translate": "A friend of mine has prepared a country feast, And invited me to his village visit and sightsee. Along the way there are clusters of lush green trees, Once outside the town, there stretch blue mountains on one side. The dining hall has its doors wide open towards the courtyard, We drink to and talk about crops, yield and farm life. Looking forward to the Double Ninth festival we are, To again gather here and chrysanthemums admire.."
  },
  {
    "poem": "一丘嘗欲臥，三徑苦無資。北土非吾願，東林懷我師。黃金燃桂盡，壯志逐年衰。日夕涼風至，聞蟬但益悲。",
    "translate": "I have long hoped to retreat to somewhere in the woods, Yet I have not the means to even a clearing for a couple of paths make. It is not my intent to stay here in the north, I often think of you, Master, and company in the eastern state. To survive here consumes gold at the rate of firewood, In chasing ideals I have my youth year after year chased away. At dusk and at dawn come northerlies, In the wind, evocative of sorrow and grief is the singing of cicadas that breaks.."
  },
  {
    "poem": "山暝聽猿愁，滄江急夜流。風鳴兩岸葉，月照一孤舟。建德非吾土，維揚憶舊遊。還將兩行淚，遙寄海西頭。",
    "translate": "Howls of gibbons from darkness-obscured mountains grieves me, As the cold and gloomy river gushes away in the night. The wind rustles leaves on shores, The moon on one lone boat shines. The land of Jiande is not my native soil, Old friends from Weiyang are the ones on my mind. I should perhaps gather these tears rolling down my cheeks, And send them to my friends at the head of Haisi, the watery shire.."
  },
  {
    "poem": "寂寂竟何待？朝朝空自歸。欲尋芳草去，惜與故人違。當路誰相假？知音世所稀。祗應守索寞，還掩故園扉。",
    "translate": "Quietly and quietly I await, but for what? Day after day I return empty-handed and lean. I intend to look for greener pastures, Though saddened I am by having to of you take leave. Who in power is willing to lend a hand? In this world, friends as close as one's second self are few and far between. I should known how to keep my solitude company, I shall go home and stay within my humble retreat.."
  },
  {
    "poem": "木落雁南渡，北風江上寒。我家襄水曲，遙隔楚雲端。鄉淚客中盡，孤帆天際看。迷津欲有問，平海夕漫漫。",
    "translate": "Trees shed their leaves as wild geese southwards migrate, The northerlies across the river blow and chills send. My hometown lies on a bend on River Han, My gaze towards my distant native soil could only on clouds over the land of Chu rest. I have cried enough homesick tears over my wayfaring years, Alone on a skiff I raise my head to the sky stare. I have lost my way and seek to someone ask, but there is not a soul On these waters that stretch on endlessly in the glow of sunset.."
  },
  {
    "poem": "古臺搖落後，秋日望鄉心。野寺人來少，雲峰水隔深。夕陽依舊壘，寒磬滿空林。惆悵南朝事，長江獨至今！",
    "translate": "I've come to visit the terrace that has fallen into a desolate state, On this autumn day, homesick I feel as I into the distance gaze. Few come this way to this forlorn temple see, For it is shielded by clouds,  mountain peaks and a deep waterway. The ancient fortress still glows in the setting sun, In the hollowing woods tolling of bells echoes in the cold and resonates.I'm reminded of the regretful history of the short-lived southern dynasties, Still gushing through to this day is the Yangtze in full spate!."
  },
  {
    "poem": "流落征南將，曾驅十萬師。罷歸無舊業，老去戀明時。獨立三邊靜，輕生一劍知。茫茫江漢上，日暮復何之？",
    "translate": "A stranded general you are, who once lead a long march to the south, A commander of an army of a hundred thousand strong. Now dismissed from office and with no vocation to return to, Despite your age, reluctant to leave  the court of a capable emperor your heart lingers on. When you  were in charge, calm and at peace were our borders, Your sword knows well that in order to the nation server you would give your life and all. Such languors on River Han pervade, There you are brooding in the sunset – where to from here on?."
  },
  {
    "poem": "望君煙水闊，揮手淚霑巾。飛鳥沒何處？青山空向人。長江一帆遠，落日五湖春。誰見汀洲上，相思愁白蘋？",
    "translate": "Here I am seeing you off as you on misty waters sail away, My square of handkerchief is drenched with overflowing tears as I wave goodbye. Where have the flying birds dashed off to? Verdant hills range before me but no one comes to sight. Your lone boat along the Yangtze sails into the distance, The afterglow of the setting sun falls on the five lakes' springtime. Who would a figure on a sandbar in the river notice, Who is already nostalgic and seeing blues in the duckweed floating by?."
  },
  {
    "poem": "一路經行處，莓苔見履痕。白雲依靜渚，春草閉閑門。過雨看松色，隨山到水源。溪花與禪意，相對亦忘言。",
    "translate": "Along where I've been, There leave my footprints on moss and lichen. White clouds hang low over the sandbar along the shore, Amid thickets of spring verdure, closed is his door to the outside. I admire the sight of pines after the rain, I follow the waters further into the mountains and at its source arrive. There are flowers by the brook and there springs spirituality, Words fail me as I a moment of enlightenment find.."
  },
  {
    "poem": "鄉心新歲切，天畔獨潸然。老至居人下，春歸在客先。嶺猿同旦暮，江柳共風煙。已似長沙傅，從今又幾年？",
    "translate": "A nostalgic heart grows even more so come New Year, Alone at the edge of the world I cry lonely tears. I am still bending my back for others even at my old age, Before I could home return, come again has spring. Gibbons in the mountains are my company at dawn and at dusk, The river and the willows are there with me to brave the misty wind. I am very much like Jia Yi in exile in Changsha, How many years still before my homecoming?."
  },
  {
    "poem": "上國隨緣住，來途若夢行。浮天滄海遠，去世法舟輕。水月通禪寂，魚龍聽梵聲。惟憐一燈影，萬里眼中明。",
    "translate": "Karma brought you to China, On your way here it was like wayfaring a dream. You arrived from far overseas as if you flew over skies, Now you're setting off with the teachings of Buddha, as if to the worldly take leave. The waters shall the moon reflect while you in quietude spirituality contemplate, Even fish and sea monsters would come near to Buddhist chanting take heed. No doubt you would hold dear the beacon of bodhi, Bringing light to the eyes of those at the other end of the ten thousand leagues.."
  },
  {
    "poem": "泉壑帶茅茨，雲霞生薜帷。竹憐新雨后，山愛夕陽時。閒鷺棲常早，秋花落更遲。家童掃蘿徑，昨與故人期。",
    "translate": "By a creek in a ravine lies my thatched cottage, Through climbing vines of fig trees glisten glowing clouds. Bamboos more elegant seem after the rain, Mountains more comely look in twilight hours. Egrets from earlier on remain perched at leisure, Here autumn arrives late and late wilt flowers.The path where old man's beard decorated trees is being swept by my lackey, As yesterday I invited a friend to come this way out.."
  },
  {
    "poem": "江漢曾為客，相逢每醉還。浮雲一別後，流水十年間。歡笑情如舊，蕭疏鬢已斑。何因北歸去？淮上對秋山。",
    "translate": "When I was a traveller in the region of the Yangtze and Rive Han, We would come together and drink till tipsy before we'd retire. Since parting, we have been like floating clouds, Like river waters must flow, time flies, and ten years have since glided by, Today we gather again, it is much like the good old days, Except for the thinning hair and greying burnsides. Oh, why do you have to head north again? Leaving me here on River Huai to face the mountains as autumn arrives.."
  },
  {
    "poem": "楚江微雨裡，建業暮鐘時。漠漠帆來重，冥冥鳥去遲。海門深不見，浦樹遠含滋。相送情無限，沾襟比散絲。",
    "translate": "In a drizzle flows the Yangtze from the Chu region, From the township of Jianye comes tolling of evening bells and chimes. There pass boat after boat of sails weighed down by mist, Slowly flying by are  birds in the dimming skies. Too far out of sight is where the river meets the sea, Still steeped in the delight of rain are the blurry trees by the dockside. As I bid you farewell, with pouring nostalgic sentiments I am overcome, Tears free flow dampening my collar and robe like the drizzle that scatters before our eyes.."
  },
  {
    "poem": "長簟迎風早，空城澹月華。星河秋一雁，砧杵夜千家。節候看應晚，心期臥亦賒。向來吟秀句，不覺已鳴鴉。",
    "translate": "In a breeze that arrive at short notice slender bamboos sway, Shimmering moonlight reflects off a still town. A lone wild goose dash across the autumnal Milky Way, In the silence of night, from thousands of household rise garment pressing sounds. It must be late autumn by calendar, Excited about our upcoming reunion, I lie awake throughout.  I've always liked reciting your elegant verses, Before I know it, outside crow fowls.."
  },
  {
    "poem": "道由白雲盡，春與青溪長。時有落花至，遠隨流水香。閑門向山路，深柳讀書堂。幽映每白日，清輝照衣裳。",
    "translate": "This path ends in the white clouds, Spring meanders like a long, winding creek. Occasionally petals of flowers fall and drift, Along in the gurgling waters the fragrance would spread and far it streams. The door to my retreat opens towards a mountain trail, Deep in the shade of willows is where I scrolls and volumes of books keep. Everyday sunlight filters through dense foliage, Shining radiantly at times on my robes and on me.."
  },
  {
    "poem": "天秋月又滿，城闕夜千重。還作江南會，翻疑夢裏逢。風枝驚暗鵲，露草覆寒蛩。羈旅長堪醉，相留畏曉鐘。",
    "translate": "Autumn has arrived and it is full moon again, The town falls under the cover of night with thousands asleep. With each other we here reunite like we once did south of the Yangtze, I cannot help but wonder if this is a dream. Treetops sway in the breeze startling magpies perched on high in the dark, Dew grows heavy muffling cricket cries in the bleak. Being a seasoned traveller we'd often drink till we are drunk, Keeping each other company as we dread dawn's bell when we'd have to take leave.."
  },
  {
    "poem": "故關衰草遍，離別正堪悲。路出寒雲外，人歸暮雪時。少孤為客早，多難識君遲。掩淚空相向，風塵何處期？",
    "translate": "My old homestead must have been overgrown with creeping weeds, In deep sorrow I dwell as I of you take leave. This road extends over and beyond the icy clouds, On which I'll be homeward bound in the snow that has set in for the evening. I grew up without a father and started travelling early in life, I met you late in life having endured hard luck and grief. As we come face to face to part, holding our sleeves to tears conceal, When and where in this stained world shall we again meet?."
  },
  {
    "poem": "十年離亂後，長大一相逢。問姓驚初見，稱名憶舊容。別來滄海事，語罷暮天鐘。明日巴陵道，秋山又幾重。",
    "translate": "After ten years of separation in a world of upheaval, As grown men we meet again. Upon first impression, your surname surprises me, And your forename recalls to mind a familiar face. The world has undergone twists and turns since we've been apart, Time lapses as we talk about the past, then comes bell toll to close the day. Tomorrow you will be on your way on the Baling Pass, There will be mountains of autumn that shall us separate.."
  },
  {
    "poem": "故人江海別，幾度隔山川。乍見翻疑夢，相悲各問年。孤燈寒照雨，深竹暗浮煙。更有明朝恨，離杯惜共傳。",
    "translate": "Since our parting at where the Yangtze meets the sea, I've longed to with you reunite, yet mountains and rivers separate us time and again. Such an unexpected encounter seems a dream, it has me in disbelief, With regret we mutually enquired how each have been in the past and in the present day. A lone lamp illuminates the rain of a chilly night, Rising mist enshrouds the bamboos dimming the green by many a shade. Tomorrow again comes parting sorrow, Let's cherish the rounds of farewell drinks that remains.."
  },
  {
    "poem": "靜夜四無鄰，荒居舊業貧。雨中黃葉樹，燈下白頭人。以我獨沉久，愧君相訪頻。平生自有分，況是蔡家親。",
    "translate": "Out here without a neighbour in the still of night, In ruins are family property leaving me to survive poverty in the wilds. Surrounded by trees of yellowing leaves in the rain, I sit by a lamp with a head of grey becoming senile. Long and alone I have dwelled in frustration and deprivation,  Yet you come often to visit still, feeling ashamed I have little to say for myself. Perhaps predestined is our fellowship in life, Furthermore, related by blood we are, making us ever so tight.."
  },
  {
    "poem": "世亂同南去，時清獨北還。他鄉生白髮，舊國見青山。曉月過殘壘，繁星宿故關。寒禽與衰草，處處伴愁顏。",
    "translate": "We drifted her to the south together in troubled times, Now that state affairs have been pacified, you are alone in your northbound return. While roaming on foreign land, I'm turning grey, Once you are back in the capital, you shall see the same mountain green as they were. The bright moon shall over the ruins of ramparts shine still, Under starry nights I remain a guest at the border town where we once gathered. Fowls of winter, withered grass and creeping weeds Are all that I see as I brave my nostalgia everywhere.."
  },
  {
    "poem": "天地英雄氣，千秋尚凜然。勢分三足鼎，業復五銖錢。得相能開國，生兒不象賢。淒涼蜀故妓，來舞魏宮前。",
    "translate": "The heroism that once pervaded the world between heaven and earth Is still highly held in awe throughout the thousand years since those times. The strength of Shu stood firm upholding a third of an ailing empire, Hoping to the dynasty of Han revive. You gained a premier who could a kingdom establish, Yet your son was nowhere near as fine. Sent to misery were the courtesans of the Shu court, Who could only come to dance in the the court of Wei's to a new order abide by.."
  },
  {
    "poem": "前年伐月支，城下沒全師。蕃漢斷消息，死生長別離。無人收廢帳，歸馬識殘旗。欲祭疑君在，天涯哭此時。",
    "translate": "Two years ago an army was sent to war with Yuezhi, At the base of their town the whole division was annihilated. There has been no contact between them and us ever since, Forever separated are those dead and alive. There probably remains no one to follow up and decamp, Those horses that manage to return may still our military banners recognise. I'd like to hold a memorial service for you, yet I am doubtful if you had really perished, Here in a world so vast and broad, for you I cry.."
  },
  {
    "poem": "離離原上草，一歲一枯榮。野火燒不盡，春風吹又生。遠芳侵古道，晴翠接荒城。又送王孫去，萋萋滿別情。",
    "translate": "Extending for miles and miles is a field of grass, Year after year it shrivels and grows back. It never burns out in bush fires, Spring breezes would always life revive.  In the distance, upon an old trail it trespasses, The vivid green stretches its way towards the yonder ruins of a castle. Here I am again seeing off a nobleman, Leaving me with parting sorrow as thick as this field is with grass that saturates.."
  },
  {
    "poem": "旅館無良伴，凝情自悄然。寒燈思舊事，斷雁警愁眠。遠夢歸侵曉，家書到隔年。滄江好煙月，門繫釣魚船。",
    "translate": "I stopped over at an inn without a companion, I became immersed in my own thoughts as I of silence took heed.  By a lamp in the cold I pondered over my past, A sudden cry of a lone goose disturbed my light and worried sleep. I just dreamt of homecoming, only to wake up to another day dawning on me, It's been a year since I last a letter from home receive. The river is bleak, the moon and the fog picturesque, Outside the inn moor fishing boats by the quay.."
  },
  {
    "poem": "紅葉晚蕭蕭，長亭酒一瓢。殘雲歸太華，疏雨過中條。樹色隨山迥，河聲入海遙。帝鄉明日到，猶自夢漁樵。",
    "translate": "Before me is a reddened wood of rustling maple leaves, Here on a pavilion I have with me a pint of wine enjoying my ease. Towards the Taihua Peak float clouds caught by the remains of the afterglow, Rain begins to fall sparsely over the Central Peak. As mountains range away their hues fade, the atmosphere vary the colour of trees. The bellow of the Yellow River resonates as it rushes towards the sea, Tomorrow I shall arrive at the capital of our empire, Yet I still of the life of a angler or a woodsman dream.."
  },
  {
    "poem": "遙夜泛清瑟，西風生翠蘿。殘螢委玉露，早雁拂銀河。高樹曉還密，遠山晴更多。淮南一葉下，自覺老煙波。",
    "translate": "Becoming chilly and crisp is the air, and extended night-time. In the westerlies waver creeping vines. Fireflies from the season's end on sparkling dew drops rest, Across the starry sky whisk geese of the wild taking early flight. At daybreak trees of lofty height denser seem, More mountains and hills come to the fore on a day so fine. Leaves have begin to fall south of River Huai, I have a feeling that among misty waters I shall remain as I age past my prime.."
  },
  {
    "poem": "本以高難飽，徒勞恨費聲。五更疏欲斷，一樹碧無情。薄宦梗猶汎，故園蕪已平。煩君最相警，我亦舉家清。",
    "translate": "By nature, being above worldly desires can hardly satisfy needs, Why bother holding a grudge and utter grievances in vain. At dawn roosters crow here and there as if interrupted, The tree you are on is still green showing you little consolation. A low-ranking regional officer like me roams like a drifting stem, Any family property I used to possess have long become a waste. I owe it to your calls reminding me, That I also have a family untainted by desire, in that we are much the same.."
  },
  {
    "poem": "淒涼寶劍篇，羈泊欲窮年。黃葉仍風雨，青樓自管弦。新知遭薄俗，舊好隔良緣。心斷新豐酒，銷愁斗幾千。",
    "translate": "“A Sword of Value” tells of the lonesomeness of a gifted man of letters like mine, Still a vagabond wayfaring the world I am who is about to another year idle away. Before me yellowing leaves flicker and waver in the wind in the rain, In brothels the rich and the wealthy enjoy flutes and string instruments play. Novel impressions can be easily dampened by practical concerns, Old affections have long been severed by their now married state. Heartbroken in the presence of freshly brewed wine, I can down gallons of it despite its price to nostalgia efface.."
  },
  {
    "poem": "高閣客竟去，小園花亂飛。參差連曲陌，迢遞送斜暉。腸斷未忍掃，眼穿仍欲歸。芳心向春盡，所得是沾衣。",
    "translate": "Admirers of spring flowers have left the galleries, Adrift in the garden are fallen blossoms. On winding paths they randomly fall, Making whirls as they see off daylight's afterglow. Feeling gutted I have not the heart to sweep them away, As they are probably still looking forward to former glory restore. Gone with spring is my aspiring heart, All I have are robe-drenching teardrops.."
  },
  {
    "poem": "客去波平檻，蟬休露滿枝。永懷當此節，倚立自移時。北斗兼春遠，南陵寓使遲。天涯占夢數，疑誤有新知。",
    "translate": "After you were gone floods came to my doorstep, Cicadas have stopping singing and dew grows heavy on trees at night. During such a season I think of you constantly, I lean against railing to stars gaze loosing track of time. Spring has gone far, seemingly as distant from me as the northern pole star, There has been no messenger from you since you at the Southern Hills residence arrived. Being a world apart I had my dreams divined several times, Leaving me with doubts and suspicion that you may have met another to admire.."
  },
  {
    "poem": "殘陽西入崦，茅屋訪孤僧。落葉人何在？寒雲路幾層。獨敲初夜磬，閒倚一枝藤。世界微塵裏，吾寧愛與憎？",
    "translate": "The evening sun sets behind the Yanzi Mountains in the west, I've come to a thatched cottage to an isolated Buddhist monk's acquaintance make. Where is the venerable one among fallen leaves all around? On my way here, clouds have been building in the cold, layer after layer. Then I see him striking the first evening bell on his own, When he takes a rest he pauses and leans against his cane. The kaleidoscopic universe is nothing more than a grain of dust, How could I insist on clinging onto love and hate?."
  },
  {
    "poem": "荒戍落黃葉，浩然離故關。高風漢陽渡，初日郢門山。江上幾人在？天涯孤櫂還。何當重相見？樽酒慰離顏。",
    "translate": "Yellowed and shrivelled leaves fall adrift here in a desolate border town, Determined to leave your hometown, here you are saying goodbye. On this day of gusty winds you are about to board a ferry bound for Hanyang, By the time the sun had risen, you will the Yingmen Mountains sight. How many now remains here on the upriver? Hope your lone boat that is about to sail a world away would return sometime. When shall we see each other again, wonder I? Hoping to parting sorrows comfort, let us drink up a chalice of wine.."
  },
  {
    "poem": "灞原風雨定，晚見雁行頻。落葉他鄉樹，寒燈獨夜人。空園白露滴，孤壁野僧鄰。寄臥郊扉久，何門致此身？",
    "translate": "Rain and the winds have come to a stop on the plains along River Ba, In the evening, across the sky dash flights of wild geese. On this land foreign to me, trees are shedding their leaves, In the still of night, there is only a lamp in the cold to accompany me. In the quiet courtyard, shiny dewdrops drip, I have a rural monk for a neighbour over a partition that stands free. I have for so long retreated behind a simple door in the countryside, What passageway could there remain to improve my lineage?."
  },
  {
    "poem": "露氣寒光集，微陽下楚丘。猿啼洞庭樹，人在木蘭舟。廣澤生明月，蒼山夾亂流。雲中君不見，竟夕自悲秋。",
    "translate": "Here gathers dew condensing chills and the coldness of afterglow, Over the mountains of Chu sets the sun of feeble rays. From trees that surrounds the Dongting Lake come howls of gibbons, As I here on a magnolia canoe stay. Over the vast waters rises the glowing moon, There is spring water gurgling down those dark hills in disarray. In the sky invisible is the pagan god of clouds, Alone I dwell on the autumnal blues as I idle the night away.."
  },
  {
    "poem": "調角斷清秋，征人倚戍樓。春風對青冢，白日落梁州。大漠無兵阻，窮邊有客遊。蕃情似此水，長願向南流。",
    "translate": "The sound of bugle fades in the skies of high autumn, Standing guard on the watch tower are relaxed soldiers. Breezes brush through the one and only green mound, The white-hot sun sets over the remoteness of Liangzhou. The Great Desert hasn't seen war nor action of late, The isolated borders now see travellers come and go. Let us hope that the Hun's submission is like this river, Forever willing to southwards flow.."
  },
  {
    "poem": "迢遞三巴路，羈危萬里身。亂山殘雪夜，孤獨異鄉春。漸與骨肉遠，轉於僮僕親。那堪正飄泊，明日歲華新。",
    "translate": "Here on this remote pass of the Ba Mountains, There is only us on a journey of ten thousand leagues. On a night among remnants of snow in disorienting mountains, There is only loneliness on a foreign land to spring greet. By and by family have grown apart, Becoming closer to me are servants and lackeys. What is making the wayfaring all the more tormenting is the fact thatTomorrow comes lunar New Year.."
  },
  {
    "poem": "幾行歸去盡，片影獨何之？暮雨相呼失，寒塘獨下遲。渚雲低暗渡，關月冷相隨。未必逢矰繳，孤飛自可疑。",
    "translate": "Gone are flights of wild geese, Alone as you are, where are you flying towards in whose wake? In the evening rain, I hear your call for your kind, Over the chilly pond you hesitatingly a stop make. Over the sandbar under low-hanging clouds over the waters you skim, The moon of the borders shines coldly and you her company gain. You may not suffer arrows of a huntsman, Yet in your flight alone you must care take.."
  },
  {
    "poem": "早被嬋娟誤，欲妝臨鏡慵。承恩不在貌，教妾若為容？風暖鳥聲碎，日高花影重。年年越溪女，相憶採芙蓉。",
    "translate": "My beauty hindered my early days, Now I would come to the mirror only to feel languid to make-up apply. Although winning the emperor's favour is not entirely based on looks, How should I primp and preen to on my appearance rely? Days are warm and breezy, birds softly chirp, Shadows of flowers overlay under the sun that rises high. I am reminded of those girls who spend year after year in the Yue creek, Remembering the picking of lotus flowers and good old times.."
  },
  {
    "poem": "清瑟怨遙夜，繞弦風雨哀。孤燈聞楚角，殘月下章臺。芳草已云暮，故人殊未來。鄉書不可寄，秋雁又南迴。",
    "translate": "Clear zither notes tell of bitterness that reverberate in the night, Like wuthering winds and rain the strings vibrate. Under a solitary lamp I hear in the air the sound of Chu bugles, Over and behind the terrace the moon on the wane inclines. Grasses are wilting speaking of lateness, My old friends has not yet come to our rendezvous realise. Letters for home cannot be sent for now, Wild geese of autumn have yet again southwards migrated.."
  },
  {
    "poem": "移家雖帶郭，野徑入桑麻。近種籬邊菊，秋來未著花。扣門無犬吠，欲去問西家。報道山中去，歸時每日斜。",
    "translate": "Although where you have migrated to is only on the outskirts of town, To access one must cut through a field of unruly hemp and mulberry trees. By your fence are newly planted hedges of chrysanthemums, Autumn that has just arrived is not their blooming season. I knock on the door and hear not even a dog bark, I turn to ask your neighbour about where you could be. Into the mountains you have gone, said he. Day after day returning at sunset you seem to be.."
  },
  {
    "poem": "昔人已乘黃鶴去，此地空餘黃鶴樓。黃鶴一去不復返，白雲千載空悠悠。晴川歷歷漢陽樹，芳草萋萋鸚鵡洲。日暮鄉關何處是？煙波江上使人愁。",
    "translate": "Once upon a time an immortal flew away on the back of a yellow crane, What remains of the tale here is a tower bearing its name. The heavenly creature once gone has never returned, For thousands of years white clouds have in the skies drifted in vain.Before me runs the clear river water, vivid in the distance are trees of Hanyang, And the so-called Parrot Isle is a lush, verdant place. I look towards the direction of my hometown as twilight starts to fade,  A haze begins to mist over the river engulfing me in a homesick state.."
  },
  {
    "poem": "岧嶢太華俯咸京，天外三峰削不成。武帝祠前雲欲散，仙人掌上雨初晴。河山北枕秦關險，驛路西連漢畤平。借問路傍名利客，無如此處學長生？",
    "translate": "The eminent Taihua Mountains tower over Xianyang the ancient capital, Into the sky soar the Trinity Peaks that could not have been pared by hand. Before Han Emperor Wu's Great Spirit Shrine clouds begin to thin, Down below, rain begins to clear over the Peak of Heavenly Palm.To the north the Yellow River, Taihua give the Fort of Hangu its advantage, The main road extends westwards to the worship grounds of Han. I wonder aloud to travellers on the road seeking wealth and fame, Why not stay here in nature and life's honest aspiration expand?."
  },
  {
    "poem": "燕臺一去客心驚，簫鼓喧喧漢將營。萬里寒光生積雪，三邊曙色動危旌。沙場烽火侵胡月，海畔雲山擁薊城。少小雖非投筆吏，論功還欲請長纓。",
    "translate": "The sights from the Yan Lookout startled this newly arrived, Hun pipes and drums in Han's army camp blared and roared.  Thousands of square miles of deep snow sparkled with freezing reflection, The flags of three frontier towns flew high in the skies in the first light of dawn.Over in the Hun skies beacon fires of battlefields overshadowed the moon, The Cloud Mountains and the seashore of Bo held their own to the Fort of Ji support.Although as a youth I did not forsake the civil office for the military like Ban Chao, I could still sacrifice my life as exemplified by Zhong Jun and be courageous and bold.."
  },
  {
    "poem": "朝聞遊子唱驪歌，昨夜微霜初度河。鴻雁不堪愁裡聽，雲山況是客中過。關城曙色催寒近，御苑砧聲向晚多。莫是長安行樂處，空令歲月易蹉跎。",
    "translate": "You sing a farewell song at dawn, You begin to cross the river with light frost that had formed the night before. Calls of wild geese would be hard to tolerate when you're feeling blue, Let alone the dreariness of the Cloud Mountains that you must trudge across.At the Fort of Hangu daylight would appear to intensify the cold, At sunset, garment pressing sounds from the imperial grounds would louder grow. You should not regard the capital as a place of pleasure, And allow years to be idle away as you dawdle along.."
  },
  {
    "poem": "漢文皇帝有高臺，此日登臨曙色開。三晉雲山皆北向，二陵風雨自東來。關門令尹誰能識？河上仙翁去不回，且欲近尋彭澤宰，陶然共醉菊花杯。",
    "translate": "Han Emperor Wen commissioned this grand lookout to appeal to immortal greats, I embark on a climb to see the first light of dawn on this festive day.The north-facing Cloud Mountains range across the three states that succeeded Jin,From the hills that witnessed the rise of Xia and Zhou come easterlies and rain.Who in this day and age could Laozi meet like the gatekeeper did? The elder on the river never returned once he immortal became. I should hope I could locate a county officer like the one that Pengze once had,  By some chrysanthemum shrubs we'd drink together to tipsy become and spirits elate.."
  },
  {
    "poem": "鳳凰臺上鳳凰遊，鳳去臺空江自流。吳宮花草埋幽徑，晉代衣冠成古丘。三山半落青天外，二水中分白鷺洲。總為浮雲能蔽日，長安不見使人愁。",
    "translate": "On top of the Phoenix Terrace phoenixes used to roam, Now gone are phoenixes, a desolate lookout remains as the river continues to flow. Flowers and verdure of the Wu Palace are now buried under isolated trails, The upper ranks and decorated officers of Jin are now mounds topped with growth.The barely discernible Trident Peaks range beyond the blue skies, The river waters part into two waterways that around the Egret Islet roll. Floating clouds eventually the sun conceal, Being so far away from Changan has me worried in shadow.."
  },
  {
    "poem": "嗟君此別意何如？駐馬銜杯問謫居。巫峽啼猿數行淚，衡陽歸雁幾封書。青楓江上秋帆遠，白帝城邊古木疏。聖代即今多雨露，暫時分手莫躊躇。",
    "translate": "Ah, what are your thoughts on today's farewell?Hold your horses and take a sip as where you're demoted to cause me to concern bear..The Wicked Gorge is said to be surrounded with gibbon cries evocative of sorrowful tears,Hengyang is where wild geese would return from as they many a letter carry.On the River of Green Maple in autumn your sail fares forth into the distance,You'd find the town of Baidi surrounded with ancient trees that have lost their foliage. A capable reign is upon us that shall the common people tend to and grace bestow upon, Let us falter not in the face of a parting that shall be only temporary.."
  },
  {
    "poem": "雞鳴紫陌曙光寒，鶯囀皇州春色闌。金闕曉鐘開萬戶，玉階仙仗擁千官。花迎劍珮星初落，柳拂旌旗露未乾。獨有鳳凰池上客，陽春一曲和皆難。",
    "translate": "Along the main avenue loud are cock crows in the chill of dawn, In the capital, orioles chirp agreeably as spring draws to a close.All doors gape open at the sound of sonorous morning bells from the Palace, Below marble stairs, royal guards and batons flank government officials in rows.Flowers of spring drift past swords and pendants of jade in the procession as stars fade, Swaying willows still wet with dew brush past banners and flags on poles.  By the Pond of Phoenix stands a literary man in a league of his own, Whose verses are like the melody of the elegant Spring Sun, a tough act to follow.."
  },
  {
    "poem": "絳幘雞人送曉籌，尚衣方進翠雲裘。九天閶闔開宮殿，萬國衣冠拜冕旒。日色纔臨仙掌動，香煙欲傍袞龍浮。朝罷須裁五色詔，珮聲歸向鳳池頭。",
    "translate": "A red-turbaned timekeeper calls through the break of dawn, The Robe Master has just sent in the jade-precious fur coat soft as a cloud. Through gates of layered palatial zones to the main palace hall Comes ambassadors from many foreign countries to salute the crown.Daylight has just shone on cactus evaporating dew, Incense from the royal burner floats, so seems the dragon pattern on the imperial robe. After morning assembly the secretary is to author rainbow-coloured imperial edicts, On his way to his office by the Phoenix Pond, his jade pendants clatter as he goes.."
  },
  {
    "poem": "渭水自縈秦塞曲，黃山舊繞漢宮斜。鑾輿迥出千門柳，閣道迴看上苑花。雲裡帝城雙鳳闕，雨中春樹萬人家。為乘陽氣行時令，不是宸遊翫物華。",
    "translate": "The River of Wei flows and winds around the ancient Qin frontier, Deep in the valley tilts the Yellow Mountain Palace from the Han dynasty. Through clusters of willowy arches the Emperor's carriage and company march, Along the corridor the Emperor turns around time and again to the Royal Garden admire.In the clouds perched the capital's Double Phoenix Tower, Among rain and trees of spring spread tens of thousands of households of the shire. Today the Emperor rides in the force of prosperity obliging nature, Mistake not this for an excursion of pleasure and sightseeing.."
  },
  {
    "poem": "積雨空林煙火遲，蒸藜炊黍餉東菑。漠漠水田飛白鷺，陰陰夏木囀黃鸝。山中習靜觀朝槿，松下清齋折露葵。野老與人爭席罷，海鷗何事更相疑？",
    "translate": "It has been raining for days and smoke from stoves is slow to rise, Meals have been made and taken to the fields on the east. Over rice paddocks fly egrets above watery fields, In the shade of summer foliage chirp orioles in the green.I've been in the mountains in search of tranquillity and admiring hibiscus in the morn, Eating light vegetarian meals and picking okra leaves under pine trees. I'm now a man out of office, not competing for anyone's seat, Why do shearwaters doubt my goodwill and their high flights keep?."
  },
  {
    "poem": "洞門高閣靄餘輝，桃李陰陰柳絮飛。禁裡疏鐘官舍晚，省中啼鳥吏人稀。晨搖玉珮趨金殿，夕奉天書拜瑣闈。強欲從君無那老，將因臥病解朝衣。",
    "translate": "Behind the gate the office tower reflects the remains of day, At the front, peach and plum trees are in bloom, willow catkins adrift. From the guarded inner palace comes faint evening bells, Audible around the department are warbling birds as traffic of officers thins.In the morning, as you make your way towards the golden hall, your jade pendant sways, In the evening, you take your leave passing the Green Lock Gate carrying edicts. I would have liked to work with you, yet I cannot help being senile, As increasingly confined by illness I am, unable to don the robes of office.."
  },
  {
    "poem": "丞相祠堂何處尋？錦官城外柏森森，映堦碧草自春色，隔葉黃鸝空好音。三顧頻煩天下計，兩朝開濟老臣心。出師未捷身先死，長使英雄淚滿襟。",
    "translate": "Where lies the shrine commemorating the renowned Premier of Shu? On the outside, the Magnificent City is surrounded with groves of cypress trees. The terrace contrasts the spread of green lawn painting a field of spring, Through the foliage comes orioles' singing, in vain in seems.His hut was frequented thrice over, he was sought after to warring states pacify, He gave his heart and soul in helping his master and son establish a state of ideals. Yet he died before his military expeditions for unity could succeed, His regret often has those of similar aspirations weep tears of grief.."
  },
  {
    "poem": "舍南舍北皆春水，但見群鷗日日來。花徑不曾緣客掃，蓬門今始為君開。盤餐市遠無兼味，樽酒家貧只舊醅。肯與鄰翁相對飲，隔籬呼取盡餘杯。",
    "translate": "To the north and to the south, I see waters of spring all round,  Yet all that have ever come day after day are waterfowls. The footpath has never been swept to a guest receive, It's a first to gape open my humble door for a visitor nowadays.Being far away from town, I have not dishes fit of a feast, Being poor, I have only one carafe of stale brew to go around. If you don't mind drinking with my neighbour, an old fellow, I shall holler across the fence to invite him to share the remaining rounds.."
  },
  {
    "poem": "西山白雪三城戍，南浦清江萬里橋。海內風塵諸弟隔，天涯涕淚一身遙。唯將遲暮供多病，未有涓埃答聖朝。跨馬出郊時極目，不堪人事日蕭條。",
    "translate": "Over the snow-covered West Mountains, soldiers three counties defend, Over the clear river to the south of town, straddles the Bridge of Long Mile. A nation in war separates me and my younger brothers from one another, I weep in solitude in a far corner under a distant sky.Old and often bed-ridden, I am a candle in the wind, Yet I have done not a thing in contribution to our nation of might.I take a ride on a horse to the countryside and look afield as far as I could, Yet I cannot bear to see our state affairs continue to deteriorate as days go by.."
  },
  {
    "poem": "劍外忽傳收薊北，初聞涕淚滿衣裳。卻看妻子愁何在？漫卷詩書喜欲狂。白日放歌須縱酒，青春作伴好還鄉。即從巴峽穿巫峽，便下襄陽向洛陽。",
    "translate": "Here beyond the Sword Gate, I hear of recovery of the northern state, Instantly I am overflowing with tears dampening my clothes. I turn around to see my wife, who is no longer in gloom, Mad with joy she is, casually packing up books and scrolls.Such a gleeful day calls for bold singing and uninhibited drinking, Taking advantage of the blooming season, let's gather up and hit the road.  Setting off from the Ba Gorge down through the Gorge of the Magical, We shall first Xiangyang reach, then head towards Luoyang towards home.."
  },
  {
    "poem": "風急天高猿嘯哀，渚清沙白鳥飛迴。無邊落木蕭蕭下，不盡長江滾滾來。萬里悲秋常作客，百年多病獨登臺。艱難苦恨繁霜鬢，潦倒新停濁酒杯。",
    "translate": "The wind of a clear autumn sky rushes through amid gibbons' howls, Over the crystalline water and sand of white, spiral and hover fowls. Countless leaves rustle, fall and drift down and away baring trees, Endlessly the Yangtze flows, and with billows abounds.Ever so often being thousands of miles away from home, autumn grieves me, Living so long a life bound by illness, alone I take in the view here on a high lookout.In the tough times of the present day, my rapidly greying hair adds to my grievance, I cannot help but give up on alcohol as I have become so indisposed, down and out.."
  },
  {
    "poem": "花近高樓傷客心，萬方多難此登臨。錦江春色來天地，玉壘浮雲變古今。北極朝庭終不改，西山寇盜莫相侵。可憐後主還祠廟，日暮聊為梁甫吟。",
    "translate": "Being high up on a tower brings blossoms close grieving the heart of an outsider, Amidst the various sufferings our nation is in, here I am making a climb. Between heaven and earth spreads spring scenery of the Brilliant River, Forever transforming are the floating clouds of the mountain ranges of Jadeite.Our imperial court is our pole star that shall never be replaced, The intruders from the western mountains had better not invasions strive. The pitiful last master of Shu at least warded his lineage for a generation, Oh allow me to recite Zhuge's favourite Liangfu melody in the twilight.."
  },
  {
    "poem": "清秋幕府井梧寒，獨宿江城蠟炬殘。永夜角聲悲自語，中天月色好誰看？風塵荏苒音書絕，關塞蕭條行陸難。已忍伶俜十年事，強移棲息一枝安。",
    "translate": "On a clear autumn night in the general's headquarters, by the well the phoenix tree shivers, Spending the night alone in a river town I have only the company of a candle burning out. Throughout the night bugles blare like a monologue of doleful tones, The bright moon rises high yet who has the mood to admire now?Protracted battles continue to dust storms stir and correspondence sever, Border passes have desolate and unsafe become making travels out of bounds. I have been adrift alone for a decade and more, Though I managed to find employment and survive, it is only for now.."
  },
  {
    "poem": "歲暮陰陽催短景，天涯霜雪霽寒宵。五更鼓角聲悲壯，三峽星河影動搖。野哭千家聞戰伐，夷歌數處起漁樵。臥龍躍馬終黃土，人事音書漫寂寥。",
    "translate": "Another year ends as the sun and the moon chase away ever shortening days, Here I am at the edge of the world on a freezing night as snow takes a break. The mournful sound of bugle stirs in the wee hours, Above the Three Gorges celestial bodies of the Milky Way seems to tremble and shake.As news of more warring spread, wails rise from households everywhere, Here and there fishermen and loggers have begun to sing songs of those that us invade. Generals either wise or foolish escape not from one day dust and ashes become, Desolated I am as there hardly ever come word and letters from kith and kin far away.."
  },
  {
    "poem": "支離東北風塵際，漂泊西南天地間。三峽樓台淹日月，五溪衣服共雲山。羯胡事主終無賴，詞客哀時且未還。庾信平生最蕭瑟，暮年詩賦動江關。",
    "translate": "People have been driven from pillar to post by the unrest in the north-east, I have roved towards the south-western skies and terrain.Flooded are the terraces and towers of the Three Gorges, with sunlight and moonshine, The cultures of the five streams and the Cloud Mountains fairness emanate.The invaders may have pledged allegiance yet unreliable is their word, The literary would continue to grieve the times as long as they on the road remain. . The scholar, Yu Xin's life was one of the most bleak and desolate, His nostalgic prose touched and moved people of Jiangling causing a stir in those days.."
  },
  {
    "poem": "搖落深知宋玉悲，風流儒雅亦吾師。悵望千秋一灑淚，蕭條異代不同時。江山故宅空文藻，雲雨荒台豈夢思？最是楚宮俱泯滅，舟人指點到今疑！",
    "translate": "Leaves shaken off trees by autumn aught to know Song Yu's grief, Who was a gallant and elegant learned man, a fitting model for me. A thousand years have gone by, in remembrance of him here I am in tears, Though we are from different times, as desolated as his life was, mine is bleak.Nestled in the landscape is his old cottage, all that remains of him is his writings, Like the deserted terraces under sunlit clouds in the Magic Mountains, ever as dreamy. Regretfully the palace of Chu has long perished, Where the boatmen has pointed out as historic ruins may not be genuine.."
  },
  {
    "poem": "群山萬壑赴荊門，生長明妃尚有村。一去紫台連朔漠，獨留青塚向黃昏。畫圖省識春風面，環佩空歸月夜魂。千載琵琶作胡語，分明怨恨曲中論。",
    "translate": "Passing through myriads of peaks and valleys I have come to Jingmen, Still in existence is the town from where Lady Zhaojun of Han was raised. Taking departure from the palace she was sent to the desert in the north, All that was left is her overgrown tomb to face the setting sun these days.On her portrait, discernible should have been her countenance of youth, On moonlit nights, all that could return to the court of Han was her soul in vain. A thousand years since, her pipa melodies are now accompanied by Hun lyrics That flow with apparent bitterness and lament in every pick and strum of play.."
  },
  {
    "poem": "蜀主窺吳幸三峽，崩年亦在永安宮。翠華想像空山裡，玉殿虛無野寺中。古廟杉松巢水鶴，歲時伏蠟走村翁。武侯祠屋常鄰近，一體君臣祭祀同。",
    "translate": "The Master of Shu arrived at the Three Gorges coveting after Wu, Unsuccessful was his attempt and soon died he in the Palace of Eternal Peace. Now barren mountains once flew his banners and flags, Where once majestic and palatial now lies a shrine in the wild without upkeep.On the cypress trees in front, water cranes nestle amongst the green, Every summer and winter solstice come villagers to pay respect to their heroes. Next to the Master's shrine is another that enshrines his premier, Posterity worship both the master and the premier and hold them in high esteem.."
  },
  {
    "poem": "諸葛大名垂宇宙，宗臣遺像肅清高。三分割據紆籌策，萬古雲霄一羽毛。伯仲之間見伊呂，指揮若定失蕭曹。運移漢祚終難復，志決身殲軍務勞。",
    "translate": "Shu's Premier, Zhuge's prestige has spread as far and wide as the universe is vast, His statue exhibits dignity and austerity, a model for a statesman and the like. He worked his mind to achieve scheme after scheme bringing about a tripartite state, His integrity stood the test of time like the precious phoenix soaring in the sky.On par was his achievement with that of the statesmen of ancient Shang and Zhou, Even Xiao and Cao would fade  in comparison to his command of armies in his stride. The wheel of fortune inevitably rounded up the time of Han ending a dynasty, Yet he strove nonetheless in his line of duty leading military affairs till he died.."
  },
  {
    "poem": "生涯豈料承優詔？世事空知學醉歌。江上月明胡雁過，淮南木落楚山多。寄身且喜滄洲近，顧影無如白髮何！今日龍鐘人共棄，媿君猶遣慎風波。",
    "translate": "Unexpectedly comes an imperial edict to my service employ, As turns in life are unpredictable, it is easier to follow the spirits of idle gents. Over the river a bright moon hangs and wiled geese fly, Here south of River Huai and in the mountains of Chu trees have begun to leaves shed.Though a vagabond, fortunately I have been able to retreat to waters' edge in Cangzhou, So that I could pity my own reflection to see grey hair spreading all over my head. In my senile state that most would rather turn their back on, I'm grateful for your concern for my onward journey in your farewells.."
  },
  {
    "poem": "三年謫宦此棲遲，萬古惟留楚客悲。秋草獨尋人去後，寒林空見日斜時。漢文有道恩猶薄，湘水無情弔豈知？寂寂江山搖落處，憐君何事到天涯？",
    "translate": "You were banished from the Han Court to hither migrate and rove, Where remains little but the venerable tale of a Chu poet and his grief. I stay behind others lingering in the grasses of autumn seeking I know not what, In the woods comes nothing but coldness as the sun westwards leans.The Han Emperor Wen might be wise, yet his recognition of you seemed slight,By the billowing River Xiang, you think of the Chu poet, yet he could no longer feel. Amid the lonesome landscape and drifting of the season's shedding, Feeling sorry for you, I fathom not why you must be sent so distant afield.."
  },
  {
    "poem": "汀洲無浪復無煙，楚客相思益渺然。漢口夕陽斜渡鳥，洞庭秋水遠連天。孤城背嶺寒吹角，獨戍臨江夜泊船。賈誼上書憂漢室，長沙謫去古今憐。",
    "translate": "Around the river isle there is no wave nor smoky mist, Now a traveller in the land of Chu, in vain I am reminiscent of our friendship. Arriving in Hankou, against the setting sun across the river fowls flit, Fading into the skies are the autumn colours of the waters of Lake Dongting.This isolated town lies at the foot of hills against the sun and bugles cheerlessly blare, Unsociable sentinels stand guard by the river, where I am to moor for the evening. There was Jia Yi who  wrote to the Han emperor to his concerns address, Yet banished to Changsha he was, that has many taking pity on him ever since.."
  },
  {
    "poem": "二月黃鸝飛上林，春城紫禁曉陰陰。長樂鐘聲花外盡，龍池柳色雨中深。陽和不散窮途恨，霄漢長懷捧日心。獻賦十年猶未遇，羞將白髮對華簪。",
    "translate": "February sees orioles flitting in the royal garden, Surrounded by a city in spring, mornings inside the Palace are lively and vivacious. The bells of the Ever Joyful Chamber resound far to where flowers thin out, The hues of willows by the Dragon Pond deepen and intensify in the rain.Yet the the sun's warmth dispels not my regret of ever coming to dead ends, Like the clouds in the sky, I've long wished to serve under the sun's reign. For a decade I have been submitting my prose yet remained unheard, It is with shame that I, now an aged man, hope to your honourable mention attain.."
  },
  {
    "poem": "去年花裡逢君別，今日花開又一年。世事茫茫難自料，春愁黯黯獨成眠。身多疾病思田里，邑有流亡愧俸錢。聞道欲來相問訊，西樓望月幾回圓？",
    "translate": "Last year we gathered and parted when flowers were still in bloom, Now comes this year's blossom, a year has since passed by. Unpredictable is the indefinite and unfathomable world around us, This spring I sleep in solitude with a glum and gloomy mind.Stricken with illnesses I long to hometown retire to, I feel undeserving of my salary as on the streets the destitute strive to survive.I hear mention of your intention to visit here, Here I await you in the west chamber wondering how many moons before you arrive.."
  },
  {
    "poem": "仙台初見五城樓，風物淒淒宿雨收。山色遙連秦樹晚，砧聲近報漢宮秋。疏松影落空壇靜，細草香閒小洞幽。何用別尋方外去？人間亦自有丹丘。",
    "translate": "Below the Heavenly Terrace appear to lay the towns and towers of the immortals, The overnight rain has eased away leaving a desolate scene. Evening comes, the trees of Qin and the mountains merge in colour, one ancient green,From the Palace of Han resound autumnal calls of garment pressing peals.In stillness, a bare altar stands and on it fall shadows of sparsely spaced pines, Fragrant grasses surround meditation caves and dens in the hills. Why look elsewhere for peace out of this world? When here on earth already exist Sanguine Hills, a realm of heavenly feel.."
  },
  {
    "poem": "鶯啼燕語報新年，馬邑龍堆路幾千。家住層城鄰漢苑，心隨明月到胡天。機中錦字論長恨，樓上花枝笑獨眠。為問元戎竇車騎，何時返旆勒燕然？",
    "translate": "Orioles warble and swallows coo heralding another new year, Horse Town and Yardang to the north and west are thousands of miles from here. As I reside within a heavily walled estate next to what used to be the royal gardens of Han, How I wish my heart could fly like the moon and Hun skies reach.I could only stitch cryptic verses of grief on piece after piece of embroidery, Upstairs blossoms have blossoms for company teasing how alone I sleep. May I ask the triumphant General Dou of Han, When shall there be a victorious return like the legend  inscribed on the Yanran stele?."
  },
  {
    "poem": "雲開遠見漢陽城，猶是孤帆一日程。估客晝眠知浪靜，舟人夜語覺潮生。三湘愁鬢逢秋色，萬里歸心對月明。舊業已隨征戰盡，更堪江上鼓鼙聲！",
    "translate": "As the skies clear and clouds part I see the town of Hanyang in the distance, It looks to takes another day under sail before we there arrive. While merchants sleep through calm waters during the day, Boatmen whisper of upcoming undercurrents at night.Autumn colours of the tri-region of Xiang contrast my blues and greying sideburns, Clear under the moon is my wish to home return through thousands of miles. Much of family property must have perished in the upheaval, Yet along the river there continue to resound blaring bugles and drum strikes!."
  },
  {
    "poem": "城上高樓接大荒，海天愁思正茫茫。驚風亂颭芙蓉水，密雨斜侵薜荔牆。嶺樹重遮千里目，江流曲似九迴腸。共來百越文身地，猶自音書滯一鄉。",
    "translate": "Up high on the town tower, view of the distant is one of fields expanding into the wilds, Resembling the vastness of skies, oceans and the restless melancholy within me.A gust of wind comes to ripple the lake and hibiscus blossoms, Slanting a drizzle onto walls overgrown with vine and leaves.Mountain ranges are dense with trees obscuring even the best of eyesight, Winding and convoluted like the intestines are the rivers and streams. To the south-eastern land of body tattoos we are collectively assigned, Each to an isolated county where word and correspondence rarely one another reach.."
  },
  {
    "poem": "王濬樓船下益州，金陵王氣黯然收。千尋鐵鎖沈江底，一片降旛出石頭。人世幾回傷往事，山形依舊枕寒流。從今四海為家日，故壘蕭蕭蘆荻秋。",
    "translate": "From Yizhou Wang Jun led the warships downstream, Completely paled into insignificant was Wu's kingship in Jinling. Sunken to the riverbed were gigantic iron locks designed to hold back Wang's fleet, Over the Stone Castle flew a wave of white flags admitting defeat.Though life goes on, times past continue to sentiments evoke, Yet mountains do not orientation change and through them flow cold waters of streams. Territories of different corners have since been unified and one country become, Among rustling reeds ancient forts and castles still stand for visitors to history read.."
  },
  {
    "poem": "謝公最小偏憐女，自嫁黔婁百事乖。顧我無衣搜藎篋，泥他沽酒拔金釵。野蔬充膳甘長藿，落葉添薪仰古槐。今日俸錢過十萬，與君營奠復營齋。",
    "translate": "The youngest and most beloved daughter you were of an esteemed lineage, Yet you married me, a reserved scholar without office but a trying life. You searched the bottom drawer to provide me with better clothing, andYou handed me your golden hairpins persuading me to pawn them for some wine.You contented with having wild vegetables and bean leaves for meals, You settled for using fallen leaves for fire and for more you'd old pagoda trees admire. Now I have achieved a salary of a hundred thousand coins, Yet I can only hold memorials with religious offerings in remembrance of our time.."
  },
  {
    "poem": "昔日戲言身後事，今朝都到眼前來。衣裳已施行看盡，針線猶存未忍開。尚想舊情憐婢僕，也曾因夢送錢財。誠知此恨人人有，貧賤夫妻百事哀。",
    "translate": "How we used to joke about afterlife and who would the other survive, Now it has all happened right before my eyes. I've been donating your clothes and I've nearly given all away, I keep your needlework stowed away as I cannot bear to look at what you left behind.I am still sentimental about our past and have a soft spot for our old servants, And I have burnt offerings for you after dreaming of you time after time. Indeed I know such a regret is common in many people's lives, How poor and lowly couples face hundreds of obstacles daunting their married life.."
  },
  {
    "poem": "閒坐悲君亦自悲，百年多是幾多時？鄧攸無子尋知命，潘岳悼亡猶費詞。同穴窅冥何所望？他生緣會更難期。惟將終夜長開眼，報答平生未展眉。",
    "translate": "In moments of idleness your death grieves me and I also myself grieve, A hundred years is a long time yet how insignificant it can also be! Deng You had to give up his son and he accepted it as fate, Pan Yue wrote a trilogy of elegy lamenting his wife's passing away, all but verbosity in vain.How is being buried together for reunion in afterlife a wish that is other than vague? It is just as remote to pray for and be granted your hand in marriage in the next life again. What I do have is insomnia throughout the night keeping me awake, To compensate for my inability to your knitted eyebrows ease in your living days.."
  },
  {
    "poem": "時難年饑世業空，弟兄羈旅各西東。田園寥落干戈後，骨肉流離道路中。弔影分為千里雁，辭根散作九秋蓬。共看明月應垂淚，一夜鄉心五處同。",
    "translate": "Amidst a famine on top of difficult times and having spent all ancestral heirlooms, Scattered in different corners of the world, brothers of mine have been roving. Family estate and land lay waste by war, Blood relations are wandering in destitute driven from pillar to post.Thousands of miles away from home, I am a picture of a goose lost in the wild alone, Adrift in the wind like fleabane in autumn, blown away from where they had grown. When we the same moon admire tears would follow, Though in five different spots we are tonight, no different are our hearts, all missing home.."
  },
  {
    "poem": "錦瑟無端五十弦，一弦一柱思華年。莊生曉夢迷蝴蝶，望帝春心托杜鵑。滄海月明珠有淚，藍田日暖玉生煙。此情可待成追憶，只是當時已惘然。",
    "translate": "Coincidentally this beautiful zither has fifty strings, Each string, each fret reminds me of a year that has gone by. Life is a dream, mine seems illusory like those beautiful butterflies in Zhuangzi's reverie, Once I loved like King Hope and wished to a cuckoo become to hold onto springtime.Suffering brings out tears in the vast sea that under the brightest moon seem like pearls, Fond memories are like the Bluefield jade warmed in the sun that could joy volatilise. All emotions have become the past held only in remembrance, What could  not be would never be, forever gone are the old times.."
  },
  {
    "poem": "昨夜星辰昨夜風，畫樓西畔桂堂東。身無綵鳳雙飛翼，心有靈犀一點通。隔座送鉤春酒暖，分曹射覆蠟燈紅。嗟余聽鼓應官去，走馬蘭臺類轉蓬。",
    "translate": "Last night under the stars catching breezes of bedtime, We had a rendezvous west of the Pictorial Chamber and east of the Cinnamon Hall. I had not a radiant phoenix's pair of glorious wings, Yet we had a meeting of minds and binding of hearts to each other enthral.We sat together playing drinking games over the warmth provided by spring wine, Surrounded by the flames of crimson candles we took turns to each other's riddles solve. Before long came morning gongs and I had to the Morning Assembly attend, Like a drifting fleabane I sauntered on horseback towards the terrace for officers.."
  },
  {
    "poem": "紫泉宮殿鎖煙霞，欲取蕪城作帝家。玉璽不緣歸日角，錦帆應是到天涯。於今腐草無螢火，終古垂楊有暮鴉。地下若逢陳後主，豈宜重問後庭花？",
    "translate": "The palace surrounded by elegant springs is basked in fogged twilight, Emperor Yang of Sui had wanted to located his capital in the City of Wu. Yet the fate of the imperial seal deserted him for one with a distinct forehead, He could have sailed the world on his splendid fleet had he not led his country to ruin.There are no more fireflies from decaying grass piles to brighten his dark path forward, In the evening, on surviving willow trees from his days rest ravens as they hoot. In his afterlife should he the late Emperor of Chen meet, Would he have asked for a replay of the dance “A Flourishing Backyard with Cajuput”?."
  },
  {
    "poem": "來是空言去絕蹤，月斜樓上五更鐘。夢為遠別啼難喚，書被催成墨未濃。蠟照半籠金翡翠，麝熏微度繡芙蓉。劉郎已恨蓬山遠，更隔蓬山一萬重。",
    "translate": "You said you'd come again yet hollow were your words and for good you were gone, The moon had inclined its way over the chamber when there came the gong before dawn. I woke up from dreaming of bidding you farewell in tears as you left without hesitation, I rose with an urge to write you a letter with ink that was dull wanting chroma.Candlelight illuminates only half of the screen inlaid with jade and gold, From within the hibiscus draperies diffuses incense of musky aroma. There are those who loath the remoteness of the Immortal Mountains, Yet my separation from you feels further away by ten-thousand-fold.."
  },
  {
    "poem": "颯颯東風細雨來，芙蓉塘外有輕雷。金蟾齧鏁燒香入，玉虎牽絲汲井迴。賈氏窺簾韓掾少，宓妃留枕魏王才。春心莫共花爭發，一寸相思一寸灰。",
    "translate": "As easterlies sough through a drizzling sky, Soft thunders strike beyond the Hibiscus Pond. The statues of gilded toad holding a lock in the mouth cannot keep incense out, The well decorated with jade tigers is deep yet long is the rope on the pail to water draw.Jia's daughter peeped through the screen at the handsome Han and later his wife became, Concubine Mi could only leave the Wei prince a pillow to express her love for this prodigy. Be still my beating heart, compete not with spring on blossoming forth, For what remains of my every shred of longing is a mere disheartened, ashen core.."
  },
  {
    "poem": "猿鳥猶疑畏簡書，風雲常為護儲胥。徒令上將揮神筆，終見降王走傳車。管樂有才終不忝，關張無命欲何如？他年錦里經祠廟，梁父吟成恨有餘。",
    "translate": "Gibbons and birds of this garrison still prohibitions of Zhuge's time fear and respect, The unpredictable winds and clouds are still guarding the cordon he defined. Yet in vain in the end were the general's lifelong effort spent on tactics, His master roped himself and rode out in a carriage to surrender and his throne resign.Zhuge was as capable as Guan and Le and deserving of such comparison, Yet Guan and Zhang had not the fate to escape their demise. One day when I pass by the shrine commemorating Zhuge in the Magnificent City, I shall many more sentiments and regrets feel after I the song of Liangfu recite.."
  },
  {
    "poem": "相見時難別亦難，東風無力百花殘。春蠶到死絲方盡，蠟炬成灰淚始乾。曉鏡但愁雲鬢改，夜吟應覺月光寒。蓬萊此去無多路，青鳥殷勤為探看。",
    "translate": "Hard to come by is spending time alone with you, making it all so hard to say goodbye, In the tail of spring, even easterlies lack the strength to wilting blooms revive. Silk worms spin till the end of their living days, Burning candles turn wicks to ashes till they can no more tears of wax cry.In the morning, you'd worry about losing the shine in your hair and your youthfulness, Taking to poetry at night I wonder if you could feel the chill I sense of moonlight. Like the Magic Mountains, you may not be far away but inaccessible you are nonetheless, For tidings of you I could only on the kind-hearted blue birds rely.."
  },
  {
    "poem": "悵臥新春白袷衣，白門寥落意多違。紅樓隔雨相望冷，珠箔飄燈獨自歸。遠路應悲春晼晚，殘宵猶得夢依稀。玉璫緘札何由達，萬里雲羅一雁飛。",
    "translate": "As the season turns to spring I lie brooding in my underclothes in white, Against hopes and wishes White Gate was all we had, now little remains of our good time. I've been back to stare at the red chamber, in the rain cold is the atmosphere in between, Alone I make my jolted return with the lamp and screen beads sway alongside.The road is long, as spring days falls into night, so comes the deep blues, For pieces of you, it is on sleepless nights disturbed by shattered dreams of you that I rely. Who can help me deliver to you gifts of earrings and my letters of love? There goes a wild goose dashing through clouds that stretch on for thousands of miles.."
  },
  {
    "poem": "鳳尾香羅薄幾重，碧文圓頂夜深縫。扇裁月魄羞難掩，車走雷聲語未通。曾是寂寥金燼暗，斷無消息石榴紅。斑騅只繫垂楊岸，何處西南任好風？",
    "translate": "Sitting behind layers of thin wallflower draperies embroidered with phoenix tails, She busied over brocading an emerald curtain dome  in the still of night. Over there she sat with a round fan trying to her shyness hide, Before we could words exchange, in a series of claps a carriage had taken her away.I've been passing nights in loneliness till candles have burnt out and flames extinguished, Now that pomegranate are flowering red, yet I still have not her tidings. Under a willow tree by the embankment I have my spotty nag tied, To the west, to the south or wherever blows the wind, where could I my lady find?."
  },
  {
    "poem": "重帷深下莫愁堂，臥後清宵細細長。神女生涯原是夢，小姑居處本無郎。風波不信菱枝弱，月露誰教桂葉香？直道相思了無益，未妨惆悵是清狂。",
    "translate": "I walk pass by a fair maiden's heavily draped window, Alone on an autumn night, prolonged is loneliness of bedtime. The life of a goddess of the Magic Mountains is nothing but a dream, Maidenhood is livelihood without a man, by clear waters a lady leads a simple life.Water chestnuts are tender and delicate, yet of them currents take no pity, How is it that cinnamon flowers tend to more fragrance transpire under moonlight? Since no satisfaction could possibly arise from my expressing unrequited love, I might as well brood in melancholy to idly lose my mind.."
  },
  {
    "poem": "澹然空水對斜暉，曲島蒼茫接翠微。波上馬嘶看棹去，柳邊人歇待船歸。數叢沙草群鷗散，萬頃江田一鷺飛。誰解乘舟尋范蠡？五湖煙水獨忘機。",
    "translate": "The crystal clear waters the brilliance of twilight reflect, The fog surrounding wandering isles rises to blend in with the distant misty green. On board ferries, horses neigh as they ride the waves further along, While waiting for ferries to their side return, dockers rest by the willow trees.On the sandbank a flock of egrets take flight scattering away from clumps and groves, All but for one which planes over the expansive riverside paddy fields. Who gets my drift as I sail the waters in search of Fan Li? As I get carried away by smoky waters all over in solitude leaving behind worldly schemes.."
  },
  {
    "poem": "蘇武魂銷漢使前，古祠高樹兩茫然。雲邊雁斷胡天月，隴上羊歸塞草煙。迴日樓臺非甲帳，去時冠劍是丁年。茂陵不見封侯印，空向秋波哭逝川。",
    "translate": "Su Wu accepted his role as an ambassador of Han betting on his life, Feeling at a loss, here in front of a shrine in his name flanked by lofty trees stand I. When he was under the Hun skies and moon at clouds' edge where no wild geese flew, In the far north he rose to herd his sheep and rested in his yurt to the wild survive.By the time of his return all had changed, gone was the decorated alter offering blessing, When he left, he was merely twenty donning a crest and a sword by his side. Regretfully it wasn't Emperor Wu who bestowed him the lordship seal, Over a river of autumn waters that shall never return like time he cried.."
  },
  {
    "poem": "十二樓中盡曉妝，望仙樓上望君王。鎖銜金獸連環冷，水滴銅龍晝漏長。雲髻罷梳還對鏡，羅衣欲換更添香。遙窺正殿簾開處，袍袴宮人掃御牀。",
    "translate": "Within the private chambers of the palace, ladies have had their morning make-up applied, Up on the Pavilion of Mirage they pine to greet the emperor as he arrives. On chamber doors, off the mouths of gilded casts of creatures hang cold knocking rings,  In drops of water off the bronze dragon hourglass lapses time, prolonged seems daylight.The ladies over and again their hair comb and into the mirror look, More incense burn as they robes change to keep themselves occupied. In the distance the screens to the emperor's bedchamber are raised, There the imperial maids gather to the emperor's bed prepare and organise.."
  },
  {
    "poem": "蓬門未識綺羅香，擬託良媒益自傷。誰愛風流高格調？共憐時世儉梳妝。敢將十指誇鍼巧，不把雙眉鬭畫長。苦恨年年壓金線，為他人作嫁衣裳。",
    "translate": "A girl of meagre means knows not what it's like to beautiful silk brocades wear and shine, It only further saddens her when she contemplates asking a matchmaker to a suitor find. Who can really appreciate her virtue and merit? For she knows to diligence maintain and the frivolous avoid in hard times.She is confident of her hands and fingers to fine needlework produce, She is not obsessed with having her eyebrows long and fine. Regretfully here she remains year after year stitching embroidery, Sewing bridal dresses for others, such is her life.."
  },
  {
    "poem": "盧家少婦鬱金堂，海燕雙棲玳瑁梁。九月寒砧催木葉，十年征戍憶遼陽。白狼河北音書斷，丹鳳城南秋夜長。誰為含愁獨不見，更教明月照流黃。",
    "translate": "A young woman of a blooming tulip's beauty was married to a Lu family, Her wedded bliss was once as envied as tortoiseshell beams carved with swallows in pairs. September's winter garment pressing sounds hurried leaves yellow and trees bare, For ten years her husband had been at the Liaoyang front line to their country defend.Messages from north of the White Wolf River were severed, Autumn night south of the Red Phoenix City seemed so long extended. Ever out of sight was the fountainhead of her ever deepening melancholy and despair, Who couldn't be there to this moment share as the moon shined on her aureate silk dress.."
  },
  {
    "poem": "空山不見人，但聞人語響。返景入深林，復照青苔上。",
    "translate": "The mountains appear uninhabited with not a person in sight, Yet I hear people talking. Light reflects and penetrates deep into the woods, Shining on once shady moist moss.."
  },
  {
    "poem": "獨坐幽篁里，彈琴復長嘯；深林人不知，明月來相照。",
    "translate": "Sitting along surrounded by bamboo clusters, I play the lyre, recite poems and versify some more; Deep in the woods where no one would takes any notice, There is only the moon shining on my solitude.."
  },
  {
    "poem": "山中相送罷，日暮掩柴扉；春草明年綠，王孫歸不歸？",
    "translate": "After seeing you off in the mountains,As the sun has set I shut the door to my timber hut; Next spring when grass comes green again,Would you, a nobleman, return to visit, I wonder?."
  },
  {
    "poem": "紅豆生南國，春來發幾枝；願君多采擷，此物最相思。",
    "translate": "These red beans grow only in the south,In spring they branch away and flourish; Why don't you harvest plentiful to cherish,For they are most symbolising of yearning.."
  },
  {
    "poem": "君自故鄉來，應知故鄉事。來日綺窗前，寒梅著花未？",
    "translate": "You came from home,A bearer of home news you should be.On the day of your departure, by your ornate window, Did you notice any budding flowers on those winter plum trees?."
  },
  {
    "poem": "歸山深淺去，須盡丘壑美。莫學武陵人，暫遊桃源裏。",
    "translate": "As you retire into the breadth and depth of the mountains, You should thoroughly enjoy the highs and lows of the terrain. Do not be like the Wuling fisherman who discovered utopia, Who only stayed temporarily for some sightseeing of the peachy haven.."
  },
  {
    "poem": "終南陰嶺秀，積雪浮雲端：林表明霽色，城中增暮寒。",
    "translate": "Against the sun lies the elegant silhouette of the Zhongnan Mountains, Over the summits caps snow resembling clouds that float.Beyond the forest the sun glistens after the rain, Yet the Changan City yonder seems bleaker as twilight reflects upon the snow.."
  },
  {
    "poem": "移舟泊煙渚，日暮客愁新。野曠天低樹，江清月近人。",
    "translate": "I steer my boat towards an isle in the misty river to moor,As daylight draws to a close, there grows a traveller's gloom.The wilderness is expansive and over trees the nightfall looms,The river is clear bringing within reach a reflection of the moon.."
  },
  {
    "poem": "春眠不覺曉，處處聞啼鳥。夜來風雨聲，花落知多少？",
    "translate": "Spring morning arrives unnoticed in my slumber,Till I hear birds twittering everywhere.It springs to mind a storm raged through overnight,Off it blew how many flowers I wonder?."
  },
  {
    "poem": "床前明月光，疑是地上霜。舉頭望明月，低頭思故鄉。",
    "translate": "Before my bed floods moonlight,It might be frost I thought to myselfI raise my head towards the moon shining ever so bright,Only to bow to homesickness as I pine.."
  },
  {
    "poem": "美人卷珠簾，深坐蹙蛾眉：但見淚痕濕，不知心恨誰？",
    "translate": "A beautiful lady has her beaded curtain raised,Behind which in deep thoughts she sits with her elegantly thin eyebrows distorted; I can see moist trails of tears from corners of her eyes, I wonder who it is that she harbours resentment towards?."
  },
  {
    "poem": "功蓋三分國，名成八陣圖。江流石不轉，遺恨失吞吳。",
    "translate": "Shu's Premier outwitted all in warfare amongst the ancient Three Kingdoms, His fame lives on along with his Octagonal battle plot.While the river perpetually gushes through the Octagonal stone setting ,The regret of an lost opportunity to take over Wu lingers on.."
  },
  {
    "poem": "白日依山盡，黃河入海流；欲窮千里目，更上一層樓。",
    "translate": "From the pavilion one sees the sun setting behind the mountains,Unrelentingly towards the sea the Yellow River flows; In order to see thousands of miles further afield,To a higher level one must go.."
  },
  {
    "poem": "蒼蒼竹林寺，杳杳鐘聲晚。荷笠帶斜陽，青山獨歸遠。",
    "translate": "The temple is well nestled amongst dense bamboo groves,The evening bells through this quiet realm toll. Your lotus-leaf hat reflects the setting sun,Alone you travel further along in the green mountain fold.."
  },
  {
    "poem": "泠泠七弦上，靜聽松風寒；古調雖自愛，今人多不彈。",
    "translate": "The seven strings on your cittern give rise to music,I listen intently to the portrayal of winds rustling pine trees and feel the implied chill; Though I am also a lover of old compositions,Nowadays not many would continue to play the genre still.."
  },
  {
    "poem": "孤雲將野鶴，豈向人間住？莫買沃洲山，時人已知處。",
    "translate": "A lone cloud sends off a flight of wild cranes,How could the temporal be the place for them?I wouldn't recommend the Wozhou Mountains for your seclusion,After all, as a place to retreat to, it has become well-known.."
  },
  {
    "poem": "懷君屬秋夜，散步詠涼天。空山松子落，幽人應未眠。",
    "translate": "I think of you on this autumn night,As I stroll along and take to poetise the cool weather.I'd imagine that in the mountains it is time when pine cones fall,And you're likely to be engrossed in thoughts too keeping you awake.."
  },
  {
    "poem": "鳴箏金粟柱，素手玉房前。欲得周郎顧，時時誤拂弦。",
    "translate": "She plays the strings strung between shiny copper frets,On the instrument her hands of delicate pale-skin strum and stroke.Hoping to this learned handsome patron's attention draw,Time and again she plucks a wrong note.."
  },
  {
    "poem": "三日入廚下，洗手作羹湯。未諳姑食性，先遣小姑嘗。",
    "translate": "On Day Three of my marriage I enter the kitchen,I wash my hands to a soup prepare.As I am not yet familiar with my parents-in-law's culinary likings,I shall ask my sister-in-law to savour first.."
  },
  {
    "poem": "昨夜裙帶解，今朝蟢子飛。鉛華不可棄，莫是藁砧歸。",
    "translate": "Last night my girdle came undone by itself,This morning around me flew moths; both are signs of expecting.Therefore I shan't be neglectful with my rouge,For perhaps my master may be returning home presently.."
  },
  {
    "poem": "千山鳥飛絕，萬徑人蹤滅；孤舟蓑笠翁，獨釣寒江雪。",
    "translate": "Hundreds of hills see not a bird flying by,Thousands of paths bear not a footprint in sight; One lone boat carries an old man in a bamboo hat and straw cloak,In solitude in the river in the snow he angles in the cold.."
  },
  {
    "poem": "寥落古行宮，宮花寂寞紅。白頭宮女在，閒坐說玄宗。",
    "translate": "Inside the neglected summer palace walls,Peonies are still glamorously red but without admirers.Court maids remain though their hair has turned grey,Chatting about the good old days when Emperor Xuanzong came to reside.."
  },
  {
    "poem": "綠螘新醅酒，紅泥小火爐。晚來天欲雪，能飲一杯無？",
    "translate": "I have some recently fermented wine,The small terracotta pot stove is warm and inviting.There's a feeling of snow coming after dark,Would you like to join me for a drink tonight?."
  },
  {
    "poem": "故國三千里，深宮二十年。一聲何滿子，雙淚落君前。",
    "translate": "Being thousands of miles away from home,Kept for twenty years in the palace she has been.Upon hearing a folk song of her region,Tears come streaming down both her cheeks.."
  },
  {
    "poem": "向晚意不適，驅車登古原。夕陽無限好，只是近黃昏。",
    "translate": "Evening approaches finding my spirit indisposed,So I rode a buggy up the historic site.Sunset is ever so beautiful,Regrettably as dusk fades, impends night.."
  },
  {
    "poem": "松下問童子，言師采藥去。只在此山中，雲深不知處。",
    "translate": "Under pine trees I asked a pupil of your whereabouts,Who mentioned his master has gone to gather herbs.Somewhere in the mountain you were for certain,Uncertain was where among the deep cloud cover you were.."
  },
  {
    "poem": "嶺外音書絕，經冬復立春。近鄉情更怯，不敢問來人。",
    "translate": "Separated by mountain ranges, I was deprived of words from home,Winter passed and spring came, over and again.As I cross the Han River, the impending homecoming unnerves me so,So much so I shy away from asking about my homeland of the locals.."
  },
  {
    "poem": "打起黃鶯兒，莫教枝上啼。啼時驚妾夢，不得到遼西。",
    "translate": "Oh I would like to stone away the orioles,So that they can't perch and chipper on trees.Their twitter my sweet dream disturbs,Preventing me from reaching my husband in Liaoxi.."
  },
  {
    "poem": "北斗七星高，哥舒夜帶刀。至今窺牧馬，不敢過臨洮。",
    "translate": "The Big Dipper's seven stars hang high in the sky,The tale has it General Gesu's sword was ready as ever in the night.To this day, although western tribes crave to their herding territory expand,They dare not cross River Yao to strike.."
  },
  {
    "poem": "君家何處住，妾住在橫塘。停船暫借問，或恐是同鄉。",
    "translate": "Where is your family home, sir, As for me, I live by the Wide Bay. I stop my boat briefly to an enquiry make, I have a feeling we're from the same place.."
  },
  {
    "poem": "家臨九江水，來去九江側。同是長干人，生小不相識。",
    "translate": "I used to live by the waters of Nine-river Town, I used to go about the nearby waterways. Though we're both people of the Changgan region, I left when we were too young to each other's acquaintance make.."
  },
  {
    "poem": "玉階生白露，夜久侵羅襪。卻下水晶簾，玲瓏望秋月。",
    "translate": "The stairs are rendered marble-like as dew condensates, Deep into the night through her stockings chills penetrate. She lets down the crystalline curtain, And through the delicate veil she continues to the autumn moon gaze.."
  },
  {
    "poem": "鷲翎金僕姑，燕尾繡蝥弧。獨立揚新令，千營共一呼。",
    "translate": "An awe-inspiring general who used vulture feather fletching and golden arrowheads, Whose army flew embroidered battle flags with a tail like that of a swallow. The general stood tall to a new order provide, In unity an army of thousands of squads gave roars.."
  },
  {
    "poem": "林暗草驚風，將軍夜引弓。平明尋白羽，沒在石稜中。",
    "translate": "The woods had darkened and grasses were aflutter as winds blasted through, At night the general drew his bow and took a shot. The next morning he found white fletching protruding from a boulder, And anchored in stone was his arrowhead and shaft.."
  },
  {
    "poem": "月黑雁飛高，單于夜遁逃。欲將輕騎逐，大雪滿弓刀。",
    "translate": "In the dim moonlight wild geese flew high in the sky, In the dark fled the Tartar chieftain. The general was about to lead a light cavalry to chase, Then came heavy snow cladding bows and glaives.."
  },
  {
    "poem": "野幕敞瓊筵，羌戎賀勞旋。醉和金甲舞，雷鼓動山川。",
    "translate": "In tents and marquees out in the wild, a lavish banquet was held, To the general's military triumph over foreign tribes celebrate. In tipsiness the general rose to perform a sword dance, Accompanied by thundering drum rolls that through mountains and rivers tremors sent.."
  },
  {
    "poem": "嫁得瞿塘賈，朝朝誤妾期。早知潮有信，嫁與弄潮兒。",
    "translate": "I'm married to a Qutang merchant, Time and again he failed to return on time. Had I known that tides and currents could be forecast, I might have chosen to be a sailor's wife.."
  },
  {
    "poem": "少小離家老大回，鄉音無改鬢毛催；兒童相見不相識，笑問客從何處來。",
    "translate": "I left home a youngster and returned a senior, Though greyed my temple hair has, changed my accent has not. Village children came to greet me but knew me not, They cheerfully took me for a visitor and enquired where I'd come from.."
  },
  {
    "poem": "隱隱飛橋隔野煙，石磯西畔問漁船；桃花盡日隨流水，洞在清溪何處邊？",
    "translate": "An indistinct flying bridge stands behind smoke of the wild, To the west of a boulder in the water rests a fishing boat, and I ask: Peach blossoms fall and drift in the creek day and night, Where lies the cavern that leads to the utopian Shangri-la?."
  },
  {
    "poem": "獨在異鄉為異客，每逢佳節倍思親。遙知兄弟登高處，徧插茱萸少一人。",
    "translate": "I am an outsider at a foreign place alone, Every occasion of festivity finds me missing my family manifold. In the distance my brothers must be making a climb into the highlands, They would have evodia attached to their sleeves and my absence noted.."
  },
  {
    "poem": "寒雨連江夜入吳，平明送客楚山孤。洛陽親友如相問，一片冰心在玉壺。",
    "translate": "You arrived in the Wu region when icy rain rendered the river full, Now at dawn I'm seeing you off to cross the isolated mountains of Chu. If my family and friends in Luoyang asked about my situation, You could say that my heart is crystal clear and kept jadeite pure.."
  },
  {
    "poem": "閨中少婦不知愁，春日凝妝上翠樓。忽見陌頭楊柳色，悔教夫婿覓封侯。",
    "translate": "There was a young woman in her bedchamber who had not a thing to worry, On a spring day she dressed up to visit a fine edifice. A sudden glance of fresh willowy banks on the wayside Made her regret ever urging her husband to pursue high office.."
  },
  {
    "poem": "昨夜風開露井桃，未央前殿月輪高。平陽歌舞新承寵，簾外春寒賜錦袍。",
    "translate": "Last night's spring breeze sent abloom the peach trees by the Dewy Well, Above the antechamber of the Weiyang Palace hovered a full moon at its zenith. Princess Pingyang's court dancer was graced to the emperor's bedchamber enter, The emperor also bestowed upon her a silk gown to shield from spring inclemency.."
  },
  {
    "poem": "葡萄美酒夜光杯，欲飲琵琶馬上催。醉臥沙場君莫笑，古來征戰幾人回？",
    "translate": "Fine red wine glitters in a jade chalice that glows in the night, Before I could drink it come lyre notes giving orders to mount the horse. Laugh not, I pray you, at my tipsiness that may see me fall drunk on the battlefield, For how many have been able to return in the history of war?."
  },
  {
    "poem": "故人西辭黃鶴樓，煙花三月下揚州。孤帆遠影碧空盡，惟見長江天際流。",
    "translate": "My old friend bade farewell to the Tower of Yellow Cranes in the west, And headed downstream to Yangzhou amid March's blooming scenes. My eyes followed his lone sail into the distance to the verge of the blue sky, Till the Yangtze gushing towards the horizon was all that could be seen.."
  },
  {
    "poem": "朝辭白帝彩雲間，千里江陵一日還。兩岸猿聲啼不住，輕舟已過萬重山。",
    "translate": "Among clouds in the colour of dawn, from Baidi I take my leave, Though hundreds of miles away, Jiangling is within a day's reach.From both sides of the gorge come incessant howling of gibbons and monkeys, My skiff white water cleaves leaving behind thousands of mountain peaks.."
  },
  {
    "poem": "故園東望路漫漫，雙袖龍鐘淚不乾。馬上相逢無紙筆，憑君傳語報平安。",
    "translate": "My hometown is to the east, a long way away, My sleeves aren't enough to wipe away all the tears in my clumsy senile state.  We meet on horseback and have nothing to write on or with, I'll rely on you to call upon my home and the news of my safety convey.."
  },
  {
    "poem": "岐王宅里尋常見，崔九堂前幾度聞。正是江南好風景，落花時節又逢君。",
    "translate": "In Duke Qi's mansion we often gathered, In Secretary Cui's residence I frequently heard you play. Right now south of the Yangtze offers beautiful scenery,  And we meet again as withered petals fluttering amid a seasonal change.."
  },
  {
    "poem": "獨憐幽草澗邊生，上有黃鸝深樹鳴。春潮帶雨晚來急，野渡無人舟自橫。",
    "translate": "I'm particularly fond of the bulrush area by the ravine, There are orioles singing above deep in the groves. Spring monsoon rain and the evening tide each other aggravate, By the dock in the wild wavers and sways a deserted boat.."
  },
  {
    "poem": "月落烏啼霜滿天，江楓漁火對愁眠。姑蘇城外寒山寺，夜半鐘聲到客船。",
    "translate": "The moon drooped low and crows cawed in the frosty sky, Staring at riverside maple trees and lights on fishing boats is my melancholy sleeplessness. From the Cold Mountain Temple in the Suzhou environs Came the midnight toll all the way to visitors' boats telling time.."
  },
  {
    "poem": "春城無處不飛花，寒食東風御柳斜。日暮漢宮傳蜡燭，輕煙散入五侯家。",
    "translate": "Not a place was without blossom and fluttering petals in a city in spring, The willows of the imperial garden swayed in easterlies on the memorial day of Cold Fare. At sunset the Palace set alight candles everywhere, Light smoke rose and into the nearby estates of five noblemen drifted and spread.."
  },
  {
    "poem": "更深月色半人家，北斗闌干南斗斜。今夜偏知春氣暖，蟲聲新透綠窗紗。",
    "translate": "Deep into the night the moon on half a cottage shines, Across the sky the Big Dipper lies and the Little Dipper tilts an incline, The warmth of spring is readily felt tonight, Through the green window screen insects have started to buzz and hum.."
  },
  {
    "poem": "紗窗日落漸黃昏，金屋無人見淚痕。寂寞空庭春欲晚，梨花滿地不開門。",
    "translate": "On the other side of the window screen, twilight fainted as the sun set,  Inside the gilded chamber where the emperor no longer came to visits her tears fell.  In a desolate court full of loneliness spring was coming to an end, Behind gates tightly shut flowers from pear trees drifted to the ground everywhere.."
  },
  {
    "poem": "歲歲金河復玉關，朝朝馬策與刀環。三春白雪歸青塚，萬里黃河繞黑山。",
    "translate": "Between the Gate of Jade and the River of Gold a soldier's life toils year after year, Engaging in battles and drills with a horse whip and a glaive day after day. In March comes spring, yet snow continues to fall on Zhaojun's grave, I've marched around sable mountains and seen the Yellow River thousands of miles rave.."
  },
  {
    "poem": "玉樓天半起笙歌，風送宮嬪笑語和。月殿影開聞夜漏，水晶簾捲近秋河。",
    "translate": "From a splendid tower amidst the skies came singing and orchestral play, The wind court ladies' laughter and vocals mingled and conveyed. Shadows shifted through the night in the monotony of moonshine, Crystalline curtains swung and swayed resembling the Milky Way.."
  },
  {
    "poem": "回樂峰前沙似雪，受降城外月如霜。不知何處吹蘆管，一夜征人盡望鄉。",
    "translate": "Before the Peak of Huile, sand blows like snow, Outside the town of Shouxiang the moon is as white as hoarfrost. From somewhere blows a tune of reed  Evoking homesickness in soldiers all night long.."
  },
  {
    "poem": "朱雀橋邊野草花，烏衣巷口夕陽斜。舊時王謝堂前燕，飛入尋常百姓家。",
    "translate": "By the Rose Finch Bridge now grow flowers and weeds running wild, At the end of what used to be the Black Robes Row the sun makes its incline. Sparrows that used to gather in the courts of Wang and Xie of the Jin dynasty, Now scattered around commoners' huts, cottages and their ordinary street life.."
  },
  {
    "poem": "新粧宜面下朱樓，深鎖春光一院愁。行到中庭數花朵，蜻蜓飛上玉搔頭。",
    "translate": "Down from a tower of crimson red came a freshly powdered pretty face, Being confined to a court saddened spring and its grace. To the garden centre she strolled and flowers counted, A dragonfly the scent of a woman followed and rested on her hairpin made of jade.."
  },
  {
    "poem": "淚濕羅巾夢不成，夜深前殿按歌聲。紅顏未老恩先斷，斜倚薰籠坐到明。",
    "translate": "On a night when dreams didn't come true, drenched in tears was her silk kerchief,  The night deepened yet singing continued in the forecourt. Her beauty had not left her yet her love had, Up she sat and leaned on the incense burner till dawn.."
  },
  {
    "poem": "禁門宮樹月痕過，媚眼惟看宿鷺窠。斜拔玉釵燈影畔，剔開紅焰救飛蛾。",
    "translate": "Behind the Palace's guarded gate the moon trailed behind a thicket of trees, There she was with her enchanting eyes admiring herons nestled among leaves. By the lamp there was light and shade, she tilted her head to a hairpin remove  To pick at the flame hoping to a moth relieve.."
  },
  {
    "poem": "日光斜照集靈臺，紅樹花迎曉露開。昨夜上皇新授籙，太真含笑入簾來。",
    "translate": "The sun cast inclined rays on the Terrace of Spirits in view, The redwoods greeted with flowering red dabbled in morning dews. Last night here the Emperor a Toaist priestess conferred,  A smiling Lady Yang Reverend True Faith became only to her veil remove.."
  },
  {
    "poem": "虢國夫人承主恩，平明騎馬入宮門。卻嫌脂粉污顏色，淡掃蛾眉朝至尊。",
    "translate": "Lady Yang's married sister was summoned by the Emperor to the palace hall, She crossed the Palace Gateway on horseback at dawn. With a dislike for powders that could her natural colour stain, She had merely touched up her brows lightly to the Emperor come before.."
  },
  {
    "poem": "金陵津渡小山樓，一宿行人自可愁。潮落夜江斜月裡，兩三星火是瓜州。",
    "translate": "Here at the inn on a hill overlooking the Jinling Ferry, Overnight travellers inevitably feel their nostalgia for home swell. The river tide ebbs away as the moon inclines, In the distance glimmer a few twinkles that I take for Guazhou's presence.."
  },
  {
    "poem": "寂寂花時閉院門，美人相並立瓊軒。含情欲說宮中事，鸚鵡前頭不敢言。",
    "translate": "In the time of full bloom, kept tightly shut were palatial court gates, Two lovely faces within the court gathered by the resplendent hallway. Though eager to complain of palace life, on second thought from it they refrained, In case there was a parrot that might catch what they say.."
  },
  {
    "poem": "洞房昨夜停紅燭，待曉堂前拜舅姑。妝罷低聲問夫婿：畫眉深淺入時無？",
    "translate": "Out went wedding candles in the bedchamber last night, Out in the front hall she shall curtsy to her parents-in-law after sunrise. On finishing her make-up she asked her husband shyly: Were her brows drawn in her favour, well shaped and refined?."
  },
  {
    "poem": "清時有味是無能，閒愛孤雲靜愛僧。欲把一麾江海去，樂遊原上望昭陵。",
    "translate": "Only the incompetent would laze away peaceful times, I'd stare at a lone cloud when idle, and seek a monk's company for peace and quiet. Now I'm about to trudge over rivers and seas to a corner administer, Here on Leyou Tombs my tribute goes to Emperor Taizong.."
  },
  {
    "poem": "折戟沈沙鐵未銷，自將磨洗認前朝。東風不與周郎便，銅雀春深鎖二喬。",
    "translate": "Buried deep in the sand are broken lances, have yet rust are their spearheads,I wash them up and recognise they are from a historic period. Had the easterlies not blown in General Zhou's favour, Cao's Tower of Bronze Peacocks would have held hostage the nubile Qiao sisters.."
  },
  {
    "poem": "煙籠寒水月籠沙，夜泊秦淮近酒家。商女不知亡國恨，隔江猶唱後庭花。",
    "translate": "The river is cold and enshrouded in a fog, the river sand enshrouded in moonlight, I've come to moor on the Qinhuai after dark where there are cabarets nearby. Courtesans perceive not the sorrow of a perished empire, Across the river singing of A Flourishing Backyard continues into the night.."
  },
  {
    "poem": "青山隱隱水迢迢，秋盡江南草未凋。二十四橋明月夜，玉人何處教吹簫？",
    "translate": "So far in the distance you are, beyond indistinct mountains and remote waters, South of the Yangtze where grass withers not in autumn. On a night of full moon, on which of the twenty four bridges are you, A handsome fellow, teaching ladies to play the flute?."
  },
  {
    "poem": "落魄江湖載酒行，楚腰纖細掌中輕。十年一覺揚州夢，贏得青樓薄幸名。",
    "translate": "Forever in a comedown, I travelled the country accompanied by wine, Many a king and hero indulged in feather-light women of delicate waist, as so did I. A pipe dream it had been for me, ten years in Yangzhou, a fool's paradise, Infamously unfaithful was my claim to fame in districts of red lantern lights.."
  },
  {
    "poem": "銀燭秋光冷畫屏，輕羅小扇撲流螢。天階夜色涼如水，坐看牽牛織女星。",
    "translate": "A candle flame flickers against a dull painted screen on an cool autumn night, She holds a small silk fan to flap away dashing fireflies. Above her hang celestial bodies as frigid as deep water, She sat there watching Altair of Aquila and Vega of Lyra pining for each other in the sky.."
  },
  {
    "poem": "娉娉嫋嫋十三餘，豆蔻梢頭二月初。春風十里揚州路，捲上珠簾總不如。",
    "translate": "Delicate and graceful when she has barely turned thirteen, Like tender cardamom sprigs come February's new moon. Spring breezes waft along the three-mile long Yangzhou Avenue, Up rolled many beaded screens yet there is none that is her equal in view.."
  },
  {
    "poem": "多情卻似總無情，唯覺尊前笑不成。蠟燭有心還惜別，替人垂淚到天明。",
    "translate": "However wholehearted I am, my heart would seem cold come parting time, Fronted with a farewell drink I cannot even put on a smile. Candles seem to sympathise with my reluctance to leave, Whose wax drips my tears for me till dawn arrives.."
  },
  {
    "poem": "繁華事散逐香塵，流水無情草自春。日暮東風怨啼鳥，落花猶似墜樓人。",
    "translate": "A spectacular tale it was that has spread to chase incense and ashes, Waters must run in the course of nature just as flowers and plants flourish in spring. At sunset, birds' warbles tremble in easterlies and forlorn appear, Petals fall like the tale of a lady who took a leap, and away they drift.."
  },
  {
    "poem": "君問歸期未有期，巴山夜雨漲秋池。何當共剪西窗燭，卻話巴山夜雨時。",
    "translate": "You asked when I shall return, that I have no idea, At night in the Ba Mountains rain fills a pond of autumn over the brim. I wonder when we could in your west chamber a candle share and its wick trim, For me to recount to you my thoughts on these rainy nights in the Ba hills.."
  },
  {
    "poem": "嵩雲秦樹久離居，雙鯉迢迢一紙筆。休問梁園舊賓客，茂陵風雨病相如。",
    "translate": "Being far apart like clouds of the Song Mountains and trees of Qin, With brush and paper we correspondence write to dispatch yonder. Ask not about the Liang Mansion and company of old, For I have been frustrated and stricken like Xiangru in a Maoling storm.."
  },
  {
    "poem": "為有雲屏無限嬌，鳳城寒盡怕春宵。無端嫁得金龜婿，辜負香衾事早朝。",
    "translate": "Even though a screen painted with colourful clouds looks ever so exquisite, In the capital, once winter turns to spring nighttime is shortened against her wish.Inadvertently she is married to a gentleman of high office, Who must rise early and turn his back on their bedchamber to attend morning assembly.."
  },
  {
    "poem": "乘興南遊不戒嚴，九重誰省諫書函。春風舉國裁宮錦，半作障泥半作帆。",
    "translate": "Impulse drove the Sui Emperor to tour the south and national welfare disdain, He would not hear of what his Court had to remonstrate against. Brocades made by women of the empire in spring breezes flutter, Half of them as saddle cloth for imperial horses and the other half as sails.."
  },
  {
    "poem": "瑤池阿母綺窗開，黃竹歌聲動地哀。八駿日行三萬里，穆王何事不重來。",
    "translate": "By the Marble Pond, wide open are the silk-screened windows of the Heaven Empress, Audible on earth is the sound of nature singing the Yellow Bamboo verses.Tales tell of eight steeds in historic Zhou that could ten thousand leagues gallop in a day, Where is their master, the longevity pursuing Emperor Mu, who has never returned?."
  },
  {
    "poem": "雲母屏風燭影深，長河漸落曉星沈。嫦娥應悔偷靈藥，碧海青天夜夜心。",
    "translate": "A screen made of mica reflects shadows and shades in candlelight, The Milky Way slides low and stars dim as approaches daylight. Maybe the Moon Goddess regrets ever having stolen the elixir of life, As night after night she must over azure seas hover and in the blue resides.."
  },
  {
    "poem": "宣室求賢訪逐臣，賈生才調更無倫。可憐夜半虛前席，不問蒼生問鬼神。",
    "translate": "In the Grand Hall, Han Emperor Wen received exiled officers in search of sages, Of them young Officer Jia's scholarship and wisdom was unparalleled. Emperor Wen with modesty gave a night audience to the learned gentleman, Yet the emperor asked not about his people but the supernatural.."
  },
  {
    "poem": "冰簟銀床夢不成，碧天如水夜雲輕。雁聲遠過瀟湘去，十二樓中月自明。",
    "translate": "Unable to fall asleep I am on a bed with a chilly bamboo mat awash with moonlight, The sky is azure like deep water with light clouds of night. Quacks of wild geese fade away as they towards Xiao and Xiang waters fly, Here in a lofty of a grand elevation in the capital, only the moon remains bright.."
  },
  {
    "poem": "玄宗回馬楊妃死，雲雨難忘日月新。終是聖明天子事，景陽宮井又何人。",
    "translate": "By the time Emperor Xuanzong returned via Mawei, Lady Yang had bit the dust, Though many a sunrise and new moon had gone by, unforgettable was their love. Yet he was a Son of Heaven stately and resolute after all, Unlike an emperor in history who with his concubines hid in the Jingyang palace well.."
  },
  {
    "poem": "碧闌干外繡簾垂，猩色屏風畫折枝。八尺龍鬚方錦褥，已涼天氣未寒時。",
    "translate": "Embroidered screens hang low on the outside of green balustrades, Yet still in place inside is a blind of crimson brightly painted only with sprays and sprigs. On the bed padded with a eight-foot long rattan mat lays a folded duvet, The weather has cooled but coldness hasn't  yet set in.."
  },
  {
    "poem": "江雨霏霏江草齊，六朝如夢鳥空啼。無情最是臺城柳，依舊煙籠十里堤。",
    "translate": "On the river, torrential spring rain falls levelling grass by the shores, The history of six short-lived dynasties seems a dream that saddens even twittering birds. Most apathetic of this raised stronghold appear to be the weeping willows, As always, they bow and sway to veil the three-mile long banks flanking the river.."
  },
  {
    "poem": "誓掃匈奴不顧身，五千貂錦喪胡塵。可憐無定河邊骨，猶是深閨夢裡人。",
    "translate": "They vowed to give it all to all Hun invaders expel, All five thousand officers and soldiers perished, in a foreign desert they fell. Let there be mercy on their forsaken remains by the Wandering River, Whose wives in their boudoirs still dream of a return of their men.."
  },
  {
    "poem": "別夢依依到謝家，小廊回合曲闌斜。多情只有春庭月，猶為離人照落花。",
    "translate": "My reluctance to leave takes me back to the Xie residence in my dream, Where the cloisters encircle and balustrades at angles traverse and meet.  Only the moon in this spring garden seems sentimental and sympathetic, As it sheds light on drifting petals for a soul suffering a parting of ways like me.."
  },
  {
    "poem": "近寒食雨草萋萋，著麥苗風柳映堤。等是有家歸未得，杜鵑休向耳邊啼。",
    "translate": "As the Cold Fare Festival approaches grasses flourish in the rain,Spring breezes of wheat seedlings and willows by the bank lively waves make. Many like me have a home to return to but are elsewhere detained, Oh I beg of cuckoos to hold their sorrowful coos when they're within my range.."
  },
  {
    "poem": "渭城朝雨浥輕塵，客舍青青柳色新。勸君更盡一杯酒，西出陽關無故人。",
    "translate": "A morning drizzle in the Town of Wei light dust on the ground wets, Outside the hostel willows grow green and fresh. Bidding you farewell, I'd like to offer you one more toast, For west of the Sun Gate you won't come across any old friend.."
  },
  {
    "poem": "桂魄初生秋露微，輕羅已薄未更衣。銀箏夜久殷勤弄，心怯空房不忍歸。",
    "translate": "The moon has just shown her face on a night with slight autumn dew, Her thin robe is becoming light, yet for a change of clothes she makes no move. On her silver cittern she plays heartily all evening, Concealing her dread of returning to her lonely room.."
  },
  {
    "poem": "奉帚平明金殿開，且將團扇共徘徊。玉顏不及寒鴉色，猶帶昭陽日影來。",
    "translate": "With a broom she awaits the opening of the Main Court at morning's first light,  She roams the hallways with her round fan dusting away in her idle time, She could not help but feel that her face has been outshone by even winter ducks, Which reflect the radiance from the Mansion of Morning Glory as they flit by.."
  },
  {
    "poem": "秦時明月漢時關，萬里長征人未還。但使龍城飛將在，不教胡馬渡陰山。",
    "translate": "The same moon of ancient Qin also shined on the same fort of historic Han, Hardly any made a return from thousand-league marching expedition. If only the Winged General of Han were around to fight the township of Basilisk, The barbarians and their horses would never have dared to cross the Mountains of Yin.."
  },
  {
    "poem": "黃河遠上白雲間，一片孤城萬仞山。羌笛何須怨楊柳，春風不度玉門關。",
    "translate": "The Yellow River into the clouds winds and undulates, One lone township lies among towering mountain ranges. Why play the lamenting Willow Ballad on your Jiang flutes, When you know the Gate of Jade spring and barrenness separates.."
  },
  {
    "poem": "雲想衣裳花想容，春風拂檻露華濃。若非群玉山頭見，會向瑤臺月下逢。",
    "translate": "Splendid clouds and flowers reminds us of Lady Yang's beauty, Her charm is ever-present in sill-crossing spring breezes and condensate dews. You'd see her where gods reside, either at the peak of the Celestial Mountains, Or on the Jadeite Terrace under a heavenly moon.."
  },
  {
    "poem": "一枝紅艷露凝香，雲雨巫山枉斷腸。借問漢宮誰得似，可憐飛燕倚新粧。",
    "translate": "A branch of crimson glamour, the peony appears embalmed in dew, A reverie of a reunion on cloud nine of the Magic Mountains woefully illudes. Who in the history of the Han Palace could her beauty compare with? Perhaps only the lovely lady by the name of Dashing Swallow on her debut.."
  },
  {
    "poem": "名花傾國兩相歡，常得君王帶笑看。解釋春風無限恨，沉香亭北倚闌干。",
    "translate": "The queen of flowers and all forsaking beauty are befitting company of jollity, That often has the smiling Emperor happily look on. Released into infinite spring breezes are his countless worries, Together they recline against the northern balustrade of the Aloewood Pavilion.."
  },
  {
    "poem": "勸君莫惜金縷衣，勸君惜取少年時。花開堪折直須折，莫待無花空折枝。",
    "translate": "I'd like to discourage you from indulging in your robes made of golden threads, I'd like to encourage you to cherish and honour your youthful days. Make your picking when flowers are in bloom, Wait not till out of bloom to pick on twigs and sprigs in vain.."
  }
]