[
  {
    "poem": "城上風光鶯語亂，城下煙波春拍岸。綠楊芳草幾時休？淚眼愁腸先已斷。情懷漸覺成衰晚，鸞鏡朱顏驚暗換。昔年多病厭芳尊，今日芳尊惟恐淺。",
    "translate": "In the town, the warble of orioles mingles among its glorious scenery and sights, In the moat of the town, against the enclosing walls crush waves of springtime. For how long last the green of willows and the fragrance of grass? My eyes are growing teary, yet already rent are my melancholic insides.So I have noticed that increasingly becoming aged is my frame of mind, Like an astonished mute phoenix, surprised I was, at the passing of my prime.  In the past, my sickly physique had me libation detest, Now I only dread holding a chalice that is dry.."
  },
  {
    "poem": "碧雲天，黃葉地，秋色連波，波上寒煙翠。山映斜陽天接水，芳草無情，更在斜陽外。黯鄉魂，追旅思，夜夜除非，好夢留人睡。明月樓高休獨倚，酒入愁腸，化作相思淚。",
    "translate": "The sky is blue with clouds, the ground covered in leaves yellowed,To the water's edge spread autumn colours, cold mist hovers over green waters.The setting sun reflects off mountain ranges, the sky and waters a picture paint, Grass feels not, more of it grows beyond the setting sun like uninhibited nostalgia.Drowning in homesickness, depressed by my time on the road, Sleepless are nights, unless sweet dreams find me to some rest provide.Leaning over railings atop a tower to the moon admire is not for those alone, For a drink of spirits down a saddened soul makes wistful tears flow.."
  },
  {
    "poem": "塞下秋來風景異，衡陽雁去無留意。四面邊聲連角起。千嶂裏，長煙落日孤城閉。濁酒一杯家萬里，燕然未勒歸無計。羌管悠悠霜滿地。人不寐，將軍白髮征夫淚。",
    "translate": "At the borders autumn comes to the landscape change, Wild geese bound for Hengyang have no intention to here stay. All round blares the sound of bugles among desert winds. Among countless peaks of these mountain ranges, At twilight rises wisps of smoke from an isolated town that is shutting its gate.Over a sip of stale wine I think of home that is tens of thousands of miles away, Being far from achieving a Yanran milestone, I am unable to set a return date. Lingering in the air are Qiang pipe tunes as hoarfrost covers the ground of this place. Wakeful I stay, A grey-haired general I am, weeping tears of a soldier on a military campaign.."
  },
  {
    "poem": "紛紛墮葉飄香砌，夜寂靜，寒聲碎。真珠簾捲玉樓空，天淡銀河垂地。年年今夜，月華如練，長是人千里。愁腸已斷無由醉，酒未到，先成淚。殘燈明滅枕頭欹，諳盡孤眠滋味。都來此事，眉間心上，無計相迴避。",
    "translate": "Fallen leaves desultorily drift over pot plants lined stairs, The night is still, bar a few murmurings of insects. I roll up the beaded screens to admire the azure dome, Clear is the sky, the Milky Way casts its shine towards the ground like drapes. Every year this time, the moon beams smoothly like silk, Yet thousands of miles away is the object of my affections.Already rent is my heart, I cannot be more intoxicated, Before I could further drink up, I've already more tears shed. Lying askew is a pillow by the gleam of a dimming lamp, How familiar I am with what it's like to in loneliness sleep and dwell. So often reminded of this I am, it weighs on my mind and brows, Yet there is nothing I can do to it fend.."
  },
  {
    "poem": "數聲鶗鴂，又報芳菲歇。惜春更選殘紅折，雨輕風色暴，梅子青時節。永豐柳，無人盡日花飛雪。莫把幺弦撥，怨極弦能說。天不老，情難絕，心似雙絲網，中有千千結。夜過也，東窗未白孤燈滅。",
    "translate": "There rise chirps of cuckoos, again they have come to call blossoms' end. To seize spring, I longingly pick flowers' colourful remains.Sudden rains and stormy winds the season of green plums commence.Over the Yongfeng grounds, there's no one but drifting catkins all day.Stroke not even a string, for it can such reticent bitterness express. Unless the heavens mortal becomes, my love will never be laid to rest, My heart is a cobweb doubled over, tied and knotted with a million frets. The night is nearly over, the lamp has burnt out, the day hasn't broken yet.."
  },
  {
    "poem": "哀箏一弄湘江曲，聲聲寫盡湘波綠。纖指十三弦，細將幽恨傳。當筵秋水慢，玉柱斜飛雁。彈到斷腸時，春山眉黛低。",
    "translate": "A Xiang River melody comes from a zither played plaintively, Its every note depicts every green river ripple of Xiang expressively. Slender fingers over thirteen strings Stroke and pluck her deep lament delicately.During the banquet, her eyes languors show, The zither neck placed at a slant the manner of dashing geese imitate. When her play comes to a segment that is most mournful, Her brows are like mountains in spring overcast with clouds that hang low.."
  },
  {
    "poem": "雙蝶繡羅裙，東池宴、初相見。朱粉不深勻，閒花淡淡春。細看諸處好，人人道、柳腰身。昨日亂山昏，來時衣上雲。",
    "translate": "Embroidered with a pair of butterflies was her dress, It was at a banquet by the East Pond, when we first met. With only a lightly powdered and rouged face, She was a flower at ease in spring, delicate and dainty.Everything about her on close looks was fair. Everyone spoke praise of her willowy waist. Yesterday she seemed like someone from uninhabited hills at sunset, Tinged all over with vivid clouds as she came.."
  },
  {
    "poem": "傷高懷遠幾時窮？無物似情濃。離愁正引千絲亂，更東陌，飛絮濛濛。嘶騎漸遙，征塵不斷，何處認郎蹤？雙鴛池沼水溶溶，南北小橈通。梯橫畫閣黃昏後，又還是，斜月簾櫳。沈恨細思，不如桃杏，猶解嫁東風。",
    "translate": "When could I not be saddened by heights and yearn for the distant no more?There is nothing as intense as love. Parting sorrows perturb me like thousands of intertwining willows, In the fields further east, catkins drizzle and mizzle creating a haze. The sound of horse galloping distant becomes, unsettled is the dust they've raised, Yet where could I find prints to your whereabouts trace?The waters ripple and riffle in the Mandarin Duck Pond, To cross between its north and south there is only a canoe and oars. After sunset I pull up the rope ladder of the waterside pavilion, What follows is the moon at an angle shining through screened windows. On deep regrets I ponder and dwell, unlike blossoms of peach and apricot trees, Which are free to easterlies engage as they drift towards their release.."
  },
  {
    "poem": "水調數聲持酒聽，午醉醒來愁未醒。送春春去幾時回？臨晚鏡，傷流景，往事後期空記省。沙上並禽池上暝，雲破月來花弄影。重重簾幕密遮燈，風不定，人初靜，明日落紅應滿徑。",
    "translate": "With a chalice in hand, I listen to the tune of the Water Melody, I've recovered from afternoon's tipsiness, though I'm still steeped in melancholy. I've seen off spring, when shall return spring that has gone? I look into the mirror at night, how the lost of time evokes sentimentality. In vain I recall the bygone days that is now no more than history.On the sand stand a pair of gulls next to the darkened lake, The moon breaks through clouds as flowers sway to shadows play. Layers of curtains and drapes closely the lamp veil, In the gusty wind, others have begun to quiet down, Tomorrow shall see fallen petals this entire path pave.."
  },
  {
    "poem": "乍暖還輕冷，風雨晚來方定。庭軒寂寞近清明，殘花中酒，又是去年病。樓頭畫角風吹醒，入夜重門靜。那堪更被明月，隔牆送過鞦韆影。",
    "translate": "The weather is such that a moment's warmth could suddenly a slight chill become, Then comes evening before the wind and rain come to a stop. Quiet and empty is the courtyard, drawing near is the vernal equinox, Here I am drinking among remnants of blossoms, With the same sentimental malaise from last year I am struck.Sobering is the sound of bugles blaring from the watch tower carried by the wind, Deep into the night locked behind gates and doors is stillness. Unbearable is what the bright moon conveys Through the wall, the shadow of a swing.."
  },
  {
    "poem": "含羞整翠鬟，得意頻相顧。雁柱十三絃，一一春鶯語。嬌雲容易飛，夢斷知何處。深院鎖黃昏，陣陣芭蕉雨。",
    "translate": "Bashfully she adjusts her jadeite hair-knot jewellery, Yet she eyes her patron time and again when she pleases. The slanted zither neck akin to dashing geese and its thirteen strings Note after note portray orioles' warble and tweets.Charming clouds vanish easily, Leaving no trace severing dreams. A closely enclosed courtyard locks in dusk, As showers shower on plantain leaves.."
  },
  {
    "poem": "一曲新詞酒一杯，去年天氣舊池臺，夕陽西下幾時回？無可奈何花落去，似曾相識燕歸來，小園香徑獨徘徊。",
    "translate": "As I new verses compose to a melody with spirits in a grail, By the lagoon the terrace is the same as before in last year's weather, Who could turn around the sun that has set in the west?Powerless are flowers that must wither and fall, It's time for the return of swallows that I seem to have met before, Alone I am in the garden pacing paths lined with fallen petals.."
  },
  {
    "poem": "一向年光有限身，等閒離別易消魂，酒筵歌席莫辭頻。滿目山河空念遠，落花風雨更傷春，不如憐取眼前人。",
    "translate": "Moments flash, even years would one day draw to a close, When common partings can easily sadness evoke, Decline not frequent banquets and singing events.Gathering views of the landscape reminds me of distance places, In the rain windswept flowers drift, leaving me to ponder the passing of spring even more, Why not the notion of holding dear those close by follow.."
  },
  {
    "poem": "紅箋小字，說盡平生意，鴻雁在雲魚在水，惆悵此情難寄。斜陽獨倚西樓，遙山恰對簾鉤。人面不知何處，綠波依舊東流。",
    "translate": "On a crimson note of small calligraphic writing, Expressive are aspirations and emotions of mine, Fish through waters swim while long distance travelling geese among clouds fly, Yet hard to deliver are my melancholy sentiments at this time.As the sun inclines, in the west chamber I recline in solitude, Looking at the silhouette of distant hills between gathered curtains held by hooks. I know not the whereabouts of the countenance of my desire, Yet continuing to flow eastwards are green ripples as usual.."
  },
  {
    "poem": "金風細細，葉葉梧桐墜。綠酒初嘗人易醉，一枕小窗濃睡。紫薇朱槿花殘，斜陽卻照闌干。雙燕欲歸時節，銀屏昨夜微寒。",
    "translate": "Autumnal winds soughingly sough, Leaf by leaf phoenix trees its foliage drop. A light savour of fermented barely wine can easily intoxicate, Resting my head by a window I fall into a deep slumber.Purple rosebushes and red roses of Sharon shrivel and wilt, The setting sun on balustrades shines still. The season has come for paired swallows to make their return, Last night behind the silvery screen I felt a slight chill.."
  },
  {
    "poem": "池塘水綠風微暖，記得玉真初見面。重頭歌韻響琤琮，入破舞腰紅亂旋。玉鉤闌下香階畔，醉後不知斜日晚。當時共我賞花人，點檢如今無一半。",
    "translate": "The pond water is green and the breeze light and genial, They remind me of the first time I saw her face. Her singing of the Repetition was like the ringing of jade, Her dance to the Cleaving symphony whirled petals around her waist.Outside the raised delicate curtains, below the balustrade by the stairs, Drunk I am, unaware that the sun has set and the time is late. Of those that I admired the blossoms with, Only fewer than half still alive remain.."
  },
  {
    "poem": "燕鴻過後鶯歸去，細算浮生千萬緒。長於春夢幾多時，散似秋雲無覓處。聞琴解佩神仙侶，挽斷羅衣留不住。勸君莫作獨醒人，爛醉花間應有數。",
    "translate": "Once swallows and wild geese have dashed off, orioles would flit away, Reminiscences of a lifetime give rise to millions of sentiments. Life is a like a vernal dream, yet how long lasts it? Once gone, it is nowhere to be found, like autumn clouds it fades.I think of romantic couples who serenaded or pledged with jade, Whose romance could not be redeemed even at the expense of extreme lament. Be not a sober loner I say, What is best is being among blossoms and staying intoxicated.."
  },
  {
    "poem": "綠楊芳草長亭路，年少拋人容易去。樓頭殘夢五更鐘，花底離愁三月雨。無情不似多情苦，一寸還成千萬縷。天涯地角有窮時，只有相思無盡處。",
    "translate": "Green willows and fragrant grasses lined the gallery where we parted ways, How easily youth takes its leave while I remain. High up on a building I face the wee hours with shattered dreams, Under blossoms suffuse parting sorrows in the form of March drizzling rain.The heartless seem to suffer less than the passionate, Whose every inch of craving would million strands of melancholy create. Even the sky and the earth have their limits, Only lovers' yearning would linger on and never break.."
  },
  {
    "poem": "祖席離歌，長亭別宴，香塵已隔猶回面。居人匹馬映林嘶，行人去棹依波轉。畫閣魂消，高樓目斷，斜陽只送平波遠。無窮無盡是離愁，天涯地角尋思徧。",
    "translate": "A farewell song was sung, on a gallery a parting banquet took place, As I looked back, dust with a flowery air had already us separated. Among the woods she stood, her horse neighed, Off I rowed following the turn of waves.Depressed is my soul in an ornate pavilion up on high, still severed is my gaze. There is only sunset sending off ripples far and away. Perpetual and pervasive without end is my parting sorrow, As expansive as the sky and the earth is my yearning that pervades.."
  },
  {
    "poem": "小徑紅稀，芳郊綠徧，高臺樹色陰陰見。春風不解禁楊花，濛濛亂撲行人面。翠葉藏鶯，朱簾隔燕，爐香靜逐游絲轉。一場愁夢酒醒時，斜陽卻照深深院。",
    "translate": "Along the path flowers are thinning, the countryside is fields of green, Next to raised buildings becoming thick is the foliage dense with leaves. Vernal breezes know not how to catkins restrain, Allowing them to scatter on faces of passers-by like misty mizzle.Behind verdant leaves orioles hide, swallows rest outside crimson screens, Over the incense burner curls of smoke one another quietly seek. After I have slept off intoxication in a melancholy dream, The private court has come well under sunset's gleams.."
  },
  {
    "poem": "碧海無波，瑤臺有路，思量便合雙飛去。當時輕別意中人，山長水遠知何處。綺席凝塵，香閨掩霧，紅牋小字憑誰附。高樓目盡欲黃昏，梧桐葉上蕭蕭雨。",
    "translate": "On the sea aquamarine with no billows there is a path to the celestial terrace, We should be able to there fly towards as a pair if our hearts so wish. Once I left behind rashly the object of my affections, Now being mountains and waters apart I know not where she is.A dusty, delicately woven mat remains in the bed chamber lightly veiled by mist, On whom could I rely to bring you a crimson note in small script? On a tall building I look into the distance and see the day drawing to a close, As a whistling drizzle rustles the leafage of phoenix trees.."
  },
  {
    "poem": "六曲闌干偎碧樹，楊柳風輕，展盡黃金縷。誰把鈿箏移玉柱，穿簾海燕雙飛去。滿眼游絲兼落絮，紅杏開時，一霎清明雨。濃睡覺來鶯亂語，驚殘好夢無尋處。",
    "translate": "Next to groves of trees wind labyrinthine balustrades, In the breeze willows their golden strands spread. Who can tune up the strings along the jadeite zither neck?Off flit a pair of petrels through the drapes.Before my eyes catkins fall and willow sprigs sway, Apricot trees blooming red and a spell of drizzle the vernal equinox manifest. From a deep slumber I wake as orioles tweets and chirps make, Startling and shattering sweet dreams that I know not where to locate.."
  },
  {
    "poem": "鎖離愁，連綿無際，來時陌上初熏，繡幃人念遠，暗垂珠露泣，送征輪。長行長在眼，更重重、遠水孤雲。但望極、樓高盡日，目斷王孫。消魂，池塘從別後，曾行處、綠妒輕裙。恁時攜素手，亂花飛絮裏，緩步香茵。朱顏空自改，向年年、芳意長新。徧綠野、嬉游醉眼，莫負青春。",
    "translate": "Enshrouded in parting sorrows, immense and infinite, Nearby fields and paths begin to melancholy appear, Through the embroidered screen I stare at the faraway, I cry silent tears as I see off your wheels off on a long march. Far you have gone, though I still hope to the sight of you gather, Yet among remote waters and lonely clouds, many obstructions exist. Staring into the distance, on a tower I linger till day's end, Not seen is any sight of you nonetheless.Saddened is my spirit since our parting by the pond, Along where we used to walk, the verdure my soft dress envy. How we used to hold hands then, Amid drifting petals and catkins, stroll on fragrant grass we did. My visage has since aged little by little, Yet year after year, fresh are blossoms that bloom before me. All over fields that are green roam intoxicated tourists, May they know not to fritter away youth and spring.."
  },
  {
    "poem": "東城漸覺風光好，縠皺波紋迎客棹。綠楊煙外曉雲輕，紅杏枝頭春意鬧。浮生長恨歡娛少，肯愛千金輕一笑？為君持酒勸斜陽，且向花間留晚照。",
    "translate": "By the day East Town's scenery brightens, Rippling waters like wrinkled silk travellers' boats invite. Over green willows veiled by mist float morning clouds, Apricot trees with red blossoms bustle with vernal vitality.There is little joy but ever more regrets in life, Who would in order to save a thousand pounds of gold forsake a lady's smile ? Allow me to raise your chalice for you to hold on to sunset, So that it could leave among flowers more twilight.."
  },
  {
    "poem": "群芳過後西湖好，狼籍殘紅，飛絮濛濛，垂柳闌干盡日風。笙歌散盡游人去，始覺春空，垂下簾櫳，雙燕歸來細雨中。",
    "translate": "After the season of bloom the West Lake shows its best, Petals fall in disarray, flitting catkins float, And willows hanging over balustrades waver in the wind all day long.Instruments and singing come to a lull, guests scatter, I begin to feel the absence of spring, so I let down the screen over the window, In the drizzle return a pair of swallows.."
  },
  {
    "poem": "清晨簾幕捲輕霜，呵手試梅妝。都緣自有離恨，故畫作、遠山長。思往事，惜流芳，易成傷。擬歌先斂，欲笑還顰，最斷人腸。",
    "translate": "Raising of the curtains in the morning also light frost lifted away, I warmed my hands to try on her the plum make-up. Feeling surrounded in sorrows of parting, The brows I drew were long like mountain ranges.Recollecting bygones and bemoaning loss of time predispose me to suffer pain.Before she sang she'd prepare herself, when she smile her brows close remain, Most heart-rending is when I these retrace.."
  },
  {
    "poem": "候館梅殘，溪橋柳細，草薰風暖搖征轡。離愁漸遠漸無窮，迢迢不斷如春水。寸寸柔腸，盈盈粉淚，樓高莫近危闌倚。平蕪盡處是春山，行人更在春山外。",
    "translate": "Around the high-rise plum blossoms wither, by the bridge tender willows thrive, The fragrance of grass wafts across in warm breezes wavering marching riders. The further I move on the more my parting grief grows and infinite becomes, Like vernal waters it springs endlessly spreading far and wide.With inches of rent heart and tear-filled eyes, Lean not against balustrades of tall buildings to overlook the height. At the end of the grassland lie mountains in spring, Beyond the vernal mountains, those who saw me off remain far behind.."
  },
  {
    "poem": "庭院深深深幾許？楊柳堆煙，簾幕無重數。玉勒雕鞍游冶處，樓高不見章臺路。雨橫風狂三月暮，門掩黃昏，無計留春住。淚眼問花花不語，亂紅飛過鞦韆去。",
    "translate": "How deep is the inner garden that is deep? Shrouded in smoky mist are willows, as if filtered by many a screen. On a horse with a rein set with jade and a sculpted bridle I saunter, Many buildings soar yet no longer existent is the Terrace of the Seal.Stormy is the wind and rain of this March evening, Doors close in the remains of the day, yet there's no way to hold on to spring. With my teary eyes I appeal to blossoms, yet they silence keep, Stirred are their petals that drift across swings.."
  },
  {
    "poem": "誰道閒情拋棄久？每到春來，惆悵還依舊。日日花前常病酒，不辭鏡裏朱顏瘦。河畔青蕪堤上柳，為問新愁，何事年年有？獨立小橋風滿袖，平林新月人歸後。",
    "translate": "Says who that love could be forgone for long? Every spring comes to find me as sorrowful and regretful as before. Day after day I drink till I'm drunk before blossoms, The mirror shows me losing flesh yet I care no more.Willows by the levees and grassland by the river, What say you of melancholy that comes year after year? Standing on a small bridge with the breeze filling my sleeves I ponder, Over woods on a flatland rises a new moon as I make my return.."
  },
  {
    "poem": "幾日行雲何處去？忘了歸來，不道春將暮。百草千花寒食路，香車繫在誰家樹？淚眼倚樓頻獨語，雙燕來時，陌上相逢否？撩亂春愁如柳絮，依依夢裏無尋處。",
    "translate": "For days I've been drifting like fleeting clouds, yet where have I reached? Forgetting to home return, I'm about to see the end of spring. On the day of Cold Fare, verdure and flowers of various kinds line the streets, Where can I find her fragrant coach, tied to whose tree?With teary eyes I think aloud leaning over the building, When swallows return in pairs, have they seen her in the field? Astir is the melancholy of spring like willow catkins, Elusive are the lingering feelings that evade even dreams.."
  },
  {
    "poem": "別後不知君遠近，觸目淒涼多少悶！漸行漸遠漸無書，水闊魚沉何處問？夜深風竹敲秋韻，萬葉千聲皆是恨。故欹單枕夢中尋，夢又不成燈又燼。",
    "translate": "Since parting I know not where you've been, I see dreariness wherever I cast my eyes and ever so melancholy I feel! The further you go the more distant we become till there's no correspondence. Waters are wide and fish plunge deep, where am I to your whereabouts seek?Winds through bamboo thickets in the deep of the night an autumn rhythm beat, Note after note sounding regretful is the rustle of millions of leaves. Lying on a lone pillow I wilfully dream to your presence seek, Till lights cinders become, yet not a hint of a dream comes to me."
  },
  {
    "poem": "柳外輕雷池上雨，雨聲滴碎荷聲。小樓西角斷虹明。闌干私倚處，待得月華生。燕子飛來窺畫棟，玉鉤垂下簾旌。涼波不動簟紋平。水精雙枕畔，傍有墮釵橫。",
    "translate": "Beyond the foliage of willows claps soft thunder, over the pool falls rain, Drips and drops of rain on lotus leaves sound create. A rainbow hangs to the west of this place. By the balustrade I lean, Waiting for the moon to shine and height gain.Here come swallows scouting about columns and beams that are decorated, So I lower the curtains by letting loose hooks made of jade. The pattern on the flat bamboo mat glistens like cool water waves. By the pair of glass pillows, Lie a hairpin on its side mislaid.."
  },
  {
    "poem": "隄上游人逐畫船，拍隄春水四垂天，綠楊樓外出鞦韆。白髮戴花君莫笑，六么催拍盞頻傳，人生何處似尊前。",
    "translate": "Tourists by the banks ornate boats in the water follow, Against the banks lap spring waters that seem to overflow from the sky, From the buildings by the green willows swings often sway over wall height.Laugh not at the grey-haired with flowers pinned to their locks, The cadence of music is hurrying the passing of cups of alcohol, There's no better place than being in front of drinks in life.."
  },
  {
    "poem": "把酒祝東風，且共從容。垂楊紫陌洛城東，總是當時攜手處，游遍芳叢。聚散苦悤悤，此恨無窮。今年花勝去年紅，可惜明年花更好，知與誰同？",
    "translate": "I raise my wine in honour of easterlies, why don't you linger in my company? Under drooping willows and along paths lined with violets east of Luoyang, We used to hold hands everywhere, As we strolled past all flower thickets and tussocks.People gather and scatter, reunions are always bitterly brief, forever leaving regrets. This year's blossoms surpass last year's in brightness, Though next year's may be even brighter still, Who knows whose company I'd be in?."
  },
  {
    "poem": "一年春事都來幾？早過了、三之二。綠暗紅嫣渾可事，綠楊庭院，暖風簾幕，有箇人憔悴。買花載酒長安市，又爭似、家山見桃李？不枉東風吹客淚，相思難表，夢魂無據，惟有歸來是。",
    "translate": "How long is spring in the space of a year? Already been and gone has two thirds of it. Viridian foliage and crimson blossoms are ever so pleasing, Deep in the garden sway green willows, screens warm breezes filter Yet within withdraws someone pallid and thin.Flowers and wine are bought from Changan's markets, Yet how could they compare to peach and plum blossoms of home? Blame not easterlies for blowing away my sorrowful tears, For hard to express are yearnings and impossible to seize are dreams, To make it better there is only homecoming.."
  },
  {
    "poem": "想人生，美景良辰堪惜。向其間、賞心樂事，古來難是并得。況東城、鳳臺沁苑，泛晴波、淺照金碧。露洗華桐，煙霏絲柳，綠陰搖曳，蕩春一色。畫堂迴、玉簪瓊佩，高會盡詞客。清歌久、重然絳蠟，別就瑤席。有翩若驚鴻體態，暮為行雨標格。逞朱脣、緩歌妖麗，似聽流鶯亂花隔。慢舞縈回，嬌鬟低嚲，腰肢纖細困無力。忍分散、彩雲歸後，何處更尋覓。休辭醉、明月好花，莫慢輕擲。",
    "translate": "Beautiful scenery and glorious days are to be cherished in life. Among them, delightful matters and pleasant events Are hard to come by side by side. In the town's east, there are the Phoenix Terrace and the Soothing Garden, Extensive is the clear, green waters, reflecting golden sunshine. Flowering phoenix trees are dipped in dew, ribbons of willows flutter in mist, Their foliage and leafage sway, picturesque is a sweeping scene of springtime. Within the ornate hall, ladies are adorned with jade hairpins and ornaments, Attending to well-versed guests for a good time. Operatic singing persists till it is time to red candles light, Moving on to yet another banquet to wine and dine.Of those present, there are agile figures with swift motion, Whose poise seem particularly flowing like rain at night. As their cherry lips move, their mild singing stun all, It's like the sound of orioles warbling through where blossoms thrive. Smooth are their curves and dance moves, down hang soft tresses coiled at top, Thin is the waist that is charming and feeble-like. How unbearable parting is, when colourful clouds pass, Where can they be found? Decline not an invite to inebriated become, for brilliant are the moon and blooms, Neglect not fine occasions and waste not time.."
  },
  {
    "poem": "隴首雲飛，江邊日晚，煙波滿目憑闌久。一望關河蕭索，千里清秋，忍凝眸。 杳杳神京，盈盈仙子，別來錦字終難偶。斷雁無憑，冉冉飛下汀洲，思悠悠。暗想當初，有多少、幽歡佳會；豈知聚散難期，翻成雨恨雲愁。阻追游，每登山臨水，惹起平生心事，一場消黯，永日無言，卻下層樓。",
    "translate": "Over the hilltop clouds float, by the river the sun sets, Misty waters ripple before my eyes as I long against the balustrade lean. Panoramic is the view yet bleak is the landscape, There falls a thousands miles of high autumn that I cannot bear to see. Distant and out of sight are the immortal palace and my faerie beauty, Since parting, no reply to my billet-doux has been received. A straying wild goose without company Slowly comes flitting down on an islet to reflect as it lingers.I recall to myself the bygone days, How we had many rendezvous, some undisturbed, others gleeful; How we didn't know how unmanageable vicissitudes of life are, Trials and hardships soon turn to regrets and melancholy. Frustrated is my course of travelling, whenever along rivers and up on mountains, Bothered is the mind over a lifetime's feelings, All have turned into misery, all day long I silence keep, Down the stairs I make my retreat.."
  },
  {
    "poem": "寒蟬淒切，對長亭晚，驟雨初歇。都門帳飲無緒，方留戀處、蘭舟催發。執手相看淚眼，竟無語凝噎。念去去、千里煙波，暮靄沉沉楚天闊。多情自古傷離別，更那堪、冷落清秋節！今宵酒醒何處？楊柳岸、曉風殘月。此去經年，應是良辰，好景虛設。便縱有千種風情，更與何人說？",
    "translate": "I listen to cicadas singing dolefully in the cold from across the gallery at dusk, The sudden rain has just come to a halt. She puts out a farewell toast outside a capital gate, yet dejected is the mood, While I wish to linger, ready to row off is the magnolia canoe. Holding hands, we look into each other's teary eyes, Yet unable to words utter, on emotions we choke. As I think of the flow of misty waters that undulate for thousands of miles, Leaden is the evening clouds that occupy the vast southern skies.As always the romantic fear adieu the most, How especially so in this dismal fall! Where will I be when I recover from insobriety tonight? Perhaps somewhere along a willowy bank, in a breeze under a waning moon. This time for years I'll be gone, What should be brilliant days and beautiful scenery shall be of little use. Even though I may possess inexhaustible passion, Whom have I to offer it to?."
  },
  {
    "poem": "竚倚危樓風細細，望極春愁，黯黯生天際。草色煙光殘照裏，無言誰會憑闌意？擬把疏狂圖一醉，對酒當歌，強樂還無味。衣帶漸寬終不悔，為伊消得人憔悴。",
    "translate": "Long I stand on a high-rise in the gentle breeze, Saddened is spring everywhere I see, the sky is vast yet overcast, all round is bleak. In the remains of the day, in the hazy light the green of grass dims, Against a rail I lean, yet who can through my quiescence my melancholy read.I'd rather pretend to be a giddy eccentric looking to get tipsy, When there is wine, singing follows, yet bland would be such imposed recreation. Becoming loose are my clothes yet I regret not, For I languish and suffer for her willingly.."
  },
  {
    "poem": "月華收，雲淡霜天曙。西征客、此時情苦。翠娥執手，送臨歧、軋軋開朱戶。千嬌面、盈盈竚立，無言有淚，斷腸爭忍回顧？一葉蘭舟，便恁急槳凌波去。貪行色、豈知離緒，萬般方寸，但飲恨、脈脈同誰語？更回首、重城不見，寒江天外，隱隱兩三煙樹。",
    "translate": "Moonlight has faded, pale are clouds in the frosty sky of dawn. Travellers heading west must be feeling the hardship. Her delicate hand mine holds, To see me off to the main road, she opens the squeaky crimson door. She with her charming face stands at the roadside, In teary reticence, how could I bare to look back with a broken heart?A small canoe let the oars rush it to waves cleave through, Seemingly voracious for the scenery on the road, yet the parting gloom Has caused a million thoughts to entangle, Yet as I wallow in regrets, to whom could I open my heart to? When I do look back, gone are the towers of the town, Beyond the cold waters and skies, only a few trees are visible in the brume.."
  },
  {
    "poem": "夢覺、透窗風一線，寒燈吹息。那堪酒醒，又聞空階，夜雨頻滴。嗟因循、久作天涯客。負佳人、幾許盟言，便忍把、從前歡會，陡頓翻成憂戚。愁極，再三追思，洞房深處，幾度飲散歌闌，香暖鴛鴦被。豈暫時疏散，費伊心力，殢雲尤雨，有萬般千種，相憐相惜。 恰到如今，天長漏永，無端自家疏隔。知何時、卻擁秦雲態？願低幃昵枕，輕輕細說與，江鄉夜夜，數寒更思憶。",
    "translate": "From dreams I wake up to a hint of wind through the window, Putting out the light that has grown cold. I cannot bear to be sober, And listen to the sound from the terrace, where drips nocturnal rain. Unable to take heart, I've long been a wandering rover. I disappointed her and left her with unfulfilled expectations and promises, Unbearable is the thought of her turning our joyful encounters All at once into sorrows and woes.Immensely grieved I am, over and again I recall the bygone days, So many things that took place in the depth of our bedchamber, Time and again we drank till it was late and sang by the balustrades, Warm and fragrant was the quilt made for twain. When we had to briefly separate, it would cause her heartache, Deep was our love and strong our passion, We each other cared for and cherished. Nowadays, nights have become ever so long, Why did I our separation cause? When will it be, when I could a passionate life possess again? When I would stoop to enter behind bedchamber drapes to her pillow share, And whisper in her ear, How night after night everywhere I went, I'd yearn for her as I, in the chill, the night watches anticipated.."
  },
  {
    "poem": "自春來、慘綠愁紅，芳心是事可可。日上花梢，鶯穿柳帶，猶壓香衾臥。暖酥消、膩雲嚲、終日厭厭倦梳裹。無那。恨薄情一去，音書無箇。早知恁般麼，悔當初、不把雕鞍鎖。向雞窗，只與蠻箋象管，拘束教吟課。鎮相隨、莫拋躲，針線閒拈伴伊坐。和我，免使年少，光陰虛過。",
    "translate": "Since the arrival of spring, pathetic seems the green and saddened the red, I've been absent-minded and vague. The sun has risen to flower tips shine on, as orioles dash between willows, Yet I am still lying in bed enwrapped in a fragrant quilt. Worn off is my powdered face, loose are my smooth tresses, All day in languor I remain, unable to my hair comb out and dress up. Helpless I feel.  I despise the heartless who once left hasn't send an epistle.Had I known it would be like this, To regrets avoid, I would have placed a lock on that bridle of his. I'd by the window of his study, with ivory-barrel pens on Sichuan paper. Have him teach me how to poems recite and write. I would stay by his side, and never his company avoid or cast aside, I would pick up needlecraft as I sit by him. He would be with me, and I wouldn't waste youthful days and my prime.."
  },
  {
    "poem": "長安古道馬遲遲，高柳亂蟬嘶。夕陽島外，秋風原上，目斷四天垂。歸雲一去無蹤迹，何處是前期？狎興生疏，酒徒蕭索，不似去年時。",
    "translate": "On this old Changan boulevard, on a horse we amble, Through the lofty willows stirs the rumpus of cicadas. The setting sun inclines away from the isle, as autumn winds blow across plains, Over the four corners of the sky in sight the curtain of night hangs.Gone are the clouds that leaves no trace, From here on, when shall we meet again? Absent is the spirit for sightseeing, and lacking are drinking partners, As opposed to last year this time, it is just not the same.."
  },
  {
    "poem": "晚秋天，一霎微雨灑庭軒。檻菊蕭疏，井梧零亂，惹殘煙。淒然，望江關，飛雲黯淡夕陽閒。當時宋玉悲感，向此臨水與登山。遠道迢遞，行人淒楚，倦聽隴水潺湲。正蟬吟敗葉，蛩響衰草，相應喧喧。孤館度日如年，風露漸變，悄悄至更闌。長天淨，絳河清淺，皓月嬋娟。思緜緜，夜永對景，那堪屈指，暗想從前。未名未祿，綺陌紅樓，往往經歲遷延。帝里風光好，當年少日，暮宴朝歡。況有狂朋怪侶，遇當歌對酒競留連。別來迅景如梭，舊游似夢，煙水程何限？念利名、憔悴長縈絆，追往事、空慘愁顏。漏箭移，稍覺輕寒、漸嗚咽、畫角數聲殘。對閒窗畔，停燈向曉，抱影無眠。",
    "translate": "In this late autumn weather, a shower falls in the courtyard, Sparse become the chrysanthemums by the balustrade, Rumpled is the foliage of the phoenix tree by the well, Behind it rise remnants of smoke. Feeling sad, looking around the riverside fortress, The colours of fleeting clouds are growing dim at sunset. In those days Song Yu must similar griefs share, As he visited the same waters and the same mountain scaled. Being far and out of the way, travellers miserable feel, Growing tired of the gurgle and murmur of rivers and creeks. Right in the season of cicadas singing among falling leaves, Autumn crickets hum in wilting grass to one another resonate.For a solitary traveller a day feels year-long, Gradually the wind and dew appear, silence deepens like the night. The sky is clear, the Milky Way lucid, and the moon bright and beautiful. My thoughts drift far far away, as I stare at my shadow all night, How could I bear to recount the bygones in my mind. Having no fame nor fortune, I linger among charming red lights, Year after year time tends to just pass me by.Great is the scenery of the imperial region, In my youthful days, frequent were banquet nights and merry times. Not to mention the presence of eccentric and boisterous friends, Who'd drinking and singing compete urging one another to stay. In a flash dashes time, What I've experienced seems a dream, how can I misty waters navigate? Obsession with fame and gain drives one to become pallid and thin, Consumed by bygones leaves one to feel more pathetic and depressed. Tonight arrive in the speed of arrows, A chill sets in, then comes whimpers of blaring horn that linger on. By the window I sit idly, I put out the lamp awaiting dawn, In wakefulness I my own shadow embrace.."
  },
  {
    "poem": "凍雲黯淡天氣，扁舟一葉，乘興離江渚。度萬壑千巖，越溪深處。怒濤漸息，樵風乍起，更聞商旅相呼。片帆高舉，泛畫鷁、翩翩過南浦。望中酒旆閃閃，一簇煙村，數行霜樹。殘日下、漁人鳴榔歸去。敗荷零落，衰楊掩映。岸邊兩兩三三，浣紗游女，避行客、含羞笑相語。到此因念，繡閣輕拋，浪萍難駐。歎後約、叮嚀竟何據？慘離懷、空恨歲晚歸期阻。凝淚眼、杳杳神京路，斷鴻聲遠長天暮。",
    "translate": "In the bleak weather that clouds freeze, On a boat, small as a leaf, I left the pier while high are my spirits. I sail by myriads of valleys and cliffs and came to the headwaters of the creek.Surging waves have come to rest, from woods waft breezes, I also hear the bustle of travellers and shopkeepers. I hoist the sail high, taking ship, Swiftly I cruise by a southern town dock.In sight are fluttering flags of wine shops, From a village cluster rise stalks of smoke, frosting rows of trees. In the remains of the day, fishermen knock on billets heading home. Withered and fallen lotuses scatter, yellowing willows their own reflections veil. By the creekside, in twos and threes, Return silk washing maidens, shunning travellers like me, Yet they smilingly chat among themselves sheepishly.At this time, I'm reminded of the lady I once left behind, And I've since been drifting like duckweed. What of past promises and counsel provided? Filled with parting sorrows, the ending of a year my homecoming hinder. Filled with tears are my eyes, looking towards the distant capital of our empire, There are only stray wild geese and their cries across the twilight sky.."
  },
  {
    "poem": "望處雨收雲斷，憑闌悄悄，目送秋光。晚景蕭疏，堪動宋玉悲涼。水風輕、蘋花漸老；月露冷、梧葉飄黃。遣情傷，故人何在？煙水茫茫。難忘。文期酒會，幾孤風月，屢變星霜。海闊山遙，未知何處是瀟湘？念雙燕、難憑音信；指暮天、空識歸航。黯相望、斷鴻聲裏，立盡斜陽。",
    "translate": "In sight the rain has stopped and clouds have parted, Quietly against the balustrade I lean, seeing off autumn scenes. In twilight bleak is the landscape, Dreary enough to add to Song Yu's grief. Light breezes skim across the water as duckweeds yellow; Under the moon dew forms in the cold as phoenix trees shed their golden leaves. I'd like to sorrows dismiss, yet where is she now?Boundless and infinite is the misty waters before me.Unforgettable were the times. Since those poetic and tasteful rendezvous, I spent years bracing the winds of change, transits of the moon and frosty stars. Separated by vast seas and dividing ranges, Where do the waters of Xiao and Xiang come together? I guess paired swallows can't be relied on to tidings deliver,  For in a dusky sky, hard to recognise is a homing path. Swamped in emotions I am, listening to the cries of wild geese that linger, I stand through the twilight hours.."
  },
  {
    "poem": "對瀟瀟暮雨灑江天，一番洗清秋。漸霜風淒緊，關河冷落，殘照當樓。是處紅衰翠減，苒苒物華休。惟有長江水，無語東流。不忍登高臨遠，望故鄉渺邈，歸思難收。歎年來蹤迹，何事苦淹留？想佳人、妝樓凝望，誤幾回、天際識歸舟？爭知我、倚闌干處，正恁凝愁？",
    "translate": "From the sky falls a shower scattering over the river, Giving autumn a rinse washing it plain. A bitter frosty wind gradually intensifies, In cold silence lies the landscape, through buildings shines the remains of the day. Here dwindle blossoms and off falls foliage, Little by little fades charming scenery. There leaves only the waters of the Yangtze to tacitly eastwards make its way.I can hardly bear to height climb and gaze at the distant, Far and remote is my homeland, homesickness is becoming hard to reign. As I grow sentimental pondering over my wayfaring years, I wonder what has made me reluctant to leave this place. I picture her looking out from her chamber, Mistaking for my return many times boats in the skyscape. How could she ever know that I am here leaning against the balustrade And mooning over her very self?."
  },
  {
    "poem": "一葉扁舟輕帆捲，暫泊楚江南岸。孤城暮角，引胡笳怨。水茫茫，平沙雁，旋驚散。煙斂寒林簇，畫屏展，天際遙山小，黛眉淺。舊賞輕拋，到此成游宦。覺客程勞，年光晚。異鄉風物，忍蕭索、當愁眼。帝城賒，秦樓阻，旅魂亂。芳草連空闊，殘照滿，佳人無消息，斷雲遠。",
    "translate": "I furl the sail of my boat that is only little, To moor by the southern shore of this southern river. In the solitary town in twilight laments a reed leaf whistle. By the misty waters, wild geese on sands gather and hover, when startled they flit. As the brume thins wintry woods appear that unfolds like a picturesque screen, Distant mountains miniatures become in the shape of dark brows drawn thinly.Readily cast aside are past pleasures, I arrive in the shape of an exiled officer. Feeling travellers' long-distance toil, I must be advanced in years. The landscape and scenery of a foreign place Present loneliness that I must bear as I've come to eye them with melancholy. Out of bounds are the capital and grand architecture, grieving a travelling soul. Grasslands spread towards the vast sky, basking in the glow of evening, Of my fair lady I've received no news, after all parted clouds far and apart drift.."
  },
  {
    "poem": "登孤壘荒涼，危亭曠望，靜臨煙渚。對雌霓掛雨，雄風拂檻，微收煩暑。漸覺一葉驚秋，殘蟬噪晚，素商時序。覽景想前歡，指神京、非霧非煙深處。向此成追感，新愁易積，故人難聚。憑高盡日凝竚，贏得消魂無語。極目霽靄霏微，暝鴉零亂，蕭索江城暮。南樓畫角，又送殘陽去。",
    "translate": "Atop a mound bleak is the landscape, High up in a pavilion looking out, I gaze at the quiet misty waters. Glowing clouds rain bear, gusty winds over the balustrade blow, Weakening what remains of a sultry summer. In the wake is autumn at the fall of a leaf, The last few cicadas murmur into the evening, humming notes low and subdued. I reminisce of past joyful days in the face of such scenery, Yet where our capital lies far in the distance is engulfed deep in the obscure.When the present becomes bygones, Easy to pile is more melancholy, hard to gather is old company. All day I stand here at an elevated height, Tacit nostalgia is all I've realised. Before my eyes drift what could be fine drizzle, mist or rime, Black crows flutter, desolate is the riverside town in dusk. From the southern tower bugles blare sending off another day's twilight.."
  },
  {
    "poem": "夢覺小庭院，冷風淅淅，疏外瀟瀟。綺窗外、秋聲敗葉狂飊。心搖、奈寒漏永、孤幃悄，淚燭空燒。無端處、是繡衾鴛枕，閒過今宵。蕭條。牽情繫恨，爭向年少偏饒。覺新來、憔悴舊日風標。魂消、念歡娛事，煙波阻，後約方遙。還經歲。問怎生禁得，如許無聊？",
    "translate": "I come around in the little courtyard To chilly wind whistles and showers of rain on the other side of the balustrade. Beyond the ornate windows, shrivelled and whirling leaves autumn articulate. With a heavy heart, a long wintry night is hard to pass, Alone behind the curtains of the bedchamber, a candle wax drips burning in vain. Of next to no use are the pillows and quilt embroidered with mandarin ducks, For I'll be idling the night away.Quietude surrounds me. Recalling lingering love and deep regrets, Which I've experienced plenty in my youthful days. Lately I've noticed that I'm growing pallid and thin, losing my old charm and grace. Feeling dejected, I reflect on pleasures I used to indulge in, That have since been put on hold by brume and waves, and distant are future dates. Maybe as distant as another year way. Allow me to ask how I could survive So many a tedious day!."
  },
  {
    "poem": "登臨送目，正故國晚秋，天氣初肅。千里澄江似練，翠峰如簇。歸帆去棹殘陽裏，背西風，酒旗斜矗。彩舟雲淡，星河鷺起，畫圖難足。念往昔、繁華競逐，歎門外樓頭，悲恨相續。千古憑高，對此漫嗟榮辱。六朝舊事隨流水，但寒煙衰草凝綠。至今商女，時時猶唱，後庭遺曲。",
    "translate": "I make a climb to cast my eyes afar, our capital is seeing late autumn climes, Solemn is the atmosphere. The limpid Yangtze winds for thousands of miles like a ribbon Around ranges of viridian peaks. Homing boats sail in twilight, Against the westerlies, leaning wine flags flutter fiercely. Colourful boats glide by under a sky of few clouds, stars rise over the Egret Isle, No painting could do justice to such a scene.Remember the days when they on grandeur and extravagance compete, Even when beyond the city gates tragic warring continued to take place. A thousands years on at this height, What more is there to be said of their glory and disgrace? The history of the six dynasties vanishes with the flow of water, There leaves only traces of smoke among wilting grass to the remaining green veil. Even courtesans of this day Often sing still the “Flowering Backyard”, a legacy from the olden days.."
  },
  {
    "poem": "別館寒砧，孤城畫角，一派秋聲入寥廓。東歸燕從海上去，南來雁向沙頭落。楚臺風，庾樓月，宛如昨。無奈被些名利縛，無奈被他情擔閣，可惜風流總閒卻。當初漫留華表語，而今誤我秦樓約。夢闌時，酒醒後，思量著。",
    "translate": "From within the hostel comes the garment pressing sound in the cold, From the lonely town bugles blare, The sound of autumn pervades throughout all voids of space. Eastward bound swallows fly over the sea on their way home, Wild geese on their way to the south on the sandbar catch a rest. The same wind that pleased the Duke of Chu on the Terrace blows, And same moon Yu admired from the South Tower shines, just as they did in those days.I cannot help being attached to fame and gain, Nor can I help having have to put aside my affections, Forsaking life's most delightful aspect. Once I uttered too much sweet talk to impress,Now I could only the promise of returning to you break. Whether it is when the dream is at its sweetest, Or when sobriety returns, my longing persists nonetheless.."
  },
  {
    "poem": "留春不住，費盡鶯兒語。滿地殘紅宮錦汙，昨夜南園風雨。小憐初上琵琶，曉來思繞天涯。不肯畫堂朱戶，春風自在楊花。",
    "translate": "Unable to be held on to is spring, Wasted is orioles' twittering. The ground covered in fallen petals has the look of soiled palatial floor covering, After last night's storm raged through the estate's southern garden.My beloved has just learnt to play the pipa, At dawn her thoughts have already drifted far to the end of the world. Unwilling to noblemen's edifices enter, Breezes of spring among willows and catkins potter.."
  },
  {
    "poem": "夢後樓臺高鎖，酒醒簾幕低垂。去年春恨卻來時，落花人獨立，微雨燕雙飛。記得小蘋初見，兩重心字羅衣。琵琶弦上說相思，當時明月在，曾照彩雲歸。",
    "translate": "On a high-rise out of reach I lie inebriated, Till I sober up to face nightfall that hangs low like a veil. Then my regret from last spring surfaces to my feelings agitate, Alone among fallen petals I stand, In the drizzle I glimpse a pair of swallows dashing away.I remember when I saw my lady for the first time, She wore a dress with double collars that were heart-shaped. She played the pipa that her yearning conveyed, The moon was bright that night, And its shine a lovely lady's way home illuminated.."
  },
  {
    "poem": "夢入江南煙水路，行盡江南，不與離人遇。睡裏消魂無說處，覺來惆悵消魂誤。欲盡此情書尺素，浮雁沉魚，終了無憑據。卻倚緩弦歌別緒，斷腸移破秦箏柱。",
    "translate": "In a dream at the Yangtze's south, among the misty waters of canals I roam, Yet all over the river's south, I haven't yet the lady I left behind come across. In my slumbers there's no one to whom I could my sorrows disclose, Only to wake up to the gloom of having been misled by these sorrows.I'd like to a letter write to my heart reveal, Yet wild fly geese and deep sink fish that haven't helped to return a reply after all. So I turn to the strings hoping to sing away my woe, Till rent into pieces is my heart like a cittern's neck that many frets hold.."
  },
  {
    "poem": "醉別西樓醒不記，春夢秋雲，聚散真容易。斜月半窗還少睡，畫屏閒展吳山翠。衣上酒痕詩裏字，點點行行，總是淒涼意。紅燭自憐無好計，夜寒空替人垂淚。",
    "translate": "We parted drunk in the west chamber only to wake up remembering very little, In dreamy spring and cloudy fall, we readily gathered and of each other took leave. The moon shines through the half-opened window allowing me little sleep, Clearly visible is the green Wu mountains spreading across the decorated screen.Wine stains on my clothes and words that poems weave, Blotches and verses of them portray nothing but a lonesome feel. Red candles know they have no better end to achieve, But to on this cold night drip tears of wax for those who weep.."
  },
  {
    "poem": "彩袖殷勤捧玉鍾，當年拚卻醉顏紅。舞低楊柳樓心月，歌盡桃花扇底風。從別後，憶相逢，幾回魂夢與君同。今宵賸把銀釭照，猶恐相逢是夢中。",
    "translate": "Your colourful sleeves move affectionately as you raise your jade cup, Years ago you would rather drink till red in the face risking becoming drunk. Your dance moonlight attracted to the inside of the willow-surrounded loft, Your singing drifted with the breeze and the waving of mahogany fans.Ever since our parting, I've thought of seeing your once more, How I've been dreaming of having your company. Tonight I raise the silver candle holder to illuminate a better look, For I'm afraid of seeing our reunion turning out to be a dream once more.."
  },
  {
    "poem": "醉拍春衫惜舊香，天將離恨惱疏狂。年年陌上生秋草，日日樓中到夕陽。雲渺渺，水茫茫，征人歸路許多長。相思本是無憑語，莫向花牋費淚行。",
    "translate": "Inebriated I cling to the spring clothes on which the fragrance of bygones lingers, Heaven knows well how adolescent impulsiveness can lead to regretful partings. Year after year autumn's withered grass across fields spreads, Day after day I dwell in my chamber till sunset.Clouds float and drift, broad and boundless are waters, The way home is so very disant for travellers on a long march. Since longing can never be articulated in full, Cry not streams of tears over scented billet-doux addressed to her.."
  },
  {
    "poem": "金鞍美少年，去躍青驄馬。牽繫玉樓人，繡被春寒夜。消息未歸來，寒食梨花謝。無處說相思，背面鞦韆下。",
    "translate": "A handsome young man riding a gilded bridle Rushes away on a light-haired charger. Concerned is a fair lady housed in fine architecture As she rests covered in an embroidered quilt in freezing dark hours.There comes no news of his return, Soon shall arrive the wilting of pear tree blossoms and the Day of Cold Fare. There is no one to disclose her longing to, So she sits on the swing letting her back to face the world.."
  },
  {
    "poem": "關山魂夢長，塞雁音書少。兩鬢可憐青，只為相思老。歸傍碧紗窗，說與人人道：真箇別離難，不似相逢好。",
    "translate": "Mountain ranges stand in the way of dreaming souls, Wild geese from the north no word or tidings bring. Regretfully the sideburns that were once ebony Have aged grey merely because of my longing.If I ever return to lean against the green silk-screened window, To my beloved I have this to say: “After really tasting the misery of parting sorrows, The joy of coming together becomes ever so great.”."
  },
  {
    "poem": "東風又作無情計，艷粉嬌紅吹滿地。碧樓簾影不遮愁，還似去年今日意。誰知錯管春殘事，到處登臨曾費淚。此時金盞直須深，看盡落花能幾醉。",
    "translate": "Inanimate are easterlies as they come, Blowing bright and delicate blossoms to the ground cover. Inside an ornate chamber the overhanging screen my nostalgia veils not, As I feel what I felt last year very much.Who knows how not to become drawn to the remaining spring vibes, Which seem to draw tears from me everywhere I stop by. Now I must raise the golden chalice and drink till I'm deep in a stupor, All blossoms go out of bloom, yet how often can I allow myself to intoxicated become?."
  },
  {
    "poem": "鞦韆院落重簾暮，彩筆閒來題繡戶。牆頭丹杏雨餘花，門外綠楊風後絮。朝雲信斷知何處？應作襄王春夢去。紫騮認得舊游蹤，嘶過畫橋東畔路。",
    "translate": "Vague is the swing in the garden veiled by dusk, seen through a window heavily screened. In my idleness I write a poem on the bedroom door. Spring rain has come to a stop, and over the wall bloom apricot trees. Outside the doors sway green willows casting catkins in the breeze.Where are the morning clouds that no trace leave? It all seems surreal like the Duke of Chu's springtime dream. His auburn steed might be capable of recalling the places he had travelled to, Which raised its hoofs to neigh as it ambles past a rainbow towards the east.."
  },
  {
    "poem": "留人不住，醉解蘭舟去。一棹碧濤春水路，過盡曉鶯啼處。渡頭楊柳青青，枝枝葉葉離情。此後錦書休寄，畫樓雲雨無憑。",
    "translate": "I couldn't persuade him to stay, I could only see off his inebriated self on a canoe. Which the waters of spring carried along amid green waves, Sailing pass orioles' twittering at dawn en route.By the wharf, green and tender are willows, Each twig and and every leaf are expressive of parting sorrows. Send me not his regards from here on, For the passion shared in a house of charm is nothing to go by after all.."
  },
  {
    "poem": "舊香殘粉似當初，人情恨不如。一春猶有數行書，秋來書更疏。衾鳳冷，枕鴛孤，愁腸待酒舒。夢魂縱有也成虛，那堪和夢無。",
    "translate": "The fragrance of her blusher that lingers is the same as before, Different since then are emotions as indifference grows. In spring I still letters of many words received, Which grew few and far between by fall.The phoenix on the quilt feels the cold, alone is the mandarin duck on the pillow, My nostalgic soul awaits the consolation of alcohol. There might have been dreams and fantasies but they are after all false and hollow, How unbearable that I now have no dream at all.."
  },
  {
    "poem": "天邊金掌露成霜，雲隨雁字長。綠杯紅袖趁重陽，人情似故鄉。蘭佩紫，菊簪黃，殷勤理舊狂。欲將沉醉換悲涼，清歌莫斷腸。",
    "translate": "High on the terrace dew on cacti turns into a film of frost, Clouds are like flights of wild geese, drawn out and long. In the name of the Double Ninth, I jade goblets and a beauty bring along, Among fellow visitors that share the kindness and custom of home.With sleeves wearing purple orchids and hair adorned with chrysanthemums in yellow, I so wish to mimic and relive the passion of yore. How I would like to exchange grief for crapulence, I pray that the singing of operatic arias wouldn't render me heartbroken.."
  },
  {
    "poem": "綠陰春盡，飛絮繞香閣。晚來翠眉宮樣，巧把遠山學。一寸狂心未說，已向橫波覺。畫簾遮帀，新翻曲妙，暗許閒人帶偷掐。前度書多隱語，意淺愁難答。昨夜詩有回文，韻險還慵押。都待笙歌散了，記取來時霎。不消紅蠟，閒雲歸後，月在庭花舊闌角。",
    "translate": "Exuberant foliage sees off the end of spring, around the loft catkins whirl. In the evening I am to draw her brows, So now I the shape of distant mountains imitate. Untold was a touch of passion I've been trying to contain, Yet her glance has already it discovered. Surrounded by screens, drapes and newly composed melodies, Such fooling around only idlers could tolerate.My last letter too much enigmatic usage contained, Its connotations seem shallow, unable to my true feeling articulate. Last night in her reply in verse, Contrived was the rhyming that almost harmony compromised. I might as well wait till all singing and music have faded, Before I ponder on what has been expressed. There is no need for red candles now that clouds have idled away, In the garden the moon shines over flowers by a corner with worn balustrades.."
  },
  {
    "poem": "街南綠樹春饒絮，雪滿游春路。樹頭花艷雜嬌雲，樹底人家朱戶。北樓閒上，疏簾高捲，直見街南樹。闌干倚盡猶慵去，幾度黃昏雨。晚春盤馬踏青苔，曾傍綠陰深駐。落花猶在，香屏空掩，人面知何處？",
    "translate": "South of the main streets catkins drift over greening trees,  Like snow they fall all over spring excursion paths. Blossoms on trees are glamorous and the clouds light, Under the foliage of trees is an established estate with a crimson gateway. From its northern loft, where the curtains are raised high, Directly in sight are the trees south of the main streetsAgainst the balustrade in her languor she lingers, There fall a few evening showers. In previous years late in spring, he used to rest his horse stamping on mosses, By a tree of dense foliage and long he there stood. Here fallen blossoms remain, half extended is the delicate screen hiding view, Where has the familiar face disappeared to?."
  },
  {
    "poem": "曲闌干外天如水，昨夜還曾倚。初將明月比佳期，長向月圓時候、望人歸。羅衣著破前香在，舊意誰教改。一春離恨懶調絃。猶有兩行閒淚、寶箏前。",
    "translate": "Beyond the meandering balustrades skies and waters seem alike, Against the same balustrade I also leaned that night. At first I took a bright moon for a sign that could us reunite, Especially on days with a full moon, for his return I would pine.Worn is my dress, yet there lingers a fragrance of days that have gone by, There's nothing to sway me from what I've decided. One spring's parting leaves me melancholy and lethargic to strings tighten. Two trails of tears roll freely as I sit before a zither that is priceless.."
  },
  {
    "poem": "畫屏天畔，夢回依約，十洲雲水。手撚紅箋寄人書，寫無限、傷春事。別浦高樓曾漫倚，對江南千里。樓下分流水聲中，有當日、憑高淚。",
    "translate": "There were panels of a decorated screen spreading across the sky That I just saw in a dreamy trance, up there must live divine beings of all realms. I hold in my hand crimson envelopes I am about to send, Containing writing of infinite lament over finite springtime.Once we leaned over this dockside high-rise where we parted, Looking out to the vast land south of the river. Below the waters of its tributaries ripple and murmur, Containing from that day tears we shed from high up here.."
  },
  {
    "poem": "紅葉黃花秋意晚，千里念行客。飛雲過盡，歸鴻無信，何處寄書得？淚彈不盡臨窗滴，就硯旋研墨。漸寫到別來，此情深處，紅箋為無色。",
    "translate": "Maples leaves and yellow chrysanthemums high autumn portray, Sentimental I grow being a traveller a thousand miles away. Fleeting clouds drift by, wild geese have return with no reply, Where must I go to letters mail?My tears roll without end, off they fall from the window ledge, A few splashes ink become following the grinding in the ink well. Gradually I come to write about the days since our parting, intense are my feelings, That pales the envelope's colour of red.."
  },
  {
    "poem": "南苑吹花，西樓題葉，故園歡事重重。憑蘭秋思，閒記舊相逢。幾處歌雲夢雨，可憐便、流水西東。別來久，淺情未有，錦字繫征鴻。年光還少味，開殘檻菊，落盡溪桐。漫留得、尊前，淡月淒風。此恨誰堪共說，情愁付、綠酒杯中。佳期在，歸時待把，香袖看啼紅。",
    "translate": "Over the southern grounds blossoms drift, Around the high-rise to the west flutter leaves inscribed with poems, This garden used to partake in much happiness and pleasure. I lean against the balustrade as autumnal sentiments pervade, Idly recalling the times when we came together to share. Delightful recitals and dreams took place here and there, It's pitiful that they soon slipped away like flowing water to the east or the west. Ever since our parting, shallow seem our love for there hasn't come Any wild goose to bring me a letter.There's not much left in a year, chrysanthemums by the fence are wilting, Phoenix trees by the creek are shedding leaves There leaves only a cup of wine to go with a cool moon and a chilly breeze. I have no one to disclose my dreariness to, But to pour all my affections and sorrows into cups of spirits. Still, there is our rendezvous, I await your return, For a close look of heartfelt tears that will be damping my sleeves.."
  },
  {
    "poem": "明月幾時有，把酒問青天。不知天上宮闕，今夕是何年。我欲乘風歸去，惟恐瓊樓玉宇，高處不勝寒。起舞弄清影，何似在人間。轉朱閣，低綺戶，照無眠。不應有恨，何事長向別時圓？人有悲歡離合，月有陰晴圓缺，此事古難全。但願人長久，千里共嬋娟。",
    "translate": "When did the bright moon come to be? I raise my drink to ask the azure sky. I wonder about the palace and edifices in heaven, What year of which age do they go by tonight? I'd like to ride the wind to there visit and return, Yet I fear where such grand and fine architecture is Must be unbearably cold because of its height. So I turn to dance among distinct light and shade, How it must appear beyond the promise of earthly delights.Soon the moon glides behind the red high-rise, And through the decorated window of the wakeful it shines. I know I shouldn't agonise over it, Yet why does the moon always fuller seem at parting times? Life is full of happy reunions and parting sorrows, And the moon waxes and wanes in size. Nothing is ever perfect since the beginning of time. May we continue to survive life, So that we could the moon's loveliness share when separated by thousands of miles.."
  },
  {
    "poem": "似花還似非花，也無人惜從教墜。拋家傍路，思量卻是，無情有思。縈損柔腸，困酣嬌眼，欲開還閉。夢隨風萬里，尋郎去處，又還被，鶯呼起。不恨此花飛盡，恨西園、落紅難綴。曉來雨過，遺蹤何在？一池萍碎。春色三分，二分塵土，一分流水。細看來不是楊花，點點是離人淚。",
    "translate": "They seem like blossoms yet they also seem otherwise, There's never anyone who would cherish them as they fall adrift. Scattered away from home along the roadside, Some pondering reveals that the unfeeling harbour affections indeed. Intertwined are my thoughts and insides, Tired and sleepy are my weary eyes, which remain shut despite my wish. My dreams have drifted ten thousands leagues away with the wind, To your presence seek, Only to again be disturbed by orioles as they tweet.Scattered adrift are these catkins yet they worry me not, Yet those in the West Garden grieve me, as fallen petals no longer glamour possess. After the passing of morning showers, where could I their traces find? In the pond there float broken patches of duckweeds. Whenever there are signs of spring, One could in soils two thirds notice, and in the flowing water one third perceive. On close looks I realise catkins they are not, Scattering in dribs and drabs are tears of the parted.."
  },
  {
    "poem": "大江東去，浪淘盡，千古風流人物。故壘西邊，人道是，三國周郎赤壁。亂石穿空，驚濤拍岸，捲起千堆雪。江山如畫，一時多少豪傑。遙想公瑾當年，小喬初嫁了，雄姿英發，羽扇綸巾，談笑間，檣櫓灰飛煙滅。故國神遊，多情應笑我，早生華髪。人生如夢，一尊還酹江月。",
    "translate": "The great gushing Yangtze with piling waves flows towards the east, Away it carries gallant souls of the remote bygone days.The ancient fort on the west is said to be The Crimson Cliff, where Zhou of the Three Kingdoms era Wei's navy defeated.Stones were hurled into the sky indiscriminatingly, Mighty waves must have crushed onto shores hurling high snow-like foam.The river and mountains today's landscapes paint, Where once there were many courageous and heroic men.Picture Zhou in his prime,Dressed in plain clothes together with his young bride, gallant he must have been. Topped with a silk crest, he held in his hand a fan of feathers, With humour he helped see to That the masts and sculls of Wei's navy go up in smoke and ashes turn into.My mind wanders in the history vested hither, My sentimentality no doubt has caused my early grey.Life is a dream, Allow me to libate a drink to the river, the moon and its reflection.."
  },
  {
    "poem": "明月如霜，好風如水，清景無限。曲港跳魚，圓荷瀉露，寂寞無人見。紞如三鼓，鏗然一葉，黯黯夢雲驚斷。夜茫茫、重尋無處，覺來小園行徧。天涯倦客，山中歸路，望斷故園心眼。燕子樓空，佳人何在？空鎖樓中燕。古今如夢，何曾夢覺，但有舊歡新怨。異時對、黃樓夜景，為余浩歎。",
    "translate": "The moon is as bright and pure as frost, the breeze as gentle and smooth as water, Pleasant is the scene that spreads before me. Within the curve of the cove fish leap, on round lotus leaves dew drops roll, Yet there is no sightseers here to take in the lonesome atmosphere. There comes the drum roll of midnight and a clear sound of a leaf taking a fall, Startling me awake from a gloomy, lingering dream. Still and deep is the night, bygones cannot be recovered, In my wakefulness I stroll this garden thoroughly.I'm a worn-out vagabond of the world, I see there are tracks in the mountains, Yet I fear I may never be able to return to the home in my heart. Deserted is the Swallow House, where could the fair lady be found? Locked in are swallows in the house in vain. Those times before and this moment in time are like dreams, yet do we ever wake? We seem to only ever pile on bygone happiness and new regrets. Come another time, somewhere in an ochre building at night, Someone may in my stead lament and sigh.."
  },
  {
    "poem": "冰肌玉骨，自清涼無汗。水殿風來暗香滿。繡簾開、一點明月窺人，人未寢，欹枕釵橫鬢亂。起來攜素手，庭戶無聲，時見疏星渡河漢。試問夜如何？夜已三更，金波淡、玉繩低轉。但屈指、西風幾時來，又不道、流年暗中偷換。",
    "translate": "With skin like ice and bones like jade, She perspires not looking cool and refreshed. From the hall by the water waft breezes full of subtle scents.Through the drawn embroidered curtains, the moon sneaks a look of her, She hasn't retired for the night, askew are the her pillow and hairpins in her hair.I rise to take her delicate hand, quiet is the courtyard and its environs, A star or two the Milky Way cross between whiles. How deep is the night, wonder I? Approaching midnight is the time, Moonlight pales as the northern stars low slide. I count with my fingers when the season of westerlies would arrive, Before I could become aware of it, lapsed has fleeting time.."
  },
  {
    "poem": "缺月掛疏桐，漏斷人初靜。誰見幽人獨往來？飄緲孤鴻影。驚起卻回頭，有恨無人省。揀盡寒枝不肯棲，寂寞沙洲冷。",
    "translate": "Over thinning phoenix trees hangs a curve of moon, Between gongs of the night hours people all round quiet down. Who takes notice of a loner going about? Faint is a silhouette of a solitary wild goose.Startled by it I was and turn around to look, Yet there is no one to my grievances understand. Withered branches are subject to choosing yet nothing comes to roost, Cold is the sandy isle engulfed in lonesomeness and gloom.."
  },
  {
    "poem": "三年枕上吳中路，遣黃犬、隨君去。若到松江呼小渡，莫驚鴛鷺，四橋盡是、老子經行處。輞川圖上看春暮，常記高人右丞句。作箇歸期天定許，春衫猶是，小蠻針線，曾濕西湖雨。",
    "translate": "For the past three years I've dreamt of being on my way to the region of Wu, Here I send along my dog with ochre fur to accompany you. Once you arrive at the Pine River asking to the waters cross, Startle not mandarin ducks and herons there, Everywhere all round the famed four bridges is where Lao Zi once trod.I peruse the Wang River Collection to gather vernal evening sights, And often premier-turned-hermit Wang Wei's verses recite. Once a date of return has been set I hope for heaven's nod, Hope it is still the time for spring clothes that were sewn by my lovely maid, Which once were dampened by showers of the West Lake.."
  },
  {
    "poem": "夜飲東坡醒復醉，歸來仿佛三更。家童鼻息已雷鳴，敲門都不應，倚杖聽江聲。長恨此身非我有，何時忘卻營營？夜闌風靜縠紋平，小舟從此逝，江海寄餘生。",
    "translate": "At the eastern slope I drank away the night and any sobriety that returned to me, It must have been midnight when I came home. My houseboy's snoring resonates like a thundering roll, No one responded to my knocking on doors, Leaving me to lean on my cane listening to the river's flow.I often agonise over not being my own commander, When could I forget all troubles and bothers? Deep is the night, still the wind and smooth the rippling of water, If I could only just disappear on a little boat Among rivers and seas for the rest of my life from here on.."
  },
  {
    "poem": "莫聽穿林打葉聲，何妨吟嘯且徐行。竹杖芒鞋輕勝馬，誰怕？一蓑煙雨任平生。料峭春風吹酒醒，微冷，山頭斜照卻相迎。回首向來蕭瑟處，歸去，也無風雨也無晴。",
    "translate": "Heed not to the tree-rustling and leaf-lashing rain,Why not stroll along, whistle and sing under its rein.Lighter and better suited than horses are straw sandals and a bamboo staff,Who's afraid? A palm-leaf plaited cape provides enough to misty weather in life sustain.A thorny spring breeze sobers up the spirit,I feel a slight chill,The setting sun over the mountain offers greetings still.Looking back over the bleak passage survived,The return in time Shall not be affected by windswept rain or shine.."
  },
  {
    "poem": "十年生死兩茫茫，不思量，自難忘。千里孤墳，無處話淒涼。縱使相逢應不識，塵滿面、鬢如霜。夜來幽夢忽還鄉，小軒窗，正梳妝。相顧無言，惟有淚千行。料得年年腸斷處，明月夜、短松岡。",
    "translate": "Ten years of separation by the immeasurable distance between life and death Is not something I'd like to think about, yet unforgettable it is already. A thousands miles away is your lonely grave, I've nowhere to visit and my grief express. Even if we could meet, we probably wouldn't each other recognise, For my faces has aged and my sideburns greyed as I have life's hardship sustained.Last night out of the blue I dreamt of homecoming, And there you were, putting on make-up after combing your hair. Our eyes meet yet reticent we remained, Yet rolling down our cheeks are tears forming far too many trails. Then I realise we are where I'd visit year after year when my heart aches, On a night with a bright moon, on the hillock, among the pine saplings I'd stay.."
  },
  {
    "poem": "餘霜已失長淮闊，空聽潺潺清潁歇。佳人猶唱醉翁詞，四十三年如電抹。草頭秋露如珠滑，三五盈盈還二八。與余同是識翁人，惟有西湖波底月。",
    "translate": "After the arrival of frost, River Huai is no longer as wide as it once was, There is only the Ying River murmuring in vain. Though Master Ouyang's verses are still sung by girls of this place, The past forty-three years have disappeared like a lightning flare.On grass tips condense dewdrops smooth like pearls, The full moon of the fifteenth on the sixteenth is still as round in shape. Speaking of someone who still remembers the master as well as I do, There is only the moon that ripples in the West Lake.."
  },
  {
    "poem": "乳燕飛華屋，悄無人、槐陰轉午，晚涼新浴。手弄生綃白團扇，扇手一時似玉。漸困倚、孤眠清熟，簾外誰來推繡戶？枉教人、夢斷瑤臺曲，又卻是、風敲竹。石榴半吐紅巾蹙，待浮花浪蕊都盡，伴君幽獨。穠艷一枝細看取，芳意千重似束。又恐被、西風驚綠，若待得君來向此，花前對酒不忍觸。共粉淚、兩簌簌。",
    "translate": "Swallow fledglings flit across a magnificent edifice, In quietness there is no one but the shade of pagoda trees making an afternoon shift. Everything is bathed in evening's cool breeze. I hold in my hand a around fan made of raw silk, My hand and my fan movements in the colour of jade render. Gradually overcome with tiredness, I turn in for a good sleep. Who is it that pushed through the drapes? Abruptly interrupting the melody of the Heavenly Terrace playing in my dream. It turns out to be the sound of bamboos knocking in the wind.Pomegranate plants are flowering red, halfway to a full bloom, Awaiting to survive all drifting blossoms and buds, To accompany the solitude of my beloved. Do obtain a bloom to behold attentively, Enwrapped by its petals in layers and layers are its fragrance and elegance. It's a worry that westerlies would they disturb and wreck, When you do come this way, In front of the bloom holding onto wine I wouldn't bear to those flowers pick. Yet down my powered face would spill two trails of overflowing tears.."
  },
  {
    "poem": "萬里黔中一漏天，屋居終日似乘船。及至重陽天也霽。催醉，鬼門關近蜀江前。莫笑老翁猶氣岸，君看，幾人白髮上華顛？戲馬臺前追兩謝，馳射，風情猶拍古人肩。",
    "translate": "In exile in the Qian region I am, taking residence in a cottage with a leaking roof, To spend a day inside the cottage is like to survive a boat ride. Finally the sky begins to clear up as the season closes in on the Double Ninth, So I give in to drinking, For not far at all is the Gate of Hell, just before the flow enters the River of Shu.Don't make fun of an old man like me, whose spirit soars still, You see, How often do you come across a head of hair that has turned white completely? We might as well stay before drama stages to follow the grace and charm of the Xies, And those archers and cavalry, Whose dynamic valour parallels that of the ancients.."
  },
  {
    "poem": "黃菊枝頭生曉寒，人生莫放酒杯乾。風前橫笛斜吹雨，醉裏簪花倒著冠。身健在，且加餐，舞裙歌板盡情歡。黃花白髮相牽挽，付與時人冷眼看。",
    "translate": "Through the stems of yellow chrysanthemums morning iciness penetrates, In life, allow not wine cups to become dry. Playing the flute in the wind in front of slanting rain, A drunk wears the crest upside down with flowers pinned to his hair.When health allows, he should eat more, And dancing accompanied by clappers thoroughly appreciate. Let those with a head of grey and yellow blooms one another embrace Against the cold shoulders of the worldly without a care.."
  },
  {
    "poem": "梅英疏淡，冰澌溶洩，東風暗換年華。金谷俊游，銅駝巷陌，新晴細履平沙。長記誤隨車，正絮翻蝶舞，芳思交加。柳下桃蹊，亂分春色到人家。西園夜飲鳴笳，有華燈礙月，飛蓋妨花。蘭苑未空，行人漸老，重來是事堪嗟。煙暝酒旗斜，但倚樓極目，時見棲鴉。無奈歸心，暗隨流水到天涯。",
    "translate": "Pure and delicate are plum blossoms, snow melts and flow away, Concealed in easterlies is lapsed youth. Those attending the bazaars of the Golden Valley and Copper Camel Alleyway Are treading lightly raising mild dust on such a new fine day. I still remember that time when I followed the wrong coach, Among drifting catkins butterflies whirl to my spring nostalgia complicate. In the shade of willows and along paths lined with peach trees, Households all over receive a share of this spring landscape.In the West Garden I drink the night away and the Tartar pipe play, There are lanterns overshadowing the moon, And a marquee getting in the way of drifting blooms. Not yet bare is the orchid garden, growing old are those who come and go, Every time I there enter adds to my lament and regrets. In the obscurity of smoke, wine flags incline, I lean over a high rise to further my sight, And see many a duck returning to branches and stay. Although I so desire homecoming, I could only send my thoughts with the flowing water to the very far away.."
  },
  {
    "poem": "倚危亭、恨如芳草，萋萋剗盡還生。念柳外青驄別後，水邊紅袂分時，愴然暗驚。無端天與娉婷，夜月一簾幽夢，春風十里柔情。怎奈向歡娛，漸隨流水，素弦聲斷，翠綃香減。那堪片片飛花弄晚，濛濛殘雨籠晴。正銷凝，黃鸝又啼數聲。",
    "translate": "Leaning over a pavilion up on high, like verdure my sentiments grow, That flourishes and thrives despite every effort to have it mowed. I call to mind the day we parted by the green willows and I left on my horse, By the water her red sleeves swayed as goodbyes were waved, I felt doleful, as well as a sense of apprehension coming on.Unexpectedly I was granted by heaven a beautiful lady, It was like a veiled sweet dream on a moonlit night, Gentle was the spring breeze that waft through for ten miles. However, great pleasure and happiness tend to rush away like flowing water, The sound of strings comes to a halt, the scent of silky drapes thins. Unbearable is the sight of drifting petals at twilight, And the misty drizzle that the sun screens. Amid such dreariness, orioles comes to warble and twitter many a tweet.."
  },
  {
    "poem": "山抹微雲，天黏衰草，畫角聲斷譙門。暫停征棹，聊共引離樽。多少蓬萊舊事，空回首、煙靄紛紛。斜陽外，寒鴉數點，流水遶孤邨。銷魂，當此際，香囊暗解，羅帶輕分。漫贏得青樓，薄幸名存。此去何時見也？襟袖上、空惹啼痕。傷情處，高城望斷，燈火已黃昏。",
    "translate": "Light clouds smear across the mountains, attached to the horizon is wilting grass, The blare of a bugle from the watch tower comes to a stop. I let the boat rest for a while, As we chat and drink up many cups of wine. There have been many anecdotes about the Penglai wonderland, Yet we could only tales recount in vain amid hazy fog and smoke. Under a setting sun, black crows several marks create in the sky, Rushing waters of the river around the lonesome town wind.Overwhelming and enchanting such a moment is, In the dark she would let loose her fragrance pouch, untied would be her waistband. All I have gained among brothels Is notoriety that I am a heartless man. Since our parting, when shall we ever meet again? On my collar and sleeves, I leave tear stains in vain. Dwelling in sadness, up on a tower I scan far and wide, Lights have come on as dusk has arrived.."
  },
  {
    "poem": "曉色雲開，春隨人意，驟雨纔過還晴。古臺芳榭，飛燕蹴紅英。舞困榆錢自落，鞦韆外、綠水橋平。東風裏，朱門映柳，低按小秦箏。多情，行樂處，珠鈿翠蓋，玉轡紅纓。漸酒空金榼，花困蓬瀛。豆蔻梢頭舊恨，十年夢，屈指堪驚。憑闌久，疏煙淡日，寂寞下蕪城。",
    "translate": "The day breaks as clouds part, agreeable is spring, The weather has cleared up after a pouring rain. Around a raised hall of some history, Dashing between blossoms are flitting swallows. Pods from elm trees fall from their weary flutters. Beyond the swings, under a bridge smooth green waters flow. In easterlies, contrasting against a crimson edifice are willows, Through which come the depressed sound of Qin zither play.Being a sentimentalist, where the excursion takes me, I find attractive pearl hairpins, elaborate hoods, jade-adorned bridles and red tassels. I drink till empty is the golden wine vessel, Florid faces are confined to the wonderlands of Penglai and Yingzhou. An old regret about a fair maiden resurfaces, It's been a dream lasting a decade long, it surprises me as I fingers count.Against the balustrade long I lean, against a pale setting sun rises light smoke, Which in lonesomeness sinks below the town of Yangzhou.."
  },
  {
    "poem": "霧失樓臺，月迷津渡，桃源望斷無尋處。可堪孤館閉春寒，杜鵑聲裏斜陽暮。驛寄梅花，魚傳尺素，砌成此恨無重數。郴江幸自繞郴山，為誰流下瀟湘去？",
    "translate": "Fog conceals edifices and its terraces, the ferry is held captive by moonlight, Despite every survey, nowhere could I the Fountainhead of Peach Blossoms find. Unbearable is this lonesome inn that is supposed to shut out the cold of spring, Especially at twilight surrounded by cuckoos' heart-rending cries.I'm sending you a sprig of plum blooms from the inn and a letter through a carp, To convey my myriads of regrets that have piled miles high. The River of Chen that meanders around the mountains of Chen, For whom do you towards the waters of Xiao and Xiang make strides?."
  },
  {
    "poem": "枝上流鶯和淚聞，新啼痕閒舊啼痕。一春魚雁無消息，千里關山勞夢魂。無一語，對芳尊，安排腸斷到黃昏。甫能炙得燈兒了，雨打梨花深閉門。",
    "translate": "From tree branches come yellow orioles' seemingly tearful wails, New tear trails lay over old tear trails as I cry. Throughout spring no carps nor wild geese have come to news bring, Fatiguing dreaming souls separated by a dividing range and thousands of miles.I've nothing to say but to stare at the spirits in the cup, Looking to drink my heartbroken self till evening arrives. I've just set the lamps alight, There comes rain beating on pear blossoms urging me to shut the doors tight.."
  },
  {
    "poem": "天涯舊恨，獨自淒涼人不問。欲見回腸，斷盡金爐小篆香。黛蛾長斂，任是春風吹不展。困倚危樓，過盡飛鴻字字愁。",
    "translate": "I rove among distant corners bearing regrets from bygone days, Feeling miserable in loneliness as no one cares to ask how I've been. I've always hoped to see you again yet disappointed I've always been, Much like curls of smoke from a gilded incense burner that twirl to nothing in vain.My shapely eyebrows often in a deep frown engage, That not even the spring breeze could relieve. Weary and tired on a high rise, against which I lean, Across fly wild geese in a flight that appear like words and words of grief.."
  },
  {
    "poem": "漠漠輕寒上小樓，曉陰無賴似窮秋，淡煙流水畫屏幽。自在飛花輕似夢，無邊絲雨細如愁，寶簾閒掛小銀鉤。",
    "translate": "It gets a little cold as I in apathy climb upstairs, The morning's late-autumn-like chill is hard to tolerate, Light fog pervades over flowing waters, the painted screen loneliness isolates.Free drifting blossoms are as light as reveries, Fine rain drizzles endlessly as delicate as melancholy, From the silvery hooks idly hangs the precious beaded screen.."
  },
  {
    "poem": "湘天風雨破寒初，深沉庭院虛。麗譙吹罷小單于，迢迢清夜徂。鄉夢斷，旅魂孤，崢嶸歲又除。衡陽猶有雁傳書，郴陽和雁無。",
    "translate": "Windswept rain storms through the sky of Xiang on a day that's becoming wintry, Gloomy is the garden that is deserted. Above the gate of the magnificent town tower comes the tune of “A Little Chieftain”, Here goes a long night that is still.Dashed away has my hope of homecoming, lonely is my wayfaring spirit, Piercing cold is the wind as another year has come to its end. While Hengyang still sees wild geese who letters deliver, Wild geese do not as south as Chenyang reach.."
  },
  {
    "poem": "晚雲收，淡天一片琉璃。爛銀盤、來從海底，皓色千里澄輝。瑩無塵、素娥淡竚，靜可數、丹桂參差。玉露初零，金風未凜，一年無似此佳時。露坐久、疏瑩時度，烏鵲正南飛。瑤臺冷，欄干憑暖，欲下遲遲。念佳人、音塵別後，對此應解相思。最關情、漏聲正永，暗斷腸、花影偷移。料得來宵，清光未減，陰晴天氣又爭知。共凝戀、如今別後，還是隔年期。人強健，清尊素影，長願相隨。",
    "translate": "Clouds of the twilight hours have now faded away Leaving the sky lightly glazed. A bright and brilliant silver plate surfaced in the sea, For thousands of miles it casts luminous and lucid rays. Without the pollution of a grain of sand is its translucence, its goddess stands pure, At such a quiet and still time, visible is the jagged profile of those cinnamon trees. Dewdrops have begun to condense, not yet freezing is the autumn air, There is no better time than this in a year. I've been sitting out in the open for some time, fireflies pass me by on occasions, And those southbound black cuckoos are on their way. Cold are the terrace and the stairs, warm is the balustrade that I've been leaning on, Though I think of retreating, I linger as I hesitate.I think of her, ever since our parting, I've come to understand the meaning of pining, The most saddening is the hourly gongs that tells of the deepening of night, I continue to grieve alone, taking notice of the shadow of flowers as they shift. I suppose tomorrow night's moonlight should still be bright, Yet who can predict whether the weather would be cloudy or fine. Our mutual love was deep, but after our separation, It has been more than a year in time. I hope that I can healthy remain, so as to your presence and good wine Accompany for the rest of my life.."
  },
  {
    "poem": "欲減羅衣寒未去，不捲珠簾，人在深深處。紅杏枝頭花幾許？啼痕止恨清明雨。盡日沉煙香一縷，宿酒醒遲，惱破春情緒。飛燕又將歸信誤，小屏風上西江路。",
    "translate": "Although I'd like to remove my outer robe, still cold is the air, I've no intention to raise the beaded screen, deep in a dark corner I dwell. How many blooms are there among the apricot blossoms? Tear drops and the traces they leave have been washed away by vernal rains.All day curls of smoke rise from the burning of aloewood incense, Slowly I wake from last night's insobriety, vexatious is my mood aroused by spring. Those swallows have yet again delayed their return date, Depicted on the delicate screen is the long journey over the rivers in the west.."
  },
  {
    "poem": "捲絮風頭寒欲盡，墜粉飄香，日日紅成陣。新酒又添殘酒困，今春不減前春恨。蝶去鶯飛無處問，隔水高樓，望斷雙魚信。惱亂橫波秋一寸，斜陽只與黃昏近。",
    "translate": "A breeze waft through whirling up petals as the spring chill comes to an end, Drifting pollen sends its fragrance aflutter, scattering crimson around day after day. More drinks add to insobriety that survive previous nights intensifying distress,This vernal season sees no less misery than last spring's despair.Gone are butterflies, away flit orioles, there is no one to my feelings sense, The edifice may only be a river away, yet my anticipation has brought no mail. Disappointed is my gaze and my looks frustration express, Twilight only comes when the sun sets.."
  },
  {
    "poem": "春風依舊，著意隋堤柳。搓得鵝兒黃欲就，天氣清明時候。去年紫陌青門，今宵雨魄雲魂。斷送一生憔悴，只消幾箇黃昏？",
    "translate": "As usual, here comes the spring breeze, Willows by the canal their tender touch feel. Rendering almost everywhere a lemon tint, Vernal equinox is the time, it turns out to be.Last year a fair was held at the scenic ground, Tonight I see no trace of it, not even a drop of rain nor a shred of cloud. Ruined is an emaciated life, How many sunsets did it take to bring along such a downfall?."
  },
  {
    "poem": "亭皋木葉下，重陽近、又是擣衣秋。奈愁入庾腸，老侵潘鬢，漫簪黃菊，花也應羞。楚天晚，白蘋煙盡處，紅蓼水邊頭。芳草有情，夕陽無語，雁橫南浦，人倚西樓。玉容知安否？香箋共錦字，兩處悠悠。空恨碧雲離合，青鳥沈浮。向風前懊惱，芳心一點，寸眉兩葉，禁甚閒愁。情到不堪言處，分付東流。",
    "translate": "Around the pavilion trees their leaves shed, Drawing near is the Double Ninth, here comes the garment pressing sound of fall. I cannot help but becoming melancholy like Yu and going grey like Pan, Pinning yellow chrysanthemums to my hair would only those flowers disgrace. Evening arrives at the Chu sky, white duckweeds spread to where mist pervades, While knotweeds extends to the water's edge. The verdure seems full of vigour, yet reticent is the sunset scene, Over the southern waters wild geese skim, as I on the west tower remain.How fare your beautiful self? We rely on only letters and notes to keep track of each other in different places. I'd gaze at the gathering of clouds in the blue sky in vain, There'd fly a blue bird sometimes high sometimes low. I'm feeling particularly upset as I stand against the wind, My devoted heart and two leaves of inch-long brows Are overwhelmed with emotions. When affections swell to an inexpressibly critical point, They could only be carried away by waters that eastwards flow.."
  },
  {
    "poem": "問春何苦悤悤，帶風伴雨如馳驟。幽葩細萼，小園低檻，壅培未就。吹盡繁紅，占春長久，不如垂柳。算春常不老，人愁春老，愁只是、人間有。春恨十常八九，忍輕孤、芳醪經口。那知自是、桃花結子，不因春瘦。世上功名，老來風味，春歸時候。最多情猶有，尊前青眼，相逢依舊。",
    "translate": "I'd like to ask why spring must dash in a hurry, As it brings along flurries of winds accompanied by sudden rains. Elegant flowers over delicate calyxes in little garden beds of low stockades Do not survive and keep well. Adrift are lush blossoms, though as far as keeping spring, They are no better at it than those drooping willows. Even if spring never passes, there would still be those who fear it would, Such worry is a thing of the mortal realm.Vernal sentimentality surges often and wide it spreads, I could not bear to mouthfuls of good wine waste. It is just the way it is that blossoms of peach trees turn to fruits and stones, The transience of spring isn't the reason for their becoming emaciated. Worldly achievements in the mind of the aged Like the passing of spring are fleeting and momentary. The most anyone can accomplish is lasting friendship, Drinking opposite each other like old acquaintances once did in bygone days.."
  },
  {
    "poem": "開時似雪，謝時似雪，花中奇絕。香非在蕊，香非在萼，骨中香徹。占溪風，留溪月，堪羞損山桃如血。直饒更，疏疏淡淡，終有一般情別。",
    "translate": "It blooms like a snowflake, and wilts like a snowflake, Unusual among flowers it is, most special and rareIts fragrances comes not from its bud, nor from its calyx, Full of fragrance is its stem.In the way of the wind from the creek, it persuades the moon over the creek to stay, It shames blossoms of peach trees making their crimson pale. Throughout the night, it kind blooms sparsely and delicately, To a unique charm portray.."
  },
  {
    "poem": "無窮官柳，無情畫舸，無根行客。南山尚相送，只高城人隔。罨畫園林溪紺碧，算重來、盡成陳跡。劉郎鬢如此，況桃花顏色？",
    "translate": "Countless is the number of willows that line the main avenue, Ruthless is the decorated boat navigating further away, Rootless is a traveller like me who continues to peregrinate. The Southern Mountains remain in sight to see me off, Yet the height of the town walls people's gaze separate.Varicoloured are gardens and creeks green tinted with red, When I here visit again, a thing of the past shall become of this landscape. Master Liu's sideburns could not the colour of grey escape, How could ruddiness of peach blossoms any better fare?."
  },
  {
    "poem": "青煙冪處，碧海飛金鏡。永夜閒階臥桂影。露涼時，零亂多少寒螿，神京遠，惟有藍橋路近。水晶簾不下，雲母屏開，冷浸佳人淡脂粉。待都將、許多明月，付與金樽，投曉共、流霞傾盡。更攜取胡床、上南樓，看玉做人間，素秋千頃。",
    "translate": "Mist shrouds over green waters, from the blue sea a golden mirror rises. On a long night across the deserted stairs the shadow of cinnamon trees recline. Dewdrops a chill spread, sporadically here and there hum insects in the cold, Distant is the immortal capital, except for the road to the Bridge of Azure.Not yet let down is the beaded crystal screen, extended is the mica shield, With a depiction of the lightly powdered Moon Goddess and her desolation. Let us gather every nuance of moonlight So as to instil them into cups of drinks, And while waiting for the day to break, let us bottom up such heavenly wine. Then let us pick up a cane chair each and the South Tower climb, To admire the bright jade as it cast flawless rays over thousands of square miles.."
  },
  {
    "poem": "憶昔西池池上飲，年年多少歡娛。別來不寄一行書，尋常相見了，猶道不如初。安穩錦衾今夜夢，月明好渡江湖。相思休問定何如？情知春去後，管得落花無。",
    "translate": "Recollections of the West Pond come to me, how we drank in the pond, Year after year, how we had many a joyful moment. Since our parting, you have not so much as sent my way a note, When we do come across each other on occasions, I cannot even sense goodwill that a new acquaintance usually holds.I've prepared a bed of embroidered quilt hoping for a good night's dream, So as to allow me to the rivers and lakes cross. In my wistfulness how could I consider where it would lead me towards? For I know once spring has gone, There is no one to prevent blossoms from drifting to their fall.."
  },
  {
    "poem": "芙蓉落盡天涵水，日暮滄波起。背飛雙燕貼雲寒，獨向小樓東畔、倚闌看。浮生只合尊前老，雪滿長安道。故人早晚上高臺，寄我江南春色、一枝梅。",
    "translate": "Flowers of lotus have wilted in the waters that the sky runs into, At sunset dusky waves undulates. Silhouetted against cold-seeming clouds a pair of swallows flit across, On a raised chamber on the east shore, leaning against the balustrade I gaze.Life's vicissitudes makes wine the best partner when it comes to faring the old age, Now that snow has covered the historical Changan Avenue. When you do the lofty terrace scale, Post me from the river's south a spring sprig off a plum tree that is blooming away.."
  },
  {
    "poem": "小雨纖纖風細細，萬家楊柳青煙裏。戀樹濕花飛不起，愁無際，和春付與東流水。九十光陰能有幾？金龜解盡留無計。寄語東陽沽酒市，拚一醉，而今樂事他年淚。",
    "translate": "Fine is the drizzling rain and tender the wind, Households and their willows give the enshrouding mist a hue of green. Blossoms cling to trees as they are wet and weighed down in their drift, Endless is melancholy That follows spring and the waters flowing east.How long last ninety vernal days? Even if one sets aside his gilded tortoise to sobriety lose, spring is still unable to stay. Let us become attached to the wine vendors of Dongyang, And in a carouse participate, Easily becoming recollections drawing another year's tears are transient joys of today.."
  },
  {
    "poem": "淚濕闌干花著露，愁到眉峰碧聚。此恨平分取，更無言語空相覷。斷雨殘雲無意緒，寂寞朝朝暮暮。今夜山深處，斷魂分付潮回去。",
    "translate": "Tears dribble wetting balustrade and flowers appearing like dew, Shapely painted brows gather tight to grief put on view. We each contribute feelings that are mutual, With nothing to say, we could only give each other silent looks.Interruptive rains and remnants of clouds have slackened my thoughts, Shrouding me in loneliness from dusk till dawn. On a night like this deep in the mountains, Already flowing with the tide to return to you is my broken soul.."
  },
  {
    "poem": "赤闌橋盡香街直，籠街細柳嬌無力。金碧上青空，花晴簾影紅。黃衫飛白馬，日日青樓下。醉眼不逢人，午香吹暗塵。",
    "translate": "At the end of the bridge with red balustrades is the fragrant thoroughfare, Veiling the street are delicate willows, fragile and weak. Edifices adorned in the colours of gold and jade rise into the azure sky, Blooms on a clear day cast onto screens reflections with a red tint.Noblemen with saffron robes on white horses make their sprint, Day after day they arrive at the red-light district. Their inebriated eyes don't decent people meet, They are greeted by fine dust scattered among the scented afternoon breeze.."
  },
  {
    "poem": "綠蕪牆繞青苔院，中庭日淡芭蕉捲。蝴蝶上階飛，烘簾自在垂。玉鉤雙語燕，寶甃楊花轉。幾處簸錢聲，綠窗春睡輕。",
    "translate": "Around the walls of the mossy garden flourish weeds, Inside the courtyard weak is the sun, curled up are plantain leaves. Over the stairs the butterflies hover and fly, Warm are screens and curtains that hang freely..On the curtain hooks rest a pair of conversing swallows, In the terracotta gutter catkins make their whirling drift. Faint is the sound of a few games of coin toss, Behind the window with a green screen I drift off with spring.."
  },
  {
    "poem": "雪雲散盡，放曉晴庭院。楊柳於人便青眼。更風流多處，一點梅心，相映遠，約略顰輕笑淺。一年春好處，不在濃芳，小艷疏香最嬌軟。到清明時候，百紫千紅，花正亂，已失春風一半。早占取韶光、共追游，但莫管春寒，醉紅自暖。",
    "translate": "After the passing of a snow storm, the garden wakes to a fine morning. Willows offer their visitors eyefuls of green. There is also the wind breezing through Many a bloom of plum trees, contrasting one another in the distance, Accompanied by smiles and light laughters every now and then.The most vernal of the year is not when flowers are in full bloom, But the blooming of lightly scented ones that are charming and delicate. When it comes to the day of the spring equinox, Hundreds and thousands of purple and red are the colours of chaotic blossoms, Yet half gone is springtime. It is best to cherish such glorious moments and go on excursions readily, Never mind the spring chill, drinking among flowers will naturally warmth bring.."
  },
  {
    "poem": "胡馬嘶風，漢旗翻雪，彤雲又吐，一竿殘照。古木連空，亂山無數，行盡暮沙衰草。星斗橫幽館，夜無眠、燈花空老。霧濃香鴨，冰凝淚燭，霜天難曉。長記小妝纔了，一杯未盡，離懷多少。醉裏秋波，夢中朝雨，都是醒時煩惱。料有牽情處，忍思量耳邊曾道：甚時躍馬歸來，認得迎門輕笑。",
    "translate": "Hun horses neigh at the northerlies, Han pennants flutter in the snow, Colourful clouds gather as the setting sun dwindle to a beam of twilight. Ancient trees the sky join, mountains ranges cross and intertwine, Everywhere spread desert sands and withered grass. Stars a ladle form traversing before this inn steeped in silence, Wakeful I remain, to watch the wick of a lamp in vain burns alight. Smoke enshrouds the incense burner in the shape of a duck, Ice forms over a weeping candle, dawn finds it hard to arrive over a frosted sky.I will not forget how her make-up barely covered the effect of time, Before I could my cup empty, overflowing I've become with parting grief. In drunkenness I see the sadness in her eyes, Dreaming of our intimacy makes me sentimental in my waking hours.They lead me to dwell on my true feelings, I barely have the heart to recall what you once whispered to my ear: Whenever you return on a galloping horse, Remember to come by my door where I would be waiting with a smile.."
  },
  {
    "poem": "殘寒消盡，疏雨過、清明後。花徑款餘紅，風沼縈新皺。乳燕穿庭戶，飛絮沾襟袖。正佳時，仍晚晝，著人滋味，真箇濃如酒。頻移帶眼，空只恁、厭厭瘦。不見又思量，見了還依舊，為問頻相見，何似長相守。天不老，人未偶，且將此恨，分付庭前柳。",
    "translate": "Faded has what remains of winter cold, A light drizzle has been, so has the vernal equinox. Paths are paved with petals and their remaining crimson, And the breeze continues to wrinkle the pond surface. Swallow fledglings flit their way across the courtyard, Drifting catkins cling to sleeves and collars. Nice is the weather, day and night, That invites one to savour, for it certainly is as potent as wine.I've been needing to again shift my belt hole, Only because I've thinner become. Not seeing her makes me miss her, Yet seeing her makes no difference at all. Being able to see her every now and again Is no comparison to having her companion lifelong. Heaven ages not, yet we haven't been able to life partners become. Let me dispose of my regret and leave it with the willows in the courtyard.."
  },
  {
    "poem": "我住長江頭，君住長江尾；日日思君不見君，共飲長江水。此水幾時休？此恨何時已？只願君心似我心，定不負相思意。",
    "translate": "I live where the Yangtze begins, You live where the Yangtze comes to its end; Day after day I long for you yet I see you not, Though we the Yangtze's waters share.When shall the waters run dry? When shall this regret come to an end? I only hope that your heart is like mine, And disappoint not our mutual wistful affections.."
  },
  {
    "poem": "章臺路，還見褪粉梅梢，試花桃樹。愔愔坊陌人家，定巢燕子，歸來舊處。黯凝竚，因念箇人癡小，乍窺門戶。侵晨淺約宮黃，障風映袖，盈盈笑語。前度劉郎重到，訪鄰尋里，同時歌舞，惟有舊家秋娘，聲價如故。吟箋賦筆，猶記燕臺句。知誰伴，名園露飲，東城閒步？事與孤鴻去，探春盡是，傷離意緒。官柳低金縷，歸騎晚、纖纖池塘飛雨。斷腸院落，一簾風絮。",
    "translate": "Along the Medal Terrace, there remains plum blossoms that are wilting still, Already beginning to bloom are peach trees. Quiet are the streets of this neighbourhood, Swallows that have nests here are about to make a return to their origin.In silence I stand still, I recall her petite figure, and how she'd suddenly look out  the windows. In the morn, she would powder her brows with the colour of the moon, Her sleeves would move air and her laughters would fill the room.Once upon a time, upon Master Liu's return, He visited his old neighbours in his old neighbourhood, Of all dancers of his contemporaries, there was only Madam Du, Who could still command what she used to. I pick up a brush to a prose compose on coloured sheets, Springing spontaneously to mind are the writings devoted to the Yan Terrace. Who remains to accompany me, to drink alfresco in this famed garden, And to go on walks to the town's east? Everything has left with the wild geese, I hope to hold onto spring, yet its departure deeply disappoints me. Along the main avenue willows bow like curls of golden strands, I come home late on horseback, over the pond fly threads of drizzle. Heart-renting feels the garden, beyond the screen drift catkins in the wind.."
  },
  {
    "poem": "新綠小池塘，風簾動、碎影舞斜陽。羨金屋去來，舊時巢燕；土花繚繞，前度莓牆。繡閣裏、鳳幃深幾許？聽得理絲簧。欲說又休，慮乖芳信；未歌先噎，愁近清觴。遙知新妝了，開朱戶、應自待月西廂。最苦夢魂，今宵不到伊行。問甚時說與，佳音密耗，寄將秦鏡，偷換韓香？天便教人，霎時廝見何妨！",
    "translate": "Fresh green spreads across the little pond, The breeze curtains sways, against the setting sun patches of shadow play. Envious of the edifices here are returning swallows; From the earth grow many plants in bloom, surrounded by mossy walls. In her boudoir, where is she behind layers of drapes adorned with phoenixes? From where music of strings and pipes can be heard often. Wanting to words utter I said nothing, for I have broken many a promise; Before I can sing, choked with sobs I've become, as spirits has grief brought.From afar I can tell that she must have dressed up with make-up applied, The red gate gapes, towards the west chamber heads she to the moon admire. In agony will be my dreaming soul for I am unable to her side reach tonight. When could I let her know of a helpful revelation of a secret kind, That involves sending the mirror and swapping the incense of affectionate tales? Heaven would then show us grace, and allow us to meet for a little while!."
  },
  {
    "poem": "柳陰直，煙裏絲絲弄碧。隋堤上、曾見幾番，拂水飄緜送行色。登臨望故國，誰識？京華倦客。長亭路、年去歲來，應折柔條過千尺。閒尋舊蹤跡，又酒趁哀弦，燈照離席，梨花榆火催寒食。愁一箭風快，半篙波暖，回頭迢遞便數驛，望人在天北。淒惻，恨堆積。漸別浦縈回，津堠岑寂，斜陽冉冉春無極。念月榭攜手，露橋聞笛，沈思前事，似夢裏、淚暗滴。",
    "translate": "Drooping willows hang straight, which fog renders as strands of green. By the embankments built in Sui, I've seen them many a time As they caress the water and send their catkins adrift amid parting melancholy. I scale height to look towards the old capital, Who knows who I am? For I am a weary traveller retired from the capital's bustle. Along the path from the pavilion, one year goes and another comes, There must have been thousands of feet of willow twigs that have been plucked.These days I have time to old paths trace, Accompanied by wine and grieving strings, Burning bright still are lights, yet I have to retire from my seat, Pear blossoms and elm wood fire signify the approach of the Cold Fare Day. What saddens me is the wind that hurtles like an arrow, As I half-heartedly pole through pleasant wavesSoon I've left a fair distance and many ferry stops behind, And the one on my mind is in the north beyond the sky.How miserable, when regrets pile. By the waters I linger, along the sandy bay silence pervades, The sun slowly sets, yet spring prevails. I remember once I held her hand under the moon, As we listened to a flute play on the Bridge of Dew, Deep in thoughts I am, thinking of our bygone days, They all seem like dreams to me, in my solitude I let tears roll off my face.."
  },
  {
    "poem": "暗柳啼鴉，單衣竚立，小簾朱戶。桐花半畝，靜鎖一庭愁雨。灑空階、夜闌未休，故人剪燭西窗語。似楚江暝宿，風燈零亂，少年羈旅。遲暮，嬉游處。正店舍無煙，禁城百五。旗亭喚酒，付與高陽儔侶。想東園、桃李自春，小唇秀靨今在否？到歸時、定有殘英，待客攜尊俎。",
    "translate": "In the shade of willows crows caw,Long I stand with only a single layer of clothes, a screen hangs behind the red door. Blossoming away are half an acre of phoenix trees, Here locked in silence is a courtyard of melancholy drizzle. Awash are empty stairs, deep is the night yet there continues the rain, Much like old flames sharing a night over a dwindling candle by the west casement. It also resembles an night stay by a southern river, Where there'd be lights flickering in the wind, illuminating a young wayfarer like me.Late it is for sightseeing of interesting places. Cold and smokeless are stoves at the inn, The town has banned raising of fire for it's the one hundred and fifth day of the year. I call for a drink at the pavilion selling wine, For all fellow tipplers around. The East Garden comes to mind, where peach and prune trees blossom in spring, Yet is her delicate face with little lips there still? When it comes to my homecoming, there must be remnants of blossoms still, Waiting to be gathered by this traveller who wine brings.."
  },
  {
    "poem": "正單衣試酒，悵客裏、光陰虛擲。願春暫留，春歸如過翼，一去無跡。為問家何在？夜來風雨，葬楚宮傾國。釵鈿墮處遺香澤，亂點桃蹊，輕翻柳陌。多情為誰追惜？但蜂媒蝶使，時叩窗槅。東園岑寂，漸蒙籠暗碧，靜繞珍叢底。成歎息。長條故惹行客，似牽衣待話，別情無極。殘英小、強簪巾幘，終不似、一朵釵頭顫嫋，向人欹側。漂流處、莫趁潮汐，恐斷紅、尚有相思字，何由見得？",
    "translate": "I'm putting on a light robe to a banquet attend, Of the saddening life of a dejected wayfarer, precious time only go to waste. I hope spring could for one moment stay, Yet it lapses like flitting birds, once gone, they leave no trace. I'd like to ask “which way is home?”In a night storm, a beauty of the Chu palace was laid to rest. Her fragrance touched where her hairpins and jewellery had fallen, Petals fall along the peach blossom-lined creek or drift among rows of willows. For whom do I affections maintain? Nonetheless, there often come bees and butterflies to a match make, As they bump into window inlays.The East Garden is calm and still, becoming shrouded by shadows of greenery, That quietly surround the base of flowering clusters. There goes a sigh. Strands of willows seem intent on bothering passing wayfarers, As if tugging their clothes for a word, to endless parting emotions express. Tiny is this withered flower that can barely serve as a hairpin or a headdress, It is after all not quite a golden hairpin as it quivers by itself, Looking for someone to come to a rest. Now it has gone with the flow, let it encounter neither morning nor evening tides, For on the drifting red I've inscribed my wistful writing, How could it their undulation survive?."
  },
  {
    "poem": "河橋送人處，涼夜何其。斜月遠、墮餘輝，銅盤燭淚已流盡，霏霏涼露沾衣。相將散離會，探風前津鼓，樹杪參旗。華驄會意，縱揚鞭、亦自行遲。迢遞路回清野，人語漸無聞，空帶愁歸。何意重經前地，遺鈿不見，斜徑都迷。兔葵燕麥，向斜陽、欲與人齊。但徘徊班草，欷歔酹酒，極望天西。",
    "translate": "On the bridge over the river where I had seen you off, how cool the night is. Far and low inclines the moon, as it its splendour casts, On the bronze plate the candle has wept away all its tears, My clothes come into contact with cool dewdrops thick and fast. When we were finally about to part, The breeze carried the drumming from the wharf, stirring trees bearing starry flags. Bright is my horse that can my mind read, Even when I my whip apply, it knows to a slow pace keep.After some distance and many turns we've come to an open field, Gradually people's chatter fades, I've brought home nothing but melancholy. I wonder why I this same place return to, Lost jewellery can no longer be found, away I wander among the winding paths. There are only pulse plants and a field of barley Under the setting sun growing to match a person's height. I linger among them and gather some grass to sit on, I begin to drink as I sentimentalise and look out to the western sky.."
  },
  {
    "poem": "風老鶯雛，雨肥梅子，午陰嘉樹清圓。地卑山近，衣潤費鑪煙。人靜烏鳶自樂，小橋外、新綠濺濺。憑欄久，黃蘆苦竹，疑泛九江船。年年，如社燕，飄流瀚海，來寄修椽。且莫思身外，長近尊前。憔悴江南倦客，不堪聽、急管繁弦。歌筵畔，先安枕簟，容我醉時眠。",
    "translate": "The spring breeze is all but gone while oriole fledglings little remain, Rains plums nourish, in the afternoon mature trees' foliage refreshed seem. Remote is this place enclosed by mountains, Often damp are clothes that need to be dried over stoves.Quiet is this place where birds are at ease, Beyond the little bridge, before my eyes is the verdure and its green. By the balustrade long I stay, there are yellowing bamboos and reeds, That makes me wonder if I could just set sail for the Nine Rivers region.Year after year, I am like migratory swallows That fly over vast deserts and waters to nestle on rafters here. Let us not brood over matters beyond our control, but bring along always spirits. I am a weary wayfarer roaming the Yangtze's south, I cannot bear to hear elaborate music of pipes and strings. All I wish for is to have at the banquet a prepared pillow and bedding For me to sleep on when I become the worse for drink.."
  },
  {
    "poem": "水浴清蟾，葉喧涼吹，巷陌馬聲初斷。閒依露井，笑撲流螢，惹破畫羅輕扇。人靜夜久憑闌，愁不歸眠，立殘更箭。歎年華一瞬，人今千里，夢沉書遠。空見說、鬢怯瓊梳，容消金鏡，漸懶趁時勻染。梅風地溽，虹雨苔滋，一架舞紅都變。誰信無聊，為伊才減江淹，情傷荀倩。但明河影下，還看稀星數點。",
    "translate": "Moonlight floods, through rustling leaves wafts a cool breeze, Neighing of horses along streets and alleyways have just died away. Against an open well I idly lean, smilingly I wave to fireflies fan away, Only to my delicate, painted silk fan break. Against the balustrade long I lean in the deep of the night, Melancholy my sleep replaces while the timing arrow time keeps. Regretfully brief were my best years, now we are thousands of miles apart, Dreams have leaden become, and rare are letters, few and far between.I strive vainly to my hair and sideburns comb, The bronze mirror shows me losing flesh, slothful in keeping my look I've been. Scented by plum blossoms is the breeze and damp is the ground, The rain has a rainbow produced and nourished even mosses, Under the arbour, fallen petals have disappeared. There is no one who would believe that I've mundane become, Because of you I've lost my flair like Jiang Yan had lost his brush, Like Xun Qian who continued to dwell till he died in the loss of her beloved. Nonetheless there traverses the Milky Way and its gleam, Visible still are sparkles here and there few and far between.."
  },
  {
    "poem": "粉牆低，梅花照眼，依然舊風味。露痕輕綴，疑淨洗鉛華，無限佳麗。去年勝賞曾孤倚，冰盤同燕喜。更可惜、雪中高樹，香篝熏素被。今年對花最悤悤，相逢似有恨，依依愁悴。吟望久，青苔上，旋看飛墜。相將見、翠丸薦酒，人正在、空江煙浪裏。但夢想、一枝瀟灑，黃昏斜照水。",
    "translate": "Low is the white plastered wall, over which plum blossoms extend into sight, Giving off an aroma that is the same as ever. Dewdrops on petals condense, washed off seem to be their cosmetics, Revealing their spectacular beauty and elegance. Last year, at the grand viewing I gathered alone Some refreshing and fine tasting delicacies. Yet ever more precious are impressive tree among snow and ice, They are like an incense burner surrounded by a quilt of white.This year's blossom viewings come and go hastily, Which have been regretfully few leaving a lingering sense of depression. Long I stay to recite and gaze at what fall on green mosses From their whirling drift. Next time we meet, it could be time to savour wine made from these green fruits, And we're likely to be somewhere on an expansive river as we fog and billows face. Nevertheless I could still dream of a branch of handsome blooms That the water give a reflection of in the sunset.."
  },
  {
    "poem": "對宿煙收，春禽靜，飛雨時鳴高屋。牆頭青玉旆，洗鉛霜都盡，嫩梢相觸。潤逼琴絲，寒侵枕障，蟲網吹黏簾竹。郵亭無人處，聽檐聲不斷，困眠初熟。奈愁極頻驚，夢輕難記，自憐幽獨。行人歸意速，最先念、流潦妨車轂。怎奈向、蘭成憔悴，衛玠清羸，等閒時、易傷心目。未怪平陽客，雙淚落、笛中哀曲。況蕭索、青蕪國，紅糝鋪地，門外荊桃如菽。夜游共誰秉燭？",
    "translate": "Night fog has cleared away, quiet are spring fowls, From the roof comes the sound of pelting rain. Over the wall extends the green pennons of bamboos, That seem to have washed away all rouge and powder as their shoots interlace. The dampness of this weather strings loosen As coldness pillows and drapes penetrates, Among the bamboo grove insects fly into meshes of cobweb becoming stuck. There is no traffic at the house of mail exchange, Non-stop is the trickling sound off the eaves, I've just entered a sound sleep. Regretfully there is too much worry that comes to frighten me, Hard to catch are light-footed dreams, leaving me to pity my isolation.A traveller like me hopes for a prompt homecoming, Yet foremost on my mind is the worry that floods would coaches hold up. Regretfully this makes me thin and pallid like Lancheng once was, And weak and feeble like Wei Jie towards his end. On an ordinary day, such a sight is enough cause a heartache. I blame not Ma Rong when he in Pingyang stayed, Tears would come flowing from anyone who hears his mournful pipe play. After all I'm surround by desolation in a land of weeds, Where speckles of crimson the ground pave, Beyond the gate there grow cherries the size of peas, Who have I to venture the night together and share the candle flame?."
  },
  {
    "poem": "風消焰蠟，露浥烘爐，花市光相射。桂華流瓦，纖雲散、耿耿素娥欲下。衣裳淡雅，看楚女、纖腰一把。簫鼓喧、人影參差，滿路飄香麝。因念都城放夜，望千門如晝，嬉笑游冶。鈿車羅帕，相逢處、自有暗塵隨馬。年光是也、惟只見、舊情衰謝。清漏移、飛蓋歸來，從舞休歌罷。",
    "translate": "The wind sways the candle and its flame, and dew the lamp dampens, Under way is the lantern bazaar., brilliantly ablaze. The moon cast on roof tiles its flowing rays, Thin clouds scatter, perhaps getting ready for a descent by the moon goddess. Dressed in light and graceful clothes she would be, She is likely to resemble a southern lady with a delicate waist. Pipes and drums roar, people crowds gather and their shadows overlay, Throughout the streets waft a musky scent.Seeing as how the city's late-hour curfew is lifted for the night, Brightly lit are thousands of households to compare with daytime, Feeling happy and joyful everyone wanders around as they pleased. Present also are adorned carriages and silk kerchiefs, As they pass through, light dust horse hoofs trails. This is one of the best times of a year, Except waning is the mood I used to have. Nonetheless lapsed has time, I make my return in a hansom, Coming to an end are songs and dances.."
  },
  {
    "poem": "莫倚能歌斂黛眉，此歌能有幾人知？他日相逢花月底，重理。好聲須記得來時。苦恨城頭傳漏永，催起。無情豈解惜分飛，休訴金尊推玉臂。從醉，明朝有酒倩誰持？",
    "translate": "Don't let your skilful singing get to your shapely brows, How many others are there who could this song appreciate? Come another day when we meet again under the moon and blossoms, Let us sing it again. Wonderful music must be remembered along with those who it composed.How I detest the sound coming from the town tower tolling the passing of the night, Urging us to rise. How could the heartless the agony of moving apart comprehend? I cannot push away your lovely arm when you a chalice raise in front of me. In liquor I steep, Tomorrow when I drink, who'd be there to hand me cups of spirits.."
  },
  {
    "poem": "月皎驚烏棲不定，更漏將闌，轣轆牽金井。喚起兩眸清炯炯，淚花落枕紅緜冷。執手霜風吹鬢影，去意徊徨，別語愁難聽。樓上闌干橫斗柄，露寒人遠雞相應。",
    "translate": "Bright and clear is the moon, yet in consternation are crows on tree boughs. Deep in the night, the pail and the pulley hang by the well with gilded rails. As she wakes to my calls, her eyes open shining bright, Her tears fall, damping the cotton filling of the red pillow that is turning cold.We each other's hands hold as the frosty wind brush against her hair, I linger on as I take my leave, unbearable are the words of our parting sorrow. Upstairs beyond the balustrade stretches the Big Dipper, Wintry is the dewy air, cocks crow as the distance between you and I grows.."
  },
  {
    "poem": "怨懷無託，嗟情人斷絕，信音遼邈。縱妙手、能解連環，似風散雨收，霧輕雲薄。燕子樓空，暗塵鎖、一牀絃索。想移根換葉，盡是舊時，手種紅藥。汀洲漸生杜若，料舟依岸曲，人在天角。漫記得、當日音書，把閒語閒言，待總燒卻。水驛春回，望寄我、江南梅萼。拚今生、對花對酒，為伊淚落。",
    "translate": "I have no one to disclose my complaints to, For I've lost contact with my lover, receiving from her not a letter nor word. There may be someone with capable hands that could Connected Rings solve, Giving a outcome that seem to ease the wind and the rain, thin the fog and clouds. Empty is the Swallow Tower, Covered in dust is the lock and all furniture. I am tempted to graft and inarch the branches and roots of What I had once planted by hand, crimson peonies.The fragrant grass begins to grow on the sandy isle, As boats follow the water's edge, we each look at different corners of the sky. I can still recall when we were in correspondence, We'd talk casually about this and that, yet all those have since been set on fire. Spring has returned to this waterside lodge, How I hope someone could send me plum blossoms from south of the Yangtze. For what remains of my life, I could only in the company of spirits and blossoms, For your sake, let my tears roll.."
  },
  {
    "poem": "夜色催更，清塵收露，小曲幽坊月暗。竹檻燈窗，識秋娘庭院。笑相遇，似覺、瓊枝玉樹相倚，暖日明霞光爛。水盼蘭情，總平生稀見。畫圖中，舊識春風面，誰知道、自到瑤臺畔。眷戀雨潤雲溫，苦驚風吹散。念荒寒、寄宿無人館，重門閉，敗壁秋蟲歎。怎奈向、一縷相思，隔溪山不斷。",
    "translate": "Nocturnal shades drive away the hours of the night, mingled in dew is thin dust, Dim is moonlight that meanders along the alleyways. A lamp's glow comes through the window and the bamboo fence, This must be the garden where Lady Autumn once stayed at. Smilingly we meet, We are like embracing emerald boughs and jadeite trees, Colourful and magnificent are clouds in the warmth of sunshine. Her bright and spirited eyes are pure like orchids that I rarely see in my life.It is from paintings that I've come to an ancient beauty know, Who could've known that it leads to a dream of the Fairy Terrace. The touch and feel of intimacy has since lingered on, And I'm afraid of having my reverie dispelled as the wind blows. Then I remember the desolation I'm in, staying overnight at an empty inn, Behind many closed doors, through the shabby walls autumn insects drone. Be that as it may, my wistful feelings hanging by a thread Can creeks or mountains cross knowing no boundary at all.."
  },
  {
    "poem": "秋陰時晴漸向暝，變一庭淒冷。竚聽寒聲，雲深無雁影。更深人去寂靜。但照壁、孤燈相映。酒已都醒，如何消夜永？",
    "translate": "An autumn night like this goes from clear to dark and hazy, That transforms the garden into a bleak and wintry place. Long I stand to listen to the sound of coldness, Thick are clouds with no sight of wild geese, nor their trace.Deeper sinks the night, gone are people while silence pervades. Lighting the walls is a lamp glowing in isolation. Already awake from a drunken stupor, How do I pass the rest of the night that remains.."
  },
  {
    "poem": "上馬人扶殘醉，曉風吹未醒。映水曲、翠瓦朱檐，垂楊裏、乍見津亭。當時曾題敗壁，蛛絲罩、淡墨苔暈青。念去來、歲月如流，徘徊久、歎息愁思盈。去去倦尋路程，江陵舊事，何曾再問楊瓊？舊曲淒清，斂愁黛、與誰聽？尊前故人如在，想念我、最關情。何須渭城，歌聲未盡處，先淚零。",
    "translate": "Someone gives my drunken self a hand in mounting the horse, Morning breezes puff through, yet they sober me not. Reflected in the rippling water are green tiles and crimson eaves, Through veils of dropping willows, I a ferry terminal come across. Once upon a time I wrote on the now failing wall an inscription, Covered in cobwebs it is, over the fading ink mosses grow. I think of what has come and gone, years like water have flowed by, Long I hang about, infused with autumn thoughts are my sighs.I've grown tired of revisiting where I had been, Whatever happened in Jiangling, Why bother at all asking Yang Qiong of it again? An old melody dreary sounds, Locking listeners' brows in frowns, yet for whom is it performed? If she was here before me, She'd behold me most attentively with the greatest devotion. I need not hear the Melody of the Town of Wei, Before the song is sung to its end, my tears have begun to flow.."
  },
  {
    "poem": "隋堤路，漸日晚、密靄生煙樹。陰陰淡月籠沙，還宿河橋深處。無情畫舸，都不管、煙波隔前浦。等行人、醉擁重衾，載將離恨歸去。因思舊客京華，長偎傍、疏林小檻歡聚。冶葉倡條俱相識，仍慣見、珠歌翠舞。如今向、漁村水驛，夜如歲、焚香獨自語。有何人、念我無聊，夢魂凝想鴛侶。",
    "translate": "Along the street that follows the Sui canals, As evening hours approach, over trees rises mist that thick clouds turn into. Enshrouding the sandbar is the subdued shine of a pale moon. Deep in a recess under a bridge for another night I moor. Emotionless are those decorated boats, Which are not concerned at all with the misty billows in the waters ahead. They bide their time as travellers drunk become and layers of quilts embrace, Ferrying away their parting sorrows and regrets.I thus think of my time in the capital, Long I used to lean on the balustrade among a sparse wood with a joyful company. No stranger with courtesans and women of the streets I was, Familiar was I with their splendid singing and dazzling dancing. Yet here I am now, in a fishing village by a wharf, Where a night drags on like a year, I mutter to myself as incense burns. I wonder who is there that can my monotonous life feel for, For I still dream of having a loving partner with my heart and soul.."
  },
  {
    "poem": "佳麗地，南朝盛事誰記？山圍故國繞清江，髻鬟對起。怒濤寂寞打孤城，風檣遙度天際。斷崖樹，猶倒倚，莫愁艇子誰繫？空餘舊跡鬱蒼蒼，霧沈半壘。夜深月過女牆來，傷心東望淮水。酒旗戲鼓甚處市？想依稀、王謝鄰里，燕子不知何世，向尋常、巷陌人家，相對如說興亡，斜陽裏。",
    "translate": "In this prosperous region, who remembers the South's grand eras? Mountains and fields of the countryside and the winding Yangtze Surround and build up away from the city. Raging billows like loneliness towards a solitary castle heave, On the distant horizon navigate sails and masts of ships.Off the precipice rugged trees overhang still, Who still comes here to secure the boat of a gent who never worried? All that remains on a historic site is sentimentality. And fog has come to one half of a castle conceal. Deep in the night, over the parapet the moon shines, In grief I look towards the east where pass the waters of River Huai.What a flourishing city full of wine vendors' pennants and operatic drumming! Faint is the memory of the Wangs, the Xies and their neighbourhoods, Swallows have come and gone for generations that all have lost count of. There are now ordinary people along the same streets and alleyways, Telling tales of the rise and fall of former times in the setting sun.."
  },
  {
    "poem": "悄郊原帶郭，行路永、客去車塵漠漠。斜陽映山落，斂餘紅，猶戀孤城闌角。凌波步弱，過短亭、何用素約？有流鶯勸我，重解繡鞍，緩引春酌。不記歸時早暮，上馬誰扶？醒眠朱閣。驚飆動幕，扶殘醉、繞紅藥。歎西園，已是花深無地，東風何事又惡？任流光過卻，猶喜洞天自樂。",
    "translate": "Fields of the countryside quietly surround the town walls, Long is the journey that sees passing travellers' carriages leaving dusty trails. The setting sun behind glowing mountains falls, Twilight weakens and lingers around the lonely town's corners and rails. Lissom was she as she waltzed along, Passing through the little pavilion, why the need of making a commitment? Flitting orioles offered me an advice, so again I undid my embroidered saddle, And unhurriedly I spring wine sipped at.I don't remember when I returned as evening arrived early, Who helped me onto my horse? I woke to find myself in an adorned chamber. Here comes gales to stir curtains and drapes, I bring myself, rather drunk still, to among the peonies pace. I feel for the West Garden, for there is no ground that's not covered in petals. Oh easterlies, what has yet again instigated your rage? As time must pass, so let it be, For blissful and joyful is the time spent detached from the worldly.."
  },
  {
    "poem": "晝陰重，霜凋岸草，霧隱城堞。南陌脂車待發，東門帳飲乍闋。正拂面垂楊堪攬結，掩紅淚、玉手親折。念漢浦離鴻去何許？經時信音絕。情切，望中地遠天闊，向露冷風清，無人處，耿耿寒漏咽。嗟萬事難忘，惟是輕別。翠尊未竭，憑斷雲留取，西樓殘月。羅帶光消紋衾疊，連環解、舊香頓歇；怨歌永、瓊壺敲盡缺。恨春去、不與人期，弄夜色、空餘滿地梨花雪。",
    "translate": "The day is leaden, wilted by frost are grasses by the shore, Enshrouded in fog is the tower of the town. In the field south of the town is a luxurious carriage ready to depart, By the East Gate the farewell banquet is drawing to a close. Swaying in front asking me to stay are drooping willows, She wipes away her tears, and picks a sprig for me with her bare hands. Where to have the wild geese from Hangpu flitted? It has been long without word on where they have been.Stirred by sentiments, before my eyes lie the expansive land and the vast sky. As I face the chilly dew and breeze, there is no one around, All I have with me is my sob throughout the night hours. I say the most indelible of all is the sorrow of parting. I haven't yet my jade cup emptied, Pray that a cloud remnant could a waning moon over the west chamber keep. Losing its shine is the silk lace of a worn and wrinkled quilt, Loose is the fragrant sachet, spent is the scent. My singing of lament goes on, so does my drumming that jags a jade pot. Regretfully the passing of spring abides by no-one, Against the colour of the night, on the ground scatter snowy pear blossoms.."
  },
  {
    "poem": "條風布暖，霏霧弄晴，池臺徧滿春色。正是夜堂無月，沉沉暗寒食。梁間燕，前社客。似笑我、閉門愁寂。亂花過、隔院芸香，滿地狼藉。長記那回時，邂逅相逢，郊外駐油壁。又見漢宮傳燭，飛煙五侯宅。青青草，迷路陌。強載酒、細尋前迹。市橋遠、柳下人家，猶自相識。",
    "translate": "The spring breeze warmth spreads, bright light the fog breaks, All over the terrace by the pond spread vernal shades. Right now in the courtyard there is no sight of the moon, In the darkness approaches the Day of Cold Fare. Those swallows on the beams must have been here before. They seem to be deriding my worrying alone behind close doors. Drifting petals whirl by, wafting flowery scents to the gardens of my neighbours, Leaving on the ground fallen blossoms in disarray.I still remember that time when we met by chance In the countryside where there parked a carriage of polished wood.. I saw what seemed like a relay of candlelight in the Han Palace, Giving rise to smoke that finds its way into the estates of a pentad of aristocrats. Green is the verdure, hard to discern in the fields are tracks. Wittingly I wine bring along as I the past trace. Near the town bridge in the distance, by the willows locates a household, It turns out that we do each other know.."
  },
  {
    "poem": "葉下斜陽照水，捲輕浪、沈沈千里。橋上酸風射眸子，立多時，看黃昏、燈火市。古屋寒窗底，聽幾片、井桐飛墜。不戀單衾再三起，有誰知，為蕭娘、書一紙？",
    "translate": "Through the leaves the setting sun on water shines, Light waves heave, rippling away for a thousand miles. On the bridge the piercing wind my eyes hurt, Long I stand there at sunset watching the city becoming aglow with lights.By the plain window of an old chalet, I listen to a few leaves taking their fall from the phoenix tree by the well. Feeling attached to a light quilt I am not, time and again I rise, Yet who would know that it is for Lady Xiao that I a letter write?."
  },
  {
    "poem": "凌波不過橫塘路，但目送、芳塵去。錦瑟華年誰與度？月橋花院，瑣窗朱戶，只有春知處。飛雲冉冉蘅皋暮，彩筆新題斷腸句。試問閒愁都幾許？一川煙草，滿城風絮，梅子黃時雨。",
    "translate": "Lissom and graceful are a lady's steps, yet she'll never walk towards where I live, Nonetheless my eyes follow her as she leaves behind her dusty trail. Who have I to spend my youthful days with? On an arched bridge, in a blooming garden, or behind green windows and red doors, Where my lady could be, only spring knows.Under drifting clouds, the night veils over the pond surrounded by fragrant verdure, I pick up a brush to compose more heartbroken verses. How much idle melancholy can one hold? As much as a river of creeping weeds, a town of whirling blossoms, And a season of constant drizzling rains as plums ripen.."
  },
  {
    "poem": "上東門，門外柳，贈別每煩纖手。一葉落，幾番秋，江南獨倚樓。曲闌干，凝竚久，薄暮更堪搔首。無際恨，見閒愁，侵尋天盡頭。",
    "translate": "Towards the East Gate we made our way, passing by willows outside the gate, As we go our separate ways, your delicate hand their shoots pick time and again. At the fall of a leaf see another arrival of fall, Alone at the Yangtze's south I the balustrade of a high rise lean against.By the balustrade that extends and winds, long I stand there and gaze, I scratch my head pondering in the twilight haze. Without end spread my regrets that sorrows unveil, Across the sky they permeate in search of its end.."
  },
  {
    "poem": "蘭芷滿汀洲，游絲橫路。羅襪塵生步，迎顧，整鬟顰黛，脈脈兩情難語。細風吹柳絮、人南渡。回首舊游，山無重數。花底深朱戶，何處？半黃梅子，向晚一簾疏雨。斷魂分付與、春將去。",
    "translate": "Comfreys and angelicas cover the sandbar, traversing the tracks are their rootlets. Stained with dust are my socks as I saunter along towards you, As you your hair bun adjust and frown ease, As our eyes meet, words cannot express the deep affection they exude. A light breeze wafts through willow strands, on a ferry I southwards move.I think of old acquaintances, how we are all separated by myriads of mountains. Among blossoms so deep hide scarlet doors, where are they? Half ripened are plums, That have just come through an evening shower of light rain. I'm losing my soul as spring takes off taking my spirit away.."
  },
  {
    "poem": "淡妝多態，更的的、頻回眄睞。便認得、琴心先許，欲綰合歡雙帶。記畫堂、風月逢迎，輕顰淺笑嬌無奈。向睡鴨爐邊，翔鴛屏裏，羞把香羅暗解。自過了、燒燈後，都不見、踏青挑菜。幾回憑雙燕，丁寧深意，往來卻恨重簾礙。約何時再，正春濃酒困，人閒晝永無聊賴。厭厭睡起，猶有花梢日在。",
    "translate": "Light make-up enhances her coquetry and elegance, Ever more enchanting she becomes every time she turns her head. I am reminded of the tale of Sima's cittern play that won the heart, That led them to paired nuptial sashes wear. I remember the days in the elaborate hall, so much fondness and submission, Slight were her frowns and light her smiles, endless was her charm. As we lay next to the incense burner in the shape of sleeping ducks, Behind the screen embroidered with mandarin ducks wading the water, Bashful was she as she her fragrant robes untied in the dark.Ever since the Festival of Lanterns, We haven't had the chance to the countryside or the street market visit. There have been many a time I wished to the paired swallows entrust With my devotion and attentive words, Yet regretfully getting in the way are layers of hindering screens. No one knows when we could reunite, as I steep in wine in the height of spring, Being an idler I find the day long and tedious to the extreme. Lethargic I remain as I wake from sleep, There the sun still shines on the tips of flowers and sprigs.."
  },
  {
    "poem": "不信芳春厭老人，老人幾度送餘春？惜春行樂莫辭頻。巧笑艷歌皆我意，惱花顛酒拚君瞋，物情惟有醉中真。",
    "translate": "I do not believe that spring would the aged dislike, For how many more chances do they have for seeing off vernal times? To spring cherish, they should not decline occasions to indulge in its delight.Lovely smiles and pleasant singing are all to my liking, You may frown at my drinking spree for which the flowers are liable for the blame I find, Yet everything and everyone at their truest are only seen through drunken eyes.."
  },
  {
    "poem": "樓角初消一縷霞，淡黃楊柳暗棲鴉，玉人和月摘梅花。笑撚粉香歸洞戶，更垂簾幕護窗紗，東風寒似夜來些。",
    "translate": "Shreds of colourful clouds vanish behind the corner of the high rise, Between yellowing willows rest crows in the shade, There she is plucking a twig of plum blossom basked in moonlight.She holds the fragrant, pastel blooms smilingly as she returns to her privacy, Behind the window screen she lets down curtains and drapes, For easterlies tend to wintry become as deeper sinks the night.."
  },
  {
    "poem": "薄雨收寒，斜照弄晴，春意空闊。長亭柳色才黃，倚馬何人先折？煙橫水漫，映帶幾點歸鴻，平沙消盡龍荒雪。猶記出關來，恰如今時節。將發，畫樓芳酒，紅淚清歌，便成輕別。回首經年，杳杳音塵都絕。欲知方寸，共有幾許新愁？芭蕉不展丁香結。憔悴一天涯，兩厭厭風月。",
    "translate": "Abated is the chill after the passing of the drizzle, Clearing the sky is a setting sun, expanding in the air is the feel of spring. Around the pavilion and along its gallery willows have begun to yellow, Of those on horseback, who is the first to a sprig pick? Fog extends across the vast waters that a few returning wild geese reflect, Snow on this barren land has all but into the desert sands disappeared. I still remember when I the border crossed, it was in the very same season.When it was time to depart, on an adorned high rise with good wine, Arias were accompanied by emotional tears, and soon came goodbye. A year has since passed and now I look back, We have been so far out of each other's reach all this time. I would like to know in our hearts, how much new sorrows have there piled? Not yet spread out are plantain leaves, nor have cloves budded. Wilted we each have in a corner of the world, Growing tired of the scenery that reminds us of our pleasurable times.."
  },
  {
    "poem": "幾許傷春春復暮，楊柳清陰，偏礙游絲度。天際小山桃葉步，白蘋花滿湔裙處。竟日微吟長短句，簾影燈昏，心寄胡琴語。數點雨聲風約住，朦朧淡月雲來去。",
    "translate": "How often I have sentimentalised spring, yet spring still comes to its end, Under willows slight is the shade, that seem to get in the way of flowing threads. At the horizon by a mount, where a lady named Peach Leaf used to visit on foot, Where she used to clothes wash, drifting duckweeds are blooming.All day I new verses long and short chant and mutter, Through the curtains gleams of light escape, as the Hun strings my heart reveal. The pitter-patter of the rain is kept out by the wind that sweeps, Faint is a hazy moon as clouds gather and scatter.."
  },
  {
    "poem": "牛渚天門險，限南北、七雄豪占。清霧斂，與閒人登覽。待月上潮平波灩灩，塞管輕吹新阿濫。風滿檻，歷歷數、西州更點。",
    "translate": "Strategically located is the unapproachable gate of this massive isle, Which the north and the south divides, that all war lords seek to occupy. Fog and smoke have lifted, making it available for the idle to scale and gather sights.When the moon comes over the quiet waters with ripples sparkling brightly, I'd suggest a new rendition of “the Warbles” on Hun pipes. In the breeze drifting over the railing, I can hear distinctly night-hour gongs coming from the direction of the West Shire.."
  },
  {
    "poem": "煙絡橫林，山沉遠照，迤邐黃昏鐘鼓。燭映簾櫳，蛩催機杼，共苦清秋風露。不眠思婦，齊應和、幾聲砧杵。驚動天涯倦宦，駸駸歲華行暮。當年酒狂自負，謂東君、以春相付。流浪征驂北道，客檣南浦，幽恨無人晤語。賴明月、曾知舊游處，好伴雲來，還將夢去。",
    "translate": "A shroud of mist permeates the woods, twilight sinks behind distant mountains, And evening bell tolls diffuse throughout. Candles project light onto windows and curtains, crickets urge weavers on, For all are in dread of the winds and dew of high autumn. There is one wakeful, pondering lady, Who must be heeding the sound of garment pressing. Such resonance can even a tired officer in a far corner reach and upset, For soon old age shall befall him as he progress towards his life's end.I was once vainglorious and a bacchanalian, Asking of easterlies to entrust spring in me forever. Later I roamed the northland on horseback, Followed by my travels by boat along the southern waterways, Yet I have no one around to my deep regrets comprehend. Thanks to the glowing moon, which knows where I have been, It arrives accompanied by clouds, and sees off my dreams as it takes its leave.."
  },
  {
    "poem": "厭鶯聲到枕，花氣動簾，醉魂愁夢相半。被惜餘熏，帶驚賸眼，幾許傷春春晚。淚竹痕鮮，佩蘭香老，湘天濃暖。記小江、風月佳時，屢約非煙游伴。須信鸞弦易斷，奈雲和再鼓，曲中人遠。認羅襪無蹤，舊處弄波清淺。青翰棹檥，白蘋洲畔，儘目臨皋飛觀。不解寄、一字相思，幸有歸來雙燕。",
    "translate": "Annoying is the warble of orioles that my pillow reach, Through the drapes drift flowery scents, Still inebriated is my soul, one half steeped in melancholy and the other in a reverie. The quilt some fragrance retains, I've very few holes left to tighten on my belt. Easily gone is spring that leaves me emotional spring after spring. Spots on bamboos are tear marks still fresh, Yet faint is the potpourri pouch's orchid scent, Nonetheless, warm and cosy is Xiang's weather. I remember once upon a time on this river, splendid was the scenery, Many a time a lady of the like of Never Misty came to our party.One must accept that a rematched string breaks easily, Regardless whether the instrument is a zither or a cittern, Once far and away goes someone, there leaves only sorrows in a melody. Nowhere to be found are traces where her silk stockings have been, Where we once were to ripples make have shallow become. Paddling on a green boat with carvings of birds passing by flowering duckweeds, I see many high rises and adorned pavilions along the shores. I don't know how to put in the post my pining thoughts, Luckily I see a pair of swallows on their way home.."
  },
  {
    "poem": "玉人家，畫樓珠箔臨津。托微風、彩簫流怨，斷腸馬上曾聞。宴堂開、艷妝叢裏，調琴思、認歌顰。麝蠟煙濃，玉蓮漏短，更衣不待酒初醺。繡屏掩、枕鴛相就，香氣漸暾暾。回廊影、疏鐘淡月，幾許消魂？翠釵分、銀箋封淚，舞鞋從此生塵。任蘭舟、載將離恨，轉南浦、背西曛。記取明年，薔薇謝後，佳期應未誤行雲。鳳城遠、楚梅香嫩，先寄一枝春。青門外，只憑芳草，尋訪郎君。",
    "translate": "Within her estate is a scenic waterside pavilion with beaded screens. Carried by the breeze is impressive flute play expressing grievance, Such heart-renting music can be heard by those passing by on horseback. In use is the banquet hall, full of dressed up femininity, They are fine-tuning their strings, and I can her voice recognise still. Musky candles dense smoke give, nearly full is the jade lotus that time keeps, I must go and get changed though I'm not even tipsy yet. I pull the embroidered screen over, and line up a pair of pillows, Gradually a fragrant scent the chamber fills. Along the gallery shadows play, the bell toll is faint and the moonlight soft, What a surreal experience this has been!Ever since breaking the jade hairpin in half and sealing silvery notes with tears, Her dancing shoes have been collecting dust. Many a magnolia canoe have been loaded with parting grief, As they sail along southern waterways against the setting sun in the west. I shall remember next year, around this time after the rosebushes have wilted, I do hope our rendezvous won't be declined by her. Far and away is the Phoenix City, fragrant and delicate are southern plums, I shall send her spring, a sprig of plum blossom. Beyond the Blue Gate, she could only follow the spread of verdure  As she looks for traces of her gentleman.."
  },
  {
    "poem": "寒水依痕，春意漸回，沙際煙闊。溪梅晴照生香，冷蕊數枝爭發。天涯舊恨，試看幾許消魂？長亭門外山重疊。不盡眼中青，是愁來時節。情切，畫樓深閉，想見東風，暗消肌雪。孤負枕前雲雨，尊前花月。心期切處，更有多少淒涼，殷勤留與歸時說。到得再相逢，恰經年離別。",
    "translate": "On the water frozen streaks remain as spring comes around slowly, Across the sandbar permeates mist. Under the sun effervescently fragrant are blooming plum trees by the creek With sprigs of sparse buds eager to burst into a blossom. At the world's end with old regrets, does anyone know how it grieves the soul? Beyond the pavilion, the gallery and the gates, ranges of mountains fold. Endless is the blue that enters my sight, it's a season predisposed to woes.Emotionally stirred, it springs to mind that the pavilion is behind locks, How I long for easterlies for I've somehow pallid become and losing flesh. I've turned my back on our intimacy and pillow talk, And beautiful scenes that we shared as we drank. What my heart wishes for and all the misery it has suffered, Let us only attend to those when I have made my way home. When we see each other again, we will have been parted for a year or so.."
  },
  {
    "poem": "捲珠箔，朝雨輕陰乍閣。闌干外、煙柳弄晴，芳草侵階映紅藥。東風妒花惡，吹落梢頭嫩萼。屏山掩、沉水倦熏，中酒心情怯杯勺。尋思舊京洛，正年少疏狂，歌笑迷著。障泥油壁催梳掠，曾馳道同載，上林攜手，燈夜初過早共約，又爭信飄泊。寂寞，念行樂。甚粉淡衣襟，音斷弦索。瓊枝璧月春如昨。悵別後華表，那回雙鶴。相思除是，向醉裏、暫忘卻。",
    "translate": "I raise the beaded screen, an early rain has come to a stop on a greyish day. Outside the balustrade, swaying willows in occasional sunshine bathe, The verdure onto stairs encroaches contrasting the crimson of peonies. Easterlies growing jealous of flowers Blow tender petals off budding sprigs. I pull out the blind set, the musky scent of the wood makes me heavy-eyed, I've become experienced in drunkenness that I hesitate to more imbibe.I recount bygone times in the ancient capital cities of Changan and Luoyang, How spirited and uninhibited youths indulged in singing and dancing. Well-equipped horses and polished carriages used to rush the well-dressed, And sped along the avenues together, then at the palatial garden they'd hold hands, At the first light of evening they'd have rendezvous to attend, Who spared a thought on what it would be like to drift from place to place?Loneliness sets in when we think of happy days. Faded have clothes as collars pale, When the strings are played broken are notes along the scale. Sprigs and the moon as delicate as jade and springtime are things of yesterday. Evocative of regrets are those palatial columns, to which return pairs of cranes. Such longing could only be Drowned in intoxication, but only ever temporarily mislaid.."
  },
  {
    "poem": "睡起流鶯語，掩蒼苔、房櫳向晚，亂紅無數。吹盡殘花無人見，惟有垂楊自舞。漸暖靄、初回輕暑，寶扇重尋明月影，暗塵侵、上有乘鸞女。驚舊恨，遽如許。江南夢斷橫江渚，浪黏天、葡萄漲綠，半空煙雨。無限樓前滄波意，誰采蘋花寄取？但悵望、蘭舟容與，萬里雲帆何時到？送孤鴻、目斷千山阻。誰為我，唱金縷？",
    "translate": "I wake to orioles' warbling chatter, Over mosses on houses twilight hovers, And everywhere countless drifting petals scatter. Blown away are these remnants of blossoms that no one ever sees again. Leaving willows by themselves to frolic and sway. The weather gradually warms up, summer days begin to arrive, Out comes silk fans in search of the moon and its shine, Then come veiling clouds on which ride the moon goddess and her entourage. Old regrets come to mind, how hastily passes time.Here I am in the Yangtze's south recovering from a dream on a boat in a stream, Where billows the sky reach and green waves undulate in the shape of grapes, And in the air shrouds misty rain. Before my eyes glaucous ripples spread far and wide, Who would like to duckweed flowers pick and send? I stare in disappointment as I have only a magnolia canoe, When could it tens of thousands of leagues sail through? I farewell a lone wild goose, yet I lose sight of it among myriads of peaks. Who is around to sing me a song to Golden Strands' tune?."
  },
  {
    "poem": "落花已作風前舞，又送黃昏雨。曉來庭院半殘紅，惟有游絲，千丈嫋晴空。殷勤花下同攜手，更盡杯中酒。美人不用斂蛾眉，我亦多情，無奈酒闌時。",
    "translate": "Fallen blossoms are dancing in the wind as they drift, Come again has the evening rain. Dawn arrives to find the courtyard half cover in crimson that has perished, Only willows gracefully sway thousands of their yard-long strands in the air.Under blossoms we each other's hand hold affably, And eagerly drink our cups dry. Oh pretty lady, frown not with your delicate brows, For I am also emotional, yet becoming empty on wine we are and late is the hour.."
  },
  {
    "poem": "新月娟娟，夜寒江靜山銜斗。起來搔首，梅影橫窗瘦。好箇霜天，閒卻傳杯手。君知否？亂鴉啼後，歸興濃如酒。",
    "translate": "Graceful is the new moon, Wintry is the night, quiet the river surface, as the Big Dipper hangs over the hill. I rise to claw my locks, on the window lanky is the silhouette of plum sprigs.What a frosty weather, Yet idle is the hand that has no reason to raise a drink. Do you know how I feel?After a roar of duck quacks, the urge to home return is as strong as spirits.."
  },
  {
    "poem": "曉光催角，聽宿鳥未驚，鄰雞先覺。迤邐煙村，馬嘶人起，殘月尚穿林薄。淚痕帶霜微凝，酒力沖寒猶弱。歎倦客，悄不禁重染，風塵京洛。追念人別後，心事萬重，難覓孤鴻託。翠幌嬌深，曲屏香暖，爭念歲華飄泊。怨月恨花煩惱，不是不曾經著。者情味、望一成消減，新來還惡。",
    "translate": "The sound of bugle is rushed along by the early light, Though birds have not yet risen from their sleep, Already awake are crowing roosters nearby. Fog spreads and scatters over the village where horses neigh and villagers rise, Through the woods the setting moon still shines. Tear streaks a light film of frost form, Somewhat weak are spirits that against the chill warmth provide. A weary wayfarer of the world I am, who has become rather unable to endure The capital's scenery and hardship rendered on life.It comes to mind that ever since our parting, she's been weighing on my mind, Hard to find is a wild goose which could my pining convey. Layers of viridescent drapes depth create, winding screens scented warmth guides, What knows them of the drift of a man in his twilight. Laying blames on the moon and blossoms for all the misery I've come across Is not something I haven't previously tried. This kind of mood hopefully gets curtailed, Yet it tends to come back ever more intensified.."
  },
  {
    "poem": "裁翦冰綃，輕叠數重，淡著燕脂勻注。新樣靚妝，艷溢香融，羞殺蕊珠宮女。易得凋零，更多少、無情風雨。愁苦，問院落淒涼，幾番春暮？憑寄離恨重重，者雙燕何曾，會人言語？天遙地遠，萬水千山，知他故宮何處？怎不思量？除夢裏、有時曾去。無據，和夢也、新來不做。",
    "translate": "I make a few cuts of white voile and overlay them into a few piles, On which I smooth out blusher and rouge colouring them pastel. It's a new kind of make-up that dazzles with an infused fragrance, Paling in comparison are maids of the Palace of the Budding Pearls in heaven. Yet they shall soon wither away, Not taking into account the onslaught of heartless windswept rains. How miserable, I ask of the desolate garden and courtyard, How brews the mood depressed by the approach of spring's end?I'd like to send it along with my myriads of parting sorrows and grief, Yet when have these paired swallows ever been able to our words convey? Being beneath far-flung skies on distant lands, With countless mountain peaks and rivers of water in between, Which direction lies the Palace of the good old days? How could I not yearn after what once were? Only ever in dreams when I'd sometimes there return. Yet it is all losing ground, lately of homecoming I dream no more.."
  },
  {
    "poem": "頻聽銀籤，重燃絳蠟，年華袞袞驚心。餞舊迎新，能消幾刻光陰？老來可慣通宵飲？待不眠、還怕寒侵。掩清尊、多謝梅花，伴我微吟。鄰娃已試春妝了，更蜂腰簇翠，燕股橫金。勾引東風，也知芳思難禁。朱顏那有年年好，逞艷游、贏取如今。恣登臨、殘雪樓臺，遲日園林。",
    "translate": "Frequently strikes the sound of the timepiece's silvery hand, Again comes the time to set alight candles made of red wax, Years have gone by in such a hurry that disturbs my soul. I see off the old and greet the new, Yet how much time does that help to idle away? Have I become used to drinking throughout the night as I age? When I wakeful become, afraid of catching a cold I am. I put my hand over my cup as plum blossoms drift by To accompany me as I verses mutter and recite.Young maids nearby have begun to don spring clothes, Who have gathered up their hair with jade pieces And golden hairpins in the shape of a swallow tail. Seductive they are to easterlies, Which know well how vernal sentiments are difficult to suppress. Florid appearances are hard to maintain year after year, Such splendour should be enjoy in the moment to seize the day. Thus I make a climb uninhibitedly for the the terrace still covered in melting snow, To look at the gardens in the sunset's glow.."
  },
  {
    "poem": "瀟灑江梅，向竹梢疏處，橫兩三枝。東君也不愛惜，雪壓霜欺。無情燕子，怕春寒、輕失花期。卻是有、年年塞雁，歸來曾見開時。清淺小溪如練，問玉堂何似，茅舍疏籬？傷心故人去後，冷落新詩。微雲淡月，對江天、分付他誰。空自憶、清香未減，風流不在人知。",
    "translate": "By the river elegant plum blossoms Towards groves of bamboos Extend a sprig or two. Yet easterlies their presence cherish not, Leaving them to the tyranny of snow and frost. Unfeeling seem swallows, Which are afraid of the vernal chill and of missing out on the season of bloom. Yet there are still those wild geese from over the northern border, Which may have seen blossoms on their return.Shallow is the creek, lucid like a jade belt, How could extravagant high rises ever compare to An ordinary cabin and picket fences? Broken-hearted I have been since the departure of an old friend, I've been dispirited to even new verses write. Under shreds of clouds and pale moonlight, In front of a creek and a sky, who have I to share the time? Anyhow it crosses my mind that these blossoms do not their fragrance moderate, Their romantic aspirations need not be exposed for all to comprehend.."
  },
  {
    "poem": "高詠楚詞酬午日，天涯節序怱怱。榴花不似舞裙紅，無人知此意，歌罷滿簾風。萬事一身傷老矣，戎葵凝笑牆東。酒杯深淺去年同，試澆橋下水，今夕到湘中。",
    "translate": "Loudly I recite the Chu Verses to pass the afternoon of summer solstice, Among remote corners of the world I roam as seasons hurry along. Pomegranate blossoms are no comparison to a whirling dress in red, Though no one understands what it means to convey, At the end of the dance there comes a breeze to curtains raise.There are myriads of things I'd like to do yet I've become senile, East of the parapet wild cottons bloom brightly. I can hold my liquor as well as I could last year, I stir the water beneath the bridge, Hoping tonight it can the Xiang region reach.."
  },
  {
    "poem": "憶昔午橋橋上飲，坐中多是豪英。長溝流月去無聲，杏花疏影裏，吹笛到天明。二十餘年如一夢，此身雖在堪驚。閒登小閣看新晴，古今多少事，漁唱起三更。",
    "translate": "In the bygone era how they used to drink on the Midday Bridge, Among them sat many a fearless and gallant man. Water runs in long channels that reflect the moon in silence, Among sparse shadows of apricot blossoms, I reed play till daylight dawns.Twenty years have gone by like a dream, Although I'm still alive, it has been no less horrifying. At leisure I make a climb for the cockloft to fine weather enjoy. Throughout the ages much has happened, Now I hear fishermen's singing as midnight approaches.."
  },
  {
    "poem": "雁落平沙，煙籠寒水，古壘鳴笳聲斷。青山隱隱，敗葉蕭蕭，天際暝鴉零亂。樓上黃昏，片帆千里歸程，年華將晚。望碧雲空暮，佳人何處？夢魂俱遠。憶舊游、邃館朱扉，小園香徑，尚想桃花人面。書盈錦軸，恨滿金徽，難寫寸心幽怨。兩地離愁，一尊芳酒，淒涼，危闌倚徧。盡遲留、憑仗西風，吹乾淚眼。",
    "translate": "Wild geese land on the sandbar, mist shrouds over the cold river water, No longer blaring is the sound of bugles from the ancient fort. Faint is the blue mountains, decayed have rustling leaves, In the sky hover evening crows here and there still. The upstairs basks in twilight, In sight are sails that must have travelled thousands of leagues to home return, Late it gets as so much time has gone by. I gaze at the dusky clouds in the sky, where now resides the lovely lady? My dreaming soul has distanced itself far and away.I reminisce about where I've been behind red doors and deep within an estate, Along petal-paved garden paths, I spontaneously think of her florid face. Even if I'd taken up a whole roll of silk to a letter writeAnd expressed my lament through golden strings, Hard to compose is my bitterness at heart. Parted are our parting sorrows, in the company of wine I feel miserable, I've leaned against every balustrade of this high rise. Although it's getting late, I linger on, hoping to rely on westerlies To blow dry my teary eyes.."
  },
  {
    "poem": "數聲鶗鴂，可憐又是、春歸時節。滿院東風，海棠鋪繡，梨花飄雪。丁香露泣殘枝，算未比、愁腸寸結，自是休文，多情多感，不干風月。",
    "translate": "There sound warbles of cuckoos, It's a pity that there goes again the vernal season. With a garden of easterlies, cherry-apple trees have begun to unfold their blooms, And drifting like snow are pear blossoms.On what remain of clove trees condense tearful dew, Yet they never can compare with my heart-renting gloom, I'm much like Xiuwen once was, emotional and sentimental, Yet romantic I am not.."
  },
  {
    "poem": "一點殘釭欲盡時，乍涼秋氣滿屏幃。梧桐葉上三更雨，葉葉聲聲是別離。調寶瑟，撥金猊，那時同唱鷓鴣詞。如今風雨西樓夜，不聽清歌也淚垂。",
    "translate": "About to burn to its end is the last of the candle remains, A sudden chill of autumn ripples the curtains and drapes. On leaves of phoenix trees fall the midnight rain, Expressing parting sorrows is every leaf in every susurration.I once tuned the fine zither and stirred the precious incense burner, Then we sang together the Partridge verse. Tonight in windswept rain on the upper level of the west chamber I need not listen to arias to be flowing with tears.."
  },
  {
    "poem": "情似游絲，人如飛絮，淚珠閣定空相覷。一溪煙柳萬絲垂，無因繫得蘭舟住。雁過斜陽，草迷煙渚，如今已是愁無數。明朝且做莫思量，如何過得今宵去！",
    "translate": "Emotions flow like strands of willows, people drift like catkins, Rolling of teardrops come to a stop as we each other gaze at. From willows along a misty creek millions of strands droop, Yet they've never been able to a magnolia canoe fasten.Through the sunset fly wild geese, along the shores mist shrouds the verdure, By now myriads of melancholy sentiments have mushroomed. Ponder not over what tomorrow shall bring, For there is still tonight to get through!."
  },
  {
    "poem": "芳草碧色，萋萋徧南陌。暖絮亂紅，也似知人，春愁無力。憶得盈盈拾翠侶，共攜賞、鳳城寒食。到今來，海角逢春，天涯為客。愁旋釋、還似織；淚暗拭，又偷滴。漫倚徧危闌，盡黃昏，也只是、暮雲凝碧。拼則而今已拼了，忘則怎生便忘得？又還問鱗鴻，試重尋消息。",
    "translate": "Viridescent is the verdure, to the south spread lush and luxuriant fields. Pleasant willow strands and whirling petals seem to know how we feel, How we tend to feeble become in the presence of spring melancholy. I'm reminded of a gorgeous lady who used to go on outings with me, We'd sightsee together in the capital on the day of the Cold Fare. Here and now at a remote corner greeting spring, In this vast world I'm a visitor.Some worries disentangle themselves only to again intertwine; I quietly wipe away the tears, yet more come trickling down. I lean against the balustrade of a high rise, While all over casts twilight, All that is visible is the sight of dusky clouds in the azure sky. What should've been done has been done, Yet how could I forget what I should forget? I'd like to ask of wild geese and carps to again help seek her tidings.."
  },
  {
    "poem": "萋萋芳草憶王孫，柳外樓高空斷魂，杜宇聲聲不忍聞。欲黃昏，雨打梨花深閉門。",
    "translate": "The sight of lush and luxuriant verdure reminds me of your noble self, Beyond the willows buildings stand tall grieving souls, And unbearable to the ears are cuckoos' warbles in a row. Dusk approaches, As rain blows on pear blossoms, tightly shut are doors.."
  },
  {
    "poem": "見梨花初帶夜月，海棠半含朝雨。內苑春、不禁過青門，御溝漲、潛通南浦。東風靜，細柳垂金縷，望鳳闕、非煙非霧。好時代、朝野多歡，徧九陌、太平簫鼓。乍鶯兒百囀斷續，燕子飛來飛去。近綠水、臺榭映鞦韆，鬭草聚、雙雙游女。餳香更、酒冷踏青路，會暗識、夭桃朱戶。向晚驟、寶馬雕鞍，醉襟惹、亂花飛絮。正輕寒輕暖漏永，半陰半晴雲暮。禁火天、已是試新妝，歲華到、三分佳處。清明看、漢蠟傳宮炬，散翠煙、飛入槐府。斂兵衛、閶闔門開，住傳宣、又還休務。",
    "translate": "Early in the night over the pear blossoms rises the moon, There stand cheery-apple trees half drenched in rain. Spring of the royal gardens cannot refrain from crossing the blue gates, In the moat the water swells flowing into the southern waterways. Calm are easterlies, off willows hang golden strands, The imperial palatial edifices in the distance stand clear of smoke or mist. This is a affluent age with much joy in the court and throughout the empire, On the nine crossroads resonate the drumming and flute play of peaceful times.All of a sudden there burst intermittent warbles of orioles, Overhead flit swallows all over. By the green water I see reflections of the water pavilion and the swings overlap, Games in the grass see pairs and pairs of playful ladies gather. In the season of malt candies, sidelined are taverns along the excursion paths. Quietly admired are glamorous peach blossoms growing out of red-door estates. During the night that is becoming short, out go saddled stallions, The collars of the inebriated return stained with fallen flowers and drifting petals.On a night that is neither cold nor warm, There are clouds in a sky that is neither fine nor overcast. On a day that forbids the use of fire, they new powder and rouge try on, The year has seen off a third of its time, coming to its best days. On the day of the spring equinox, in the palace there shall be a relay of candles, Light smoke shall scatter into aristocratic estates fronted with pagoda trees. Guards have been stood down, wide open is the Gate of Heaven, All summons are put on hold and all officers are on a break.."
  },
  {
    "poem": "悶來彈鵲，又攪碎、一簾花影。漫試著春衫，還思纖手，熏徹金猊燼冷。動是愁端如何向？但怪得、新來多病。嗟舊日沈腰，如今潘鬢，怎堪臨鏡？重省，別時淚濕，羅衣猶凝，料為我厭厭，日高慵起，長託春酲未醒。雁足不來，馬蹄難駐，門掩一庭芳景。空竚立，盡日闌干倚遍，晝長人靜。",
    "translate": "Feeling low in spirit I turn to play with the turtledoves, Only to disturb the shadow of a canopy of blossoms. At leisure I try on spring clothes, then my hands feel the chill, Yet the incense has burned out and the ash has grown cold. Ever so easily I dwell in melancholy, how can I cope? It is all because I've been constantly ill of late. I was already thin with a narrow waist, now my sideburns have greyed, How could I my own reflection face?Looking back, the tears we shed at the time of our parting Fell on our robes that remain stained, she is probably still pining for me, As the sun rises, she'd rather not wake, forever relying on spring inebriation. Wild geese come not, horses stay not, Closed off behind doors is a garden of scenic views. Long I stand alone, all day I lean against balustrades everywhere, Long persists daylight in my solitude.."
  },
  {
    "poem": "玉臺掛秋月，鉛素淺、梅花傅香雪。冰姿潔，金蓮襯、小小凌波羅襪。雨初歇，樓外孤鴻聲漸遠，遠山外、行人音信絕。此恨對語猶難，那堪更寄書說？教人紅消翠減，覺衣寬金縷，都為輕別。太情切，消魂處、畫角黃昏時節。聲嗚咽。落盡庭花春去也，銀蟾迥、無情圓又缺。恨伊不似餘香，惹鴛鴦結。",
    "translate": "Over the estate's terrace hangs the moon of autumn, Lightly freshened up, much like a plum bloom dabbed with fragrance and snow. Cool and pure is her poise, Complemented by her delicate feet dancing small steps in her silken socks. The rain has just stopped, Outside the buildings the quacks of a stray wild goose recede into the distant. From the outlying mountains comes no news of travellers yonder. As I find it difficult to my emotions articulate, How could I have it written down to a letter compose?Blooms have withered and their foliage has been pruned, Becoming loose are my lavish robes, all because of parting sorrows. Overly emotional I must have been, For my soul is grieving as bugles blare and sunset and twilight approach. Such a sound causes me to choke with sobs. Blossoms in the garden have all but fallen and spring has gone, This is where the bright full moon differs, it relentlessly waxes and wanes. She is flawed in that she leaves not her scent behind like fallen blossoms, Which tends to the attention of paired mandarin ducks draw.."
  },
  {
    "poem": "洗妝真態，不作鉛華御。竹外一枝斜，想佳人、天寒日暮。黃昏院落，無處著清香，風細細，雪垂垂，何況江頭路。月邊疏影，夢到消魂處。結子欲黃時，又須作、廉纖細雨。孤芳一世，供斷有情愁，消瘦損，東陽也，試問花知否？",
    "translate": "Cleansed of make-up is her true look, without the help of powder and rouge. Beyond the grove a branch of bamboo extends, I think of her in this cold weather at sunset. Twilight falls over the courtyard, I wonder from where comes a faint scent, A light breeze wafts through, as snow takes its fall, What more could be said of the riverside walk?The moon's outline is tinged with shadow, empty feels my dreaming soul. When fruits ripens, There shall shower a drizzle pristine and fine. I've been self-disciplined all my life, casting away emotional worries, Thin and pallid I've become like Shen Yue of Dongyang, I'd like to know whether blossoms have taken any notice?."
  },
  {
    "poem": "篆縷消金鼎，醉沈沈、庭陰轉午，畫堂人靜。芳草王孫知何處？惟有楊花糝徑。漸玉枕、騰騰春醒，簾外殘紅春已透，鎮無聊、殢酒厭厭病。雲鬢亂，未忺整。江南舊事休重省，徧天涯、尋消問息，斷鴻難倩。月滿西樓憑闌久，依舊歸期未定。又只恐、瓶沈金井，嘶騎不來銀燭暗，枉教人、立盡梧桐影。誰伴我，對鸞鏡？",
    "translate": "From the gold burner scatter twirls of smoke in seal script, Deep in a hangover I am, in the shade is the courtyard in the afternoon, The hall is quiet and undisturbed. Where are those noblemen in search of fragrant verdure? There are only willow catkins drifting over the paths. On a jade pillow, slowly I sober become, Beyond the screen scatter the remains of blossoms after spring has passed, Steeped in tedium, I'm weak and weary from the wine I drank. Messy is my hair, though for now I don't feel like combing it.I shall not dwell on what happened in the Yangtze's south, I've travelled from place to place in search of his whereabouts, Unfortunately stray wild geese cannot be entrusted with assignments. On the balustrade of the west chamber I lean under the moonlight, Still not yet decided is his return date. I'm afraid maybe it's like a message in a bottle that has sunken into a well, Maybe his horse will not come and the silver candle holder shall in the dark remain, Yet here I am pacing under the phoenix tree in vain. Who have I to at my side as I a pretty phoenix mirror face?."
  },
  {
    "poem": "靄靄春空，畫樓森聳凌雲渚。紫薇登覽最關情，絕妙誇能賦。惆悵相思遲暮，記當日、朱闌共語。塞鴻難問，岸柳何窮，別愁紛絮。催促年光，舊來流水知何處？斷腸何必更殘陽，極目傷平楚。晚霽波聲帶雨，悄無人、舟橫野渡。數峰江上，芳草天涯，參差煙樹。",
    "translate": "In the bright and clear sky, Among clouds soars the magnificent high rise. From a height I gaze at Ziwei, a star said to be most evocative of emotions, Which can endow one with confidence and enable great compositions and writings. Wistful thoughts sadden me in the dimming twilight, Then I recall the day when we whispered to each other by the crimson balustrade. Messages can hardly be obtained from northern wild geese, Countless willows line the shores, like their catkins everywhere scatters parting grief.Years of time has been hurried along, Where flows water that once flowed by? Heartbreak doesn't have to happen at sunset, A sight of endless plains is enough to grieve the mind. The sky clears up late, the waves carry along the evening rain, There is no one around, along a deserted crossing a boat drifts. Over the river tower a few peaks, At the horizon spreads verdure, and a jagged smoky silhouette of trees.."
  },
  {
    "poem": "青樓春晚，晝寂寂、梳勻又懶。乍聽得、鴉啼鶯哢，惹起新愁無限。記年時、偷擲春心，花前隔霧遙相見。便角枕題詩，寶釵貰酒，共醉青苔深院。怎忘得、迴廊下，攜手處、花明月滿。如今但暮雨，蜂愁蝶恨，小窗閒對芭蕉展，卻誰拘管？儘無言、閒品秦箏，淚滿參差雁。腰肢漸小，心與楊花共遠。",
    "translate": "Late in spring in the house of red lanterns, Quiet is the day, in my languor I haven't bothered combing my hair.All of a sudden I hear crows caw and orioles warble, Provoking a great deal of fresh melancholy. I remember the year when I secretly gave away my heart, In front of blossoms, separated by mist and distance we looked at each other. Then we inscribed on pillows poems and verses, And pawned precious hairpins for spirits To drink to your hearts' content in the mossy garden.How could I ever forget the cloisters  Where we held hands under a full moon before lustrous flowers.Right now an evening rain drizzles, Leaving bees and butterflies to lament and worry, Standing by a porthole at leisure looking out to the lush plantain leaves, Who is around to restrain me from what I do? Though in solitude I appreciate the nicety of a Qin zither, My tears roll and fall on the frets and strings all over. As my waist gradually thins, My heart has drifted far and away with willow catkins.."
  },
  {
    "poem": "檥蘭舟，十分端是載離愁。練波送遠，屏山遮斷，此去難留。相從爭奈，心期久要，屢變霜秋。歎人生、杳似萍浮。又翻成輕別，都將深恨，付與東流。想斜陽影裏，寒煙明處，雙槳去悠悠。愛渚梅、幽香動。須采掇、倩纖柔。豔歌粲發，誰傳餘韻，來說仙游。念故人、留此遐州。但春風老後，秋月圓時，獨倚江樓。",
    "translate": "On board my magnolia canoe I row, carrying what seems a boat of melancholy. The waves take us far and away, only to be obstructed by the mountain range, This time I am determined to leave, I cannot be further detained. What more could be said for I've long had a decision made, How time lapses as frosty autumn has yet again arrived. Lamentable is life, ever as trivial as duckweeds. The need to part comes ever so often, leaving deep regrets and grief To follow the easterly flow of rivers and creeks.I recall being in a sunset watching cold mist catching twilight, As I rowed and my oars in the water casually glided. I had a liking for waterside plum blossoms, whose mild fragrance moved me. I was inclined to their blooms pick and their delicate nature behold. So I spontaneously an aria sang, then someone returned with a lingering echo, That made it an heavenly experience. I think of my friend who must in such a remote region remain. Yet once spring has gone, there shall come autumn's full moons, And he will be alone as he spends time at the waterside venue.."
  },
  {
    "poem": "風悲畫角，聽單于、三弄落譙門。投宿駸駸征騎，飛雪滿孤邨。酒市漸闌燈火，正敲窗、亂葉舞紛紛。送數聲驚雁，乍離煙水，嘹唳度寒雲。好在半朧淡月，到如今、無處不消魂。故國梅花歸夢，愁損綠羅裙。為問暗香閒艷，也相思、萬點付啼痕。算翠屏應是，兩眉餘恨倚黃昏。",
    "translate": "The sound of bugles grieve in the wind, Inside the tower I listen to the the Chieftain being played three times. A galloping courser come seeking to stay overnight, As snowflakes drift all over this lonely village. Vendors of spirits dim their lights, Knocking on the windows are whirling, scattering leaves. There come a few shrieks of wild geese As they suddenly take off from the misty river, Crying along as they dash through freezing cloud streaks.It is just as well the moon is obscure and pale, At this point in time there is no place where I wouldn't grief-stricken feel. Our homeland's plum blossoms have come to my dreams enter, On my mind worrying me is the lady wearing a green silk dress. I'd like to ask the elegant beauty with a subtle fragrance Whether her pining brings her to millions of teardrops shed. I guess by a screen with jade inlays Is where she'd while away twilight as her brows the weight of lament bear.."
  },
  {
    "poem": "怒髮衝冠，憑闌處、瀟瀟雨歇。抬望眼、仰天長嘯，壯懷激烈。三十功名塵與土，八千里路雲和月。莫等閒、白了少年頭，空悲切。靖康恥，猶未雪；臣子憾，何時滅？駕長車踏破，賀蘭山缺。壯志饑餐胡虜肉，笑談渴飲匈奴血。待從頭、收拾舊山河，朝天闕。",
    "translate": "Raging with fury that raises my hair and topple my crest I lean against a rail as heavy rain breaks,I look up to roar at the sky With high hopes at heart.Achieving high ranks by thirty on dusty battlefields, and dusty the ranks are,Means three thousand miles on the road following clouds and many a moon.Never take for granted time, once hair has greyed, There leaves only regret.As long as the Jingkang disgrace still awaits revenge; How can my remorse be laid to rest?We shall charge our chariots to stomp out all intruders on the Helan Pass.I swear we'd feed on the flesh of the northern tribes when hungry,And cheerfully drink their blood when thirsty.The day we recover what used to be our territory,We'd pay our respect in the direction of the Gate of Heaven.."
  },
  {
    "poem": "雙闕中天，鳳樓十二春寒淺。去年元夜奉宸游，曾侍瑤池宴。玉殿珠簾盡捲，擁群仙、蓬壺閬苑。五雲深處，萬燭光中，揭天絲管。馳隙流年，恍如一瞬星霜換。今宵誰念泣孤臣，回首長安遠。可是塵緣未斷？漫惆悵、華胥夢短。滿懷幽恨，數點寒燈，幾聲歸雁。",
    "translate": "Into the sky soars the twin towers guarding the main gate to the palace, There within stands the twelve-storey Phoenix Tower in the spring chill. At the time of last year's Festival of the First Full Moon, There I was at the emperor's service and present at the banquet. In the grand hall raised were all beaded screens, There gathered a group of ladies who had descended from their heavenly abode. In the sky spread auspicious rainbow clouds, Underneath glimmer candle lights, as orchestral music rise to heaven reach.Time slides away like sand runs through fingers, As if in the blink of an eye the season would change and stars their bearings shift. On this night who would a mourning court officer think of, Looking back I realise how distant from Changan I've come. From worldly attachment am I not yet free? Sentimental I am about my short-lived dream in the land of immortals. Full of deep regrets I am, in the company of a few flickering lights in the cold, And a few cries of homecoming wild geese.."
  },
  {
    "poem": "夜來風雨悤悤，故園定是花無幾。愁多怨極，等閒孤負，一年芳意。柳困桃慵，杏青梅小，對人容易。算好春長在，好花長見，原只是、人憔悴。回首池南舊事，恨星星、不堪重記。如今但有，看花老眼，傷時清淚。不怕逢花瘦，只愁怕、老來風味。待繁紅亂處，留雲借月，也須拚醉。",
    "translate": "Last night stormy winds and abrupt rain blasted, In the garden at home not many blooms would have been spared. Bearing scores of melancholy and intense regrets, I idle away and fail yet another year of spring. Willows and peach blossoms have turned enervated and insipid, Apricots are green and plums small, yet at least they keep me company. Even if spring could stay on and flowers bloom for long, After all we are the ones who languish.As I bygones recollect south of the pond, I bemoan my hoary hair, I cannot bear to the past reminisce. All I have these days are a pair of time-worn eyes for admiring blooms, And for shedding sentimental tears. I don't mind coming across blossoms frail and flimsy, Yet it saddens me to find myself ageing in loneliness. When it comes to the time when various blossoms flourish wildly, In moonlight and the glow reflected off clouds, I must drink till I'm beyond tipsy.."
  },
  {
    "poem": "長淮望斷，關塞莽然平。征塵暗，霜風勁，悄邊聲。黯消凝，追想當年事，殆天數，非人力；洙泗上，弦歌地，亦膻腥。隔水氈鄉，落日牛羊下，區脫縱橫。看名王宵獵，騎火一川明，笳鼓悲鳴，遣人驚。念腰間箭，匣中劍，空埃蠹，竟何成！時易失，心徒壯，歲將零。渺神京。干羽方懷遠，靜烽燧，且休兵。冠蓋使，紛馳騖，若為情。聞道中原遺老，常南望、翠葆霓旌。使行人到此，忠憤氣填膺，有淚如傾。",
    "translate": "I take a good look at the River Huai and its catchment, Beyond the border spread stretches of plains. Battle dust the sky darkens, in piercing frosty winds the border is in a standstill. I stand still disappointed, recollecting how it used to be, Such is our a miserable fate that mortals like us cannot battle with; Along the Rivers Zhu and Si where Confucius once lectured And where string music flourished, now reek of offensive smells. Across the water is our lovely homeland, Under the sunset cattle and sheep are shepherded home, And they have put up battlements all over this land. Their chieftain likes to hunt at night, their cavalry's torches form a bright flow. Tartar pipes and drums our sorrows resonate, aiming to stir our souls.I think of the arrows by my waist and the sword in the scabbard, In vain they dust and moths collect, whatever for! Opportunities are easily lost, while there is no lack of ambitions, Another year is about to lapse. Yet distant remains the recovery of our capital. As shields and banners flutter I think of the far away, Hoping beacon fires would cease and truce could be called. Ambassadors from both sides hurry to and fro, seemingly to a treaty negotiate. I've heard about the people of the central plains, They'd often look to the south for imperial ensigns and pennants. For those who have drifted here, Our chest is filled with indignation and out pour our tears.."
  },
  {
    "poem": "洞庭青草，近中秋更無、一點風色。玉界瓊田三萬頃，著我扁舟一葉。素月分輝，銀河共影，表裏俱澄澈。怡然心會，妙處難與君說。應念嶺海經年，孤光自照，肝膽皆冰雪。短髮蕭騷襟袖冷，穩泛滄浪空闊。盡挹西江，細斟北斗，萬象為賓客。扣舷獨嘯，不知今夕何夕。",
    "translate": "Over the Lakes of Dongting and Green Grass In the days approaching Mid Autumn waft not even a breeze. Three million acres of lustrous jadeite field Carry only a canoe bearing me. A white moon adds its glow to that of the Milky Way, Lucid is the celestial belt and the sky around it. Pleasant is the sight that delights the mind, Yet its subtlety is difficult to verbalise and reveal.I should bear in mind that I've spent years in the southern coastal states, Where I disciplined myself to uphold my integrity and courage. Short and thin is my hair, and my sleeves are light and insubstantial, Nonetheless steady I row in a vast billowing sea. For spirits I shall drink from the West River, for a cup there is the Big Dipper, And I shall treat Nature as my guest. I drum against the the boat and loud I sing Losing track of what day today is.."
  },
  {
    "poem": "東風著急，先上小桃枝。紅粉膩，嬌如醉，倚朱扉。記年時，隱映新妝面，臨水岸，春將半，雲日暖，斜橋轉，夾城西。草軟莎平。跋馬垂楊渡，玉勒爭嘶。認蛾眉凝笑，臉薄拂燕脂，繡戶曾窺，恨依依。共攜手處，香如霧，紅隨步，怨春遲。消瘦損，憑誰問？只花知，淚空垂。舊日堂前燕，和煙雨，又雙飛。人自老，春長好，夢佳期。前度劉郎，幾許風流地，花也應悲。但茫茫暮靄，目斷武陵溪，往事難追。",
    "translate": "Anxious are easterlies, at first they take on sprigs of peach trees. Intense is the crimson powder on her face, charming she is, seemingly tipsy, As she leans against doors in the colour of red. I remember that year I saw her vaguely in her new make-up, By the shore she was, halfway through was spring, warm was the weather, She turned around the arched bridge heading towards the town's west. The verdure was soft and fair. I raced my horse to the willowy wharf where I reined in my neighing horse. I recognised her thin brows and smile, and her lightly powdered face. For I once stole a glance through her window, then I was reluctant to turn away.Where we held hands seems to be enshrouded by a mist-like fragrance, Blossoms fall following my footsteps, regretfully almost through is spring. Thin and pallid I've become, yet who is around to offer sympathy? Only blossoms know what is on my mind, as in vain drip my tears. Swallows that used the grand hall visit Have taken wing in misty drizzle in pairs. Naturally I've grown old, though I still hope for spring to stay for long, So that I could dream of a rendezvous. Where Master Liu of the old times had left romantic tales, The blossoms there must still his sorrows feel. Pervasive is the haze of dusk as I gaze at the waters of the Wuling Creek, Impossible to trace are bygones, legends and myths.."
  },
  {
    "poem": "凝碧舊池頭，一聽管弦淒切。多少梨園聲在，總不堪華髮。杏花無處避春愁，也傍野煙發。惟有御溝聲斷，似知人嗚咽。",
    "translate": "By the old Pond of the Green Gaze, Whenever I hear strings being played I grieve. How I still hear some operatic sound that has survived, Regretfully my hair have also greyed.Apricot blossoms have nowhere else to go to avoid the melancholy of spring, But to bloom in the wild amid drifting mist. There is only the moat that murmurs without a noise That seems to sympathise with my silent sobs.."
  },
  {
    "poem": "郊原初過雨，見數葉零亂，風定猶舞。斜陽掛深樹，映濃愁淺黛，遙山媚嫵。來時舊路，尚巖花、嬌黃半吐。到而今，惟有溪邊流水，見人如故。無語。郵亭深靜，下馬還尋，舊曾題處。無聊倦旅，傷離恨，最愁苦。縱收香藏鏡，他年重到，人面桃花在否？念沉沉、小閣幽窗，有時夢去。",
    "translate": "The fields have just had a rain, Rumpled are some leaves that flutter still though the wind has come to a stop. Among the woods the sun sets, Reflecting thick melancholy onto distant mountains that teal brows resemble. Along the path where I came, Among rocks there are flowers in bright yellow that are half abloom. Nowadays only the flowing water of the brook Knows me like an old friend.I've nothing to say. In deep silence stands the roadhouse, I dismount from the horse looking for where I once an inscription wrote. Wearisome is the life of a vagabond, For whom parting sorrows taste most bitter and awful. Although I could put out of sight incense and the mirror, When I here revisit again another year, Would I be able to find the same countenance and peach blossoms? I vaguely remember the porthole window of the loft, That appears in my dreams often.."
  },
  {
    "poem": "夜來雨，賴倩得、東風吹住。海棠正妖饒處，且留取。悄庭戶，試細聽、鶯啼燕語，分明共人愁緒，怕春去。佳樹，翠陰初轉午。重簾未捲，乍睡起，寂寞看風絮。偷彈清淚寄煙波，見江頭故人，為言憔悴如許。彩箋無數，去卻寒暄，到了渾無定據。斷腸落日千山暮。",
    "translate": "At night comes rain, then there also arrive easterlies to make it stop. The cherry-apple tree is at its most charming as they on branches remain. Quiet is the garden as I listen closely to the warbles of orioles and swallows, That sound just like my sadness, as I worry that spring would pass away.It's a lovely tree, the sun casts the midday shade under its verdurous foliage. Layers of drapes have not yet been raised, suddenly I wake In loneliness to the sight of catkins in the wind. On the quiet I shed a few tears into the misty waves, Then I saw a few acquaintances by the shore, They tell me how they've withered of late. I've written many a letter offering various greetings, Yet I cannot anything substantial write. Broken-hearted I am at sunset that has thousands of peaks under twilight.."
  },
  {
    "poem": "弱柳千絲縷，嫩黃勻徧鴉啼處。寒入羅衣春尚淺，過一番風雨。問燕子來時，綠水橋邊路，曾畫樓、見箇人人否？料靜掩雲窗，塵滿哀弦危柱。庾信愁如許，為誰都著眉端聚？獨立東風彈淚眼，寄煙波東去。念永晝春閒，人倦如何度？閒傍枕、百囀黃鸝語。喚覺來厭厭，殘照依然花塢。",
    "translate": "Thousands of strands of svelte willows Form an even patch of light yellow veiling cawing crows. Chilling through the robes is the cold of spring that has barely arrived After a burst of winds and rains. I'd like to ask swallows that have hither flown, As you came by the river bridge along the green waters, In the adorned high rise did you catch a sight of her? Gentle she would be as she shuts the screened window, Her saddened zither and leaning cittern would be in dust covered.Deep and multiplying has been Yu Xin's melancholy, Which shows in frowns, but all because of whom? Along I stand in easterlies shedding tears For misty waves to carry towards the east. As daytime lengthens in pleasurable spring, How do I the hours while away in my languidness? Idly I lean on my pillows listening to the twitter and warble of orioles. Becoming awake I lethargic feel, Yet over the flowery thickets there is twilight still.."
  },
  {
    "poem": "臉霞紅印枕，睡覺來、冠兒還是不整。屏閒麝煤冷，但眉峰壓翠，淚珠彈粉。堂深晝永，燕交飛、風簾露井。恨無人說與，相思近日，帶圍寬盡。重省，殘燈朱幌，淡月紗窗，那時風景。陽臺路迥，雲雨夢，便無準。待歸來，先指花梢教看，卻把心期細問。問因循、過了青春，怎生意穩？",
    "translate": "My powdered face has left on the pillow an imprint, As I wake from slumber, my hairdo is lopsided still. By the screen the incense burner has chilled, yet my brows are crinkled teal, Touched with powder are my teardrops. Silent and deep is the hall in the lengthening day, Swallows flit to and fro by the open well outside the screen that sways. I regret that I have no one to whom I could convey My wistful thoughts of late, and becoming generous is my waistband.Thinking back, bed chamber curtains in red shimmered in a dimming light, A pale moon outside the screened window was the scene from that night. Remote was the terrace and an intimate dream that no promise provided. When he returns, I shall point out the blossoms for his attention, Before I tell him what weights on my mind in detail.I shall ask him if he inadvertently let slip youth, How would he be able to feel contented?."
  },
  {
    "poem": "驛外斷橋邊，寂寞開無主。已是黃昏獨自愁，更著風和雨。無意苦爭春，一任群芳妒。零落成泥碾作塵，只有香如故。",
    "translate": "Outside the roadhouse by the Parted Bridge, In loneliness bloom wild blossoms. Sunset has arrived as I dwell in melancholy in solitude. Weathering wind and rain.I have no intention to spring hold onto, I'll leave jealousy for various flowers to endure. As blossoms fall to the ground and dust turn into, There leaves only fragrances that doesn't change.."
  },
  {
    "poem": "東望山陰何處是？往來一萬三千里，寫得家書空滿紙，流清淚，書回已是明年事。寄語紅橋橋下水，扁舟何日尋兄弟？行徧天涯真老矣！愁無寐，鬢絲幾縷茶煙裏。",
    "translate": "As I look towards the east, where lies home on the shady side of a mountain? Three thousands miles and much more is the distance in between, Though possibly in vain, I've written for home a letter that fully uses every sheet Accompanied by flowing tears, Yet when I do a reply receive, it shall be sometime next year.To the water under the crimson bridge I say, When could I be let go on a canoe to my brother seek? I've grown really old having travelled all over the world! Filled with melancholy I wakeful stay, Twirls of steam over a cup of tea rise to intertwine with strands of my grey.."
  },
  {
    "poem": "鬧花深處層樓，畫簾半捲東風軟。春歸翠陌，平莎茸嫩，垂楊金淺。遲日催花，淡雲閣雨，輕寒輕暖。恨芳菲世界，游人未賞，都付與、鶯和燕。寂寞憑高念遠，向南樓、一聲歸雁。金釵鬭草，青絲勒馬，風流雲散。羅綬分香，翠綃封淚，幾多幽怨？正消魂，又是疏煙淡月，子規聲斷。",
    "translate": "Flourishing blossoms extend well into the high rise, Half raised is a painted screen swaying in soft easterlies. Spring has taken its leave from the fields, soft and tender is the grass, And drooping willows a golden undertone catch. The sun that sets late urges flowers to bloom, Clouds have thinned after a rain over the loft, There is a slight chill and a shred of warmth. Regretfully a verdurous and lively world is not fully appreciated by sightseers, Who direct all their attention towards maidens and ladies.Alone and up on high I gaze at the far and away, Towards buildings in the south returns a wild goose with a trill. Once we played field games involving golden hairpins and a green-bridled horse, They have become things of the past like passing clouds and winds. My robe belt is losing its fragrance, tears have dried on my green handkerchief, How many regrets have been concealed? Most saddening is the time when scattering mist shrouds a pale moon As cuckoos cry bleakly.."
  },
  {
    "poem": "樓陰缺，闌干影臥東廂月。東廂月，一天風露，杏花如雪。隔煙催漏金虯咽，羅幃黯淡燈花結。燈花結，片時春夢，江南天闊。",
    "translate": "On the corner of a high rise, The shadow of the balustrade lies under the moon over the east chamber. Under the moon over the east chamber, winds fill the sky And carry apricot blossoms adrift like they do snow.Through the mist the lapse of time the timepiece in the form of young dragon chokes. Drapes sway in the the dark as the wick of the lamp burns out. As the wick of the lamp burns out, a transient vernal dream comes to a close, I wake to an expansive sky on the Yangtze's south.."
  },
  {
    "poem": "酣酣日腳紫煙浮，妍暖破輕裘。困人天色，醉人花氣，午夢扶頭。春慵恰似春塘水，一片縠紋愁。溶溶曳曳，東風無力，欲避還休。",
    "translate": "Mild and warm is sunshine that falls on purple mist that floats, On a beautiful, cosy day I take off my leather coat. This weather makes me heavy-eyed, flowery fragrances intoxicates, Feeling as if I'm ready for a nap after a drink of Head-propping Wine.Waning springtime is just like a pond of vernal waters, With gentle ripples as its surface. Wafting along and dragging here and there are feeble easterlies, I think of keeping away from it but then I just don't bother.."
  },
  {
    "poem": "晚晴風歇，一夜春威折。脈脈花疏天淡，雲來去，數枝雪。勝絕，愁亦絕，此情誰共說？惟有兩行低雁，知人倚、畫樓月。",
    "translate": "Clear is the evening as the breeze eases, overnight lapse vernal feelings. Quiet is the sky and sparse are blossoms that are lovely and comely, Clouds float by, blooms appear like snow on sprigs.Extremely beautiful they are, also just as extreme is melancholy, Yet who have I to disclose my emotions to.Only a couple of flights of low-flying wild geese, Know that I've been leaning outside an adorned chamber under the moon.."
  },
  {
    "poem": "日日惜春殘，春去更無明日。擬把醉同春在，又醒來岑寂。明年不怕不逢春，嬌春怕無力。待向燈前休睡，與留連今夕。",
    "translate": "Day after day I cherish what remains of spring, Once passes spring, there shall be little of tomorrow to look forward to. I think about getting drunk to spring hold onto, Yet I'd only wake up to loneliness.There's not a worry about not coming across spring next year, Yet I keep in mind that charming spring could feeble be. Sleep not in front a lantern, Do allow tonight to stay on and linger.."
  },
  {
    "poem": "綠樹聽鴂，更那堪、鷓鴣聲住，杜鵑聲切。啼到春歸無啼處，苦恨芳菲都歇。算未抵、人間離別，馬上琵琶關塞黑，更長門、翠輦辭金闕。看燕燕，送歸妾。將軍百戰身名裂，向河梁、回頭萬里，故人長絕。易水蕭蕭西風冷，滿座衣冠似雪。正壯士、悲歌未徹。啼鳥還知如許恨，料不啼、清淚長啼血。誰共我，醉明月？",
    "translate": "From trees comes the sound that call forth spring from cuckoos, Furthermore when partridges have stopped their coo, Cuckoos intensify their trills. When their have cried away spring exhausting their voice, Regretfully wilted have all blossoms. Perhaps that is still no comparison to partings in the world, For once she played pipa on horseback as she headed towards the dark border, Then there was the Long Gate from where fragrant carriages left the palace. And swallows once flew by to a returning concubine escort.Generals have after countless battles suffered ruin and shame, Gazing in the direction of where we parted, everything is so far away, And from old acquaintances we are parted by death. The waters of Yi murmur still in wintry westerlies, Everyone present has what seems like snow on their clothes and crests. Heroic warriors sing away in our grief that never ends. Those crying birds, if they could comprehend such sorrow and gloom, It probably wouldn't be tears that they cry but blood. Who is with me to intoxicated become under a bright moon?."
  },
  {
    "poem": "鳳尾龍香撥，自開元、霓裳曲罷，幾番風月。最苦潯陽江頭客，畫舸亭亭待發。記出塞、黃雲堆雪。馬上離愁三萬里，望昭陽、宮殿孤鴻沒。弦解語，恨難說。遼陽驛使音塵絕，瑣窗寒、輕攏慢拈，淚珠盈睫。推手含情還卻手，一抹梁州哀徹。千古事、雲飛煙滅。賀老定場無消息，想沉香、亭北繁華歇，彈到此，為嗚咽。",
    "translate": "The phoenix tail of Lady Yang's pipa and her pick made of scented dragon wood Since the Kaiyuan years' ban on the playing of the the Feather Dress melody Have survived heaven knows how many years of seasons and moons. Faring the worst were those travellers at the Xunyang wharf, Though their ferry had always been ready to depart. There was Zhaojun's journey over the border under ochre clouds in the snow. On horseback she left with her melancholy that five thousands miles grow, In the direction of the Morning Glory Hall, she saw not even a wild goose, The strings may my heart comprehend, yet hard to convey are my sorrows.There has been no sight of messengers from Liaoyang, Locked within this side of the window is the chill as I lightly gather and slowly pick A tune as my eyes well up with sparkling tears. Holding a pipa I try to control myself yet somehow my hands manage To a sad and gloomy Liangzhou tune play. Ancient history escapes not from vanishing into thin air. Master He's scheduled performances could no longer be heard, I think of the Agilawood Pavilion, the bustle to its north had faded away, As I play the tune to this point I can no longer my sob contain.."
  },
  {
    "poem": "野塘花落，又悤悤、過了清明時節。剗地東風欺客夢，一枕雲屏寒怯。曲岸持觴，垂楊繫馬，此地曾經別。樓空人去，舊遊飛燕能說。聞道綺陌東頭，行人長見，簾底纖纖月。舊恨春江流不盡，新恨雲山千叠。料得明朝，尊前重見，鏡裏花難折。也應驚問，近來多少華髮？",
    "translate": "Over the pond in the wild blossoms fall, Swiftly time lapses, gone is the day of vernal equinox. All of a sudden there come easterlies to rob me of a dream, I feel cold lying on a pillow shielded by the mica screen. I've brought wine to the winding shore and have my horse tied to a willow tree, This is where we bade farewell. Since you've been gone seemingly deserted is this place, Swallows that have been here before may something remember.I've heard that to the east of the verdurous field Passersby have seen delicate footprints under screens. Never-ending nostalgic sentiments flow on like a river in spring, While fresh melancholy piles on like the Cloud Mountains that range away. Even if tomorrow I could drink till I see you again, A flower in the mirror could never be picked. Nevertheless I would still be surprised and carry on to enquire, How many strands of your hair have since turned grey and white?."
  },
  {
    "poem": "春已歸來，看美人頭上，裊裊春幡。無端風雨，未肯收盡餘寒。年時燕子，料今宵、夢到西園。渾未辨、黃柑薦酒，更傳青韮堆盤。卻笑東風從此，便薰梅染柳，更沒些閒。閒時又來，鏡裏轉變朱顏。清愁不斷，問何人、會解連環？生怕見、花開花落，朝來塞雁先還。",
    "translate": "Spring has returned, the evidence of which lies on ladies' hair That hairpieces in the shape of a swallow's tail wear. Yet callous winds and rains continue, unwilling to the remaining chill withdraw. Last year's swallowswould probably tonight dream of their return to the West Garden. Utterly inseparable from fermented orange wine Are plates of prepared green chives.Yet as I smile, the time has come for easterlies To provide warmth to plum blossoms and willows, catching not a break. When they do have an idle while, they turn to alter faces in the mirror. Such melancholy never pause for a moment, Is there anyone who can an intertwined riddle solve? I'm most afraid of seeing blooming and wilting blossoms, At dawn wild geese from the border shall be the first to take off.."
  },
  {
    "poem": "楚天千里清秋，水隨天去秋無際。遙岑遠目，獻愁供恨，玉簪螺髻。落日樓頭，斷鴻聲裏，江南游子，把吳鉤看了，欄干拍徧，無人會、登臨意。休說鱸魚堪膾，盡西風、季鷹歸未？求田問舍，怕應羞見，劉郎才氣。可惜流年，憂愁風雨，樹猶如此。倩何人、喚取，紅巾翠袖，搵英雄淚？",
    "translate": "Under a vast stretch of autumnal sky in the land of Chu, In an expansive autumn feel, towards the horizon waters flow. As I gaze at the distant hills, my melancholy further grows, Peaks and summits undulate like hair clasps and buns. Behind the top of the tower the sun sets, in the cries of stray wild geese, Being a wayfarer in the river's south I have a typical Wu sword examined, I have used it to knock against balustrades everywhere, Yet I've come across no one who could comprehend how I feel on heights.Mention not perch that make good dishes, As everywhere blows westerlies, has anyone seen the return of Jiying? Those who were meticulous with their land and houses should feel ashamed  In front of the talent of Master Liu. Regretfully years and eras have lapsed in gloomy storms, How trees have weathered and survived. Who would beckon for me A pretty lady with a cardinal scarf and green sleeves to wipe away a man's tears?."
  },
  {
    "poem": "更能消、幾番風雨？悤悤春又歸去。惜春長怕花開早，何況落紅無數。春且住！見說道、天涯芳草無歸路。怨春不語，算只有殷勤，畫檐珠網，盡日惹飛絮。長門事，準擬佳期又誤，蛾眉曾有人妒。千金縱買相如賦，脈脈此情誰訴？君莫舞！君不見、玉環飛燕皆塵土。閒愁最苦。休去倚危闌，斜陽正在，煙柳斷腸處。",
    "translate": "How many more storms can I weather and survive? Spring is about to take its leave in haste. Once I worried that flowers blossom too early in lengthened spring, Then there were fallen petals forming a sea of drifting red. I wish spring would stay! I hear they say that flowers and verdure of the world have nowhere to return to. I resent the silence of spring, I guess only those eager creatures Weaving webs under the decorated eaves would drifting petals trap and capture.The tale of the Long Gate must have yet another impediment caused, All because someone was jealous of her delicate and thin brows. Although one could spend a thousand gold nuggets for Xiangru prose, Who is there to listen to such love and affection? Dance and twirl not! Have you not realised that Lady Yang and Flitting Swallow have dust become. The most bitter is melancholy that fester in idleness. I shouldn't lean against a balustrade up on high, the inclining sun twilight casts Over mist-shrouded willows rendering a heartbreaking landscape.."
  },
  {
    "poem": "千古江山，英雄無覓、孫仲謀處。舞榭歌臺，風流總被、雨打風吹去。斜陽草樹，尋常巷陌，人道寄奴曾住。想當年，金戈鐵馬，氣吞萬里如虎。元嘉草草，封狼居胥，贏得倉皇北顧。四十三年，望中猶記、燈火揚州路。可堪回首，佛狸祠下，一片神鴉社鼓。憑誰問、廉頗老矣，尚能飯否？",
    "translate": "Overlooking the eternal presence of rivers and mountains Never discovered again is the heroism once seen in Sun Zhongmo. Those waterside dancing halls, singing podiums And places of romantic interest have long been destroyed in storms. At sunset, the verdure, trees and ordinary alleyways and paths, Describe the locale where they say Jinu once resided. Back in the days of armoured horses and metal halberds, Imposing was their vigour that could thousands of miles prance like a tiger.The emperor was indiscreet in granting a generous enfeoffment to a general, Resulting in a northern expedition that went shockingly awry. Now aged forty three, I return to what I still remember well the Yangzhou avenues ablaze with lights. Rather unbearable is the scenery at the Bili Shrine worshipping a northern king, Flanked by sculptures of immortal ducks and temple drums. Who should we dispatch to the great Han general, Lianpo, enquire, Whether he still has his mighty appetite?."
  },
  {
    "poem": "老來情味減，對別酒，怯流年。況屈指中秋，十分好月，不照人圓。無情水、都不管，共西風、只管送歸船。秋晚蓴鱸江上，夜深兒女燈前。征衫，便好去朝天，玉殿正思賢。想夜半承明，留教視草，卻遣籌邊。長安，故人問我，道愁腸、殢酒只依然。目斷秋霄落雁，醉來時響空弦。",
    "translate": "I feel dispirited as I aged grow, As I drink at a parting banquet, I taste my fear of the fleeting time. Especially when Mid Autumn approaches close, Though bright and clear is the moon, we won't be together when it its fullest shines. The river water feels not and takes nothing to mind, It follows the westerlies in sending away boat after boat. On an autumn night on the river I think of the delicacy of watercress bream, In the still of the night in front of a lamp I cannot help but wistful feel.Already in your army uniform, ready you are to have an audience with the emperor, For His Majesty admire and respect virtuous and wise characters. I remember once in the middle of the night, I was detained to edits draft as His Majesty decided over affairs at the border. When in the capital, if old acquaintances ask about me, You can tell them that I've been drinking to drown my depressed soul. Often I see wild geese taking their fall from autumn skies, In my drunkenness I seem to hear the sound of a vibrating bow.."
  },
  {
    "poem": "寶釵分，桃葉渡，煙柳暗南浦。怕上層樓，十日九風雨。斷腸片片飛紅，都無人管，更誰勸、啼鶯聲住？鬢邊覷，應把花卜歸期，纔簪又重數。羅帳燈昏，哽咽夢中語。是他春帶愁來，春歸何處？卻不解、帶將愁去。",
    "translate": "My precious hairpin is about to come off, by the Wharf of Peach Leaves, Mist shrouds the willows darkening the atmosphere of southern waterways. Afraid of going upstairs as storms rage through nine out of every ten days. Every drifting petal grieves the soul, Yet there is nothing that governs their fall, Who is around to persuade orioles to their warbles stop?I glance sideways, thinking perhaps I should use flowers to divine a return date, Yet it involves so much counting after I've just managed to pin back my hair. Behind the bed curtains lights grow faint as I sob and mumble in my dream. It is spring that brings along troubling thoughts, Yet where has spring itself disappeared to? It just doesn't understand that it should take away with it all the worries too.."
  },
  {
    "poem": "東風夜放花千樹，更吹落、星如雨。寶馬雕車香滿路。鳳簫聲動，玉壺光轉，一夜魚龍舞。蛾兒雪柳黃金縷，笑語盈盈暗香去。眾裏尋他千百度，驀然回首，那人卻在，燈火闌珊處。",
    "translate": "Easterlies of the night call to bloom blossoms of a thousand trees, As if blowing adrift stars that drizzle like rain. Precious horses and lavish carriages go by leaving a scented trail. Phoenix flutes music perform as the timekeeper witnesses the turning of hours, Throughout the night lanterns in the shape of fish and dragons dance and gyrate.Golden are the willowy tassels of her butterfly hairpin, Among giggles and chatters her scent is fading away. In the crowd I look for her presence everywhere time and again, Suddenly I turn around, and I see her there, Where lights are dim and faint.."
  },
  {
    "poem": "枕簟溪堂冷欲秋，斷雲依水晚來收。紅蓮相倚渾如醉，白鳥無言定自愁。書咄咄，且休休，一邱一壑也風流。不知筋力衰多少，但覺新來懶上樓。",
    "translate": "Reclining on a pillow and a mat in my lodge by the creek, autumn approaches with a chill, Close to the water is a patch of cloud that scatters as evening arrives. Lotus flowers blooming red gather close as though they are tipsy, Quiet are white geese for they must be steeped in melancholy.Some once outlandish writings composed, while others a pretty pavilion built, Every hill and every ravine can romantic and delightful appear. I know not how my health has withered, Though of late I've been feeling too lethargic to set foot upstairs.."
  },
  {
    "poem": "鬱孤臺下清江水，中間多少行人淚。西北是長安，可憐無數山。青山遮不住，畢竟東流去。江晚正愁余，山深聞鷓鴣。",
    "translate": "By the Terrace of Solitude, lucid is the water of the river, Yet mingled within must have been myriads of travellers' tears. Northwest is the direction towards Changan, Yet in between obstruct countless mountains and hills.Blue mountains cannot hinder The waters that must eastwards flow. Melancholy gets hold of me as the night falls over the river, From deep in the mountains come coos of partridges to my ears.."
  },
  {
    "poem": "燕雁無心，太湖西畔隨雲去。數峰清苦，商略黃昏雨。第四橋邊，擬共天隨住。今何許？憑闌懷古，殘柳參差舞。",
    "translate": "Carefree are swallows and wild geese, From the western shore of the Great Lake they take off to clouds chase. All around mountains and hills gloomy seem, Imminent is a shower of evening rain.By the Fourth Bridge I stand, How I wish I could Master Lu's neighbour become. Yet what good could come of it? By the balustrade, on the past I meditate, As withered willows their strands of varying length sway.."
  },
  {
    "poem": "肥水東流無盡期，當初不合種相思。夢中未比丹青見，暗裏忽驚山鳥啼。春未綠，鬢先絲，人閒別久不成悲。誰教歲歲紅蓮夜，兩處沈吟各自知？",
    "translate": "The waters of River Fei eternally drains towards the east, We shouldn't have allowed such pining to ever begin. In dreams I behold you no better than I could in a painting of you, And in the dark there are cries of mountain birds that startle me.Before spring turns everything green, my sideburns have greyed, Extended partings lead to growing insouciance dulling grief. Why must we see off with bright lanterns yet another New Year's eve, As we wistful remain and the distance between us keep?."
  },
  {
    "poem": "燕燕輕盈，鶯鶯嬌軟，分明又向華胥見。夜長爭得薄情知？春初早被相思染。別後書辭，別時針線，離魂暗逐郎行遠。淮南皓月冷千山，冥冥歸去無人管。",
    "translate": "I see swallow-like delicate figures and I hear oriole-like soft utterances, I must have entered again the heavenly territory. Long is the night, yet how do I make the unfaithful aware of it? Already tainted by wistful thoughts is spring that is barely here.The letters I've sent since our parting and the clothes I made for you when we parted, Carry my drifting soul that follows you as you a long journey embark on. At River Huai's south, bright is the moonlight that cools myriads of mountains, And there goes obscure darkness that no one cares about.."
  },
  {
    "poem": "雙槳蓴波，一蓑松雨，暮愁漸滿空闊。呼我盟鷗，翩翩欲下，背人還過木末。那回歸去，蕩雲雪、孤舟夜發。傷心重見，依約眉山，黛痕低壓。采香徑裏春寒，老子婆娑，自歌誰答。垂虹西望，飄然引去，此興平生難遏。酒醒波遠，正凝想、明璫素襪。如今安在？惟有闌干，伴人一霎。",
    "translate": "A pair of oars rowed among the undulating water shield, Through pines the rain drizzled over my straw cape, At twilight my grief expanded to the vastness fill. I called out to the gulls to rendezvous with, Elegantly they fluttered their wings as they made their descent, Then they turned their back to flit over the tips of trees. On my return this time I followed restless clouds and snow on a boat sailing alone at night. Saddened I was when I saw again the faint outline of those hills, Low was the curve of their teal silhouette.Along the Creek of Gathered Fragrances pervaded the spring chill, I got up to dance and sing, taking no notice of who else joined in. To the west of Hanging Rainbow Pavilion I floated my boat, Such lively spirit could never be suppressed. As I sobered up, many waves had rippled far and away, I pictured in my mind her loveliness adorned with pearls and delicate footwear. Where am I at this moment in time? Here I have only the balustrade to accompany me for a little while.."
  },
  {
    "poem": "庾郎先自吟愁賦，淒淒更聞私語。露濕銅鋪，苔侵石井，都是曾聽伊處。哀音似訴，正思婦無眠，起尋機杼。曲曲屏山，夜涼獨自甚情緒？西窗又吹暗雨，為誰頻斷續，相和砧杵？候館迎秋，離宮弔月，別有傷心無數。豳詩漫與，笑籬落呼燈，世間兒女。寫入琴絲，一聲聲更苦。",
    "translate": "There was Yu's soliloquy reciting his lament in the Yangtze's south, The whispers I hear make this place seem ever more desolate now. Bronze door rings moist with dew and the stone well covered in mosses Are where I hear crickets hum and moan. Their grieving tone sound like sobs, Like those of a pining, wakeful woman, who'd rise to weaving continue. She'd sing the melody of the Ranging Hills, What sentiments is she feeling alone at night in the chill?From the west-facing window blows in a fine drizzle, For whom does the rain breaks, in concert with garment pounding beats? As I recall the day when we autumn greeted, And the villa where we paid respect to the moon, Aroused are a myriad of poignant feelings. When I the Bin region's poems peruse, Those celebrating by the fence with bright lanterns are ordinary girls and boys. If I were to a cittern tune compose, ever more bitter would be every note.."
  },
  {
    "poem": "雙槳來時，有人似、舊曲桃根桃葉。歌扇輕約飛花，蛾眉正奇絕。春漸遠，汀洲自綠，更添了、幾聲啼鴂。十里揚州，三生杜牧，前事休說。又還是、宮燭分煙，奈愁裏、悤悤換時節。都把一襟芳思，與空階榆莢。千萬縷、藏鴉細柳，為玉尊、起舞回雪。想見西出陽關，故人初別。",
    "translate": "They came on a boat with double oars, Much like the Peach Sisters from an operatic play. Drifting petals fell on her fan as she sang, This pretty lady was such an extraordinary belle. Springtime gradually fades away, as the verdure across the sandbar spreads, There even come a few cuckoos' warbles. The avenue of Yangzhou that goes for miles and Du Mu's karma, These are all romantic bygones that should be left unsaid.The time has come again for candles in the palace to be lighted, I can't help but dwell in melancholy as seasons rush to each other replace. I'd like to dispose off a heart full of pining In amongst fallen pods of elm trees on the deserted front stairs. Millions of willow strands that can crows keep out of sight Have been fluttering and whirling like drifting snow for a toast. I'd like to venture westwards through the Sun Gate, So here of my old acquaintances I shall my leave take.."
  },
  {
    "poem": "芳蓮墜粉，疏桐吹綠，庭院暗雨乍歇。無端抱影銷魂處，還見篠牆螢暗，蘚階蛩切。送客重尋西去路，問水面、琵琶誰撥？最可惜、一片江山，總付與啼鴂。長恨相逢未款，而今何事，又對西風離別？渚寒煙淡，棹移人遠，飄渺行舟如葉。想文君望久，倚竹愁生步羅襪。歸來後、翠尊雙飲，下了珠簾，玲瓏閒看月。",
    "translate": "Lotus flowers pollen scatter, phoenix trees their remaining thinning green sway, In the garden a drizzle has come to a stop. In idleness I lose myself in staring at my own shadow, Then I see fireflies hovering in the darkness by the bamboo fence, While on mossy stairs crickets interrupt one another's pathetic chirps. To bid you farewell, again I set foot on the westwards trail, Yet is there anyone on the water who'd for us the pipa play? The most pitiful of this stretch of landscape Is left for the cuckoos to cry over always.I regret that we never have the time to deepen our acquaintance, Now what for must we yet again part ways in westerlies? The chill gives rise to mist over the sandbar, as rowing oars carry you away, In haziness, like a leaf your boat sails. Once there was Wenjun awaiting her husband's return, Her melancholy grew as her footsteps in bamboo groves paced. On your arrival, you could drink with her and Let down the beaded screens to gaze at the moon through an exquisite haze.."
  },
  {
    "poem": "鬧紅一舸，記來時，嘗與鴛鴦為侶。三十六陂人未到，水佩風裳無數。翠葉吹涼，玉容消酒，更灑菰蒲雨。嫣然搖動，冷香飛上詩句。日暮，青蓋亭亭，情人不見，爭忍凌波去？只恐舞衣寒易落，愁入西風南浦。高柳垂陰，老魚吹浪，留我花間住。田田多少，幾回沙際歸路。",
    "translate": "Drifting petals overspread the boat, I recall when I first came, I had pairs of mandarin ducks for company. She is not around on any walk or slope, Though by the water stand many well-dressed ladies wearing jade pendants. Wavering lotus leaves send a cool breeze, swaying seemingly tipsy lotuses, In the air bulrush blossoms scatter and whirl. Charming is their movement, their fresh scent takes a leap into verses.In the sunset, the water is covered in patches of green, If she saw not her beloved, how could she bear to her feet move and leave? I'm afraid her dancing robe may not the chill withstand and may come undone, My melancholy blows in westerlies along the southern waterways. Tall willows and their drooping strands yield a shade, Fish spindrift puff, such attractions detain me to tarry among blossoms. Surrounded by pads and patches, hard to track is a trail out of the sandy bay.."
  },
  {
    "poem": "淮左名都，竹西佳處，解鞍少駐初程。過春風十里，盡薺麥青青。自胡馬、窺江去後，廢池喬木，猶厭言兵。漸黃昏、清角吹寒，都在空城。杜郎俊賞，算而今、重到須驚。縱豆蔻詞工，青樓夢好，難賦深情。二十四橋仍在，波心蕩、冷月無聲。念橋邊紅藥，年年知為誰生？",
    "translate": "In this famed town on River Huai's left bank, At this lovely place called West of Bamboos, I hop off from the saddle to take a little break from my journey. Down the Avenue for over a mile I follow the spring breeze, Passing by verdurous shepherd's purse stalk by stalk. Since foreign horses have crossed the river to trespass, Ponds and terraces lie in ruins among mature trees as everyone warring abhors. As dusk arrives, the dreary sound of bugles blow in the wind, Reverberating in this deserted city.Du Mu relished his life here, Yet if he were here to relive it now, he'd be confounded by the way the city is. Although he was skilled in writing fresh verses like February's new moon, And enjoyed sweet dreams inside brothels, hard to compose would be passion. Those twenty four bridges may still be existent, As ripples glitter and undulate, cold is the moon that is silent. I think of the peonies by the bridges, For whom do they come into bloom year after year?."
  },
  {
    "poem": "漸吹盡，枝頭香絮，是處人家，綠深門戶。遠浦縈回，暮帆零亂，向何許？閱人多矣，誰得似、長亭樹？樹若有情時，不會得、青青如許？日暮，望高城不見，只見亂山無數。韋郎去也，怎忘得、玉環分付？第一是、早早歸來，怕紅萼、無人為主。算空有并刀，難翦離愁千縷。",
    "translate": "By and by completely blown away are catkins from willow sprigs, Here every household has their doors shielded by the green. The water meanders along the waterway from afar, On which scatter sails on their return, where to though? I've seen a great number of people, Yet is there anyone who shares the spirit of the willows trees along a gallery? If trees could affections feel, How could they remain so fresh and green?At twilight, I cannot discern those tall towers of the town, All that I can see here and there are myriads of mountains. Gone had Wei Gao, Yet how could he have forgotten the pledge he made with a jade ring? He'd better here return as soon as he possibly could, Lest the crimson flower finds no one to admire its bloom. One may have a pair of scissors from the Bing state, Yet it can hardly the thousands of strands of parting sorrows sever and break.."
  },
  {
    "poem": "空城曉角，吹入垂楊陌。馬上單衣寒惻惻。看盡鵝黃嫩綠，都是江南舊相識。正岑寂，明朝又寒食。強攜酒、小橋宅，怕梨花、落盡成秋色。燕燕飛來，問春何在？惟有池塘自碧。",
    "translate": "From the desolate castle comes the sound of bugle to break the day, That blares through the drooping willows of streets and alleyways. On the horse I'm thinly dressed feeling the chill that grieves me. Before my eyes spread light yellow and fresh green, That I'd come to known well from my days in the south of the Yangtze.Right now everywhere is quiet and still, tomorrow returns the Cold Fare Day. I've deliberately brought along some spirits to this cottage by the bridge, I was afraid that the pear blossoms might have given way to autumn shades. There flit swallows that have returned asking “where has spring moved on to?” There is only the pond that ever viridescent remains.."
  },
  {
    "poem": "舊時月色，算幾番照我，梅邊吹笛？喚起玉人，不管清寒與攀摘。何遜而今漸老，都忘卻、春風詞筆。但怪得、竹外疏花，香冷入瑤席。江國，正寂寂，嘆寄與路遙，夜雪初積。翠尊易泣。紅萼無言耿相憶。長記曾攜手處，千樹壓、西湖寒碧。又片片、吹盡也，幾時見得？",
    "translate": "In those days the moon cast its rays, How many times did its shine fall on me as I by the plum trees my flute play? Aroused was their beauty As I their blooms pick despite the wintry cold. Aged has He Xun and his talent, He must have forgotten how to compose verses that please even spring breezes. It must be the fault of those thin and scanty flowers by the bamboo fence, In the cold a waft of fragrance drifts in to join those seated.By the river still is the silence , Though I wish to mail send, remote are the roads, as night snow begins to pile. With a jade cup in hand tears come easy. Reticent are plum blossoms as memories take hold of my mind. I'll forever remember where we held hands, where Thousands of trees a cold pressure applied over the frigid green of the West Lake. Petal by petal, every plum blossom has been blown adrift, Just when do I get to see them again?."
  },
  {
    "poem": "苔枝綴玉，有翠禽小小，枝上同宿。客裏相逢，籬角黃昏，無言自倚修竹。昭君不慣胡沙遠，但暗憶、江南江北。想佩環、月夜歸來，化作此花幽獨。猶記深宮舊事，那人正睡裏，飛近蛾綠。莫似春風，不管盈盈，早與安排金屋。還教一片隨波去，又卻怨、玉龍哀曲。等恁時、重覓幽香，已入小窗橫幅。",
    "translate": "On a mossy bough of a blooming plum tree, There are a pair of little green birds, resting together for the night. We come across each other on foreign land, by a fence in twilight, Silent she remains as she leans on bamboos slender and tall. Zhaojun never gotten used to the remote foreign sand, She must be secretly reminiscent of the Yangtze and its watery landscape. If her jade pendant bearing her spirit could return on a moonlit night, It would a secluded and serene plum bloom transform into.Not forgotten are old tales of palatial lives, Once there was a princess in her sleep And there fell plum blossoms to her face decorate.Take not after spring breezes that linger not for any beauty, To house a belle you should make grand arrangements. Otherwise everything would vanish with the flow and its waves, Leaving you to lament and sing the depressing Jade Dragon melody. By that time, if you want to seek again this faint fragrance, It would have crossed a porthole and ended up in a verse.."
  },
  {
    "poem": "月冷龍沙，塵清虎落，今年漢酺初賜。新翻胡部曲，聽氈幕元戎歌吹。層樓高峙，看檻曲縈紅，檐牙飛翠。人姝麗，粉香吹下，夜寒風細。此地、宜有詞仙，擁素雲黃鶴，與君游戲。玉梯凝望久，但芳草萋萋千里。天涯情味，仗酒袚清愁，花消英氣。西山外，晚來還捲，一簾秋霽。",
    "translate": "Cold is the moon that over the desert shines, Washed of dust seem the palisades that surround the castle, It was only this year that Han emperor special rewards granted. They rearranged some foreign melodies For all to appreciate Hun's melodies and songs at banquets. This tower we are on soars high, its crimson balustrades meander and wind, And its green eaves seem like flying jadeite. Many beauties gather within, their fragrant powder comes off to drift On this cold night with a light breeze.Right here, it would be fitting to have the presence a heavenly poet,  Who rides a yellow crane through white clouds to share with us pleasant time. I've long hoped for stairs to heaven, Yet all that I could see is the verdure that spreads for thousands of miles. The taste of wandering the world Relies on wine and spirits to melancholy relieve Or immersion among beauties to ambitions loosen. From mountains in the west Comes autumn's evening freshness after a rain passing a rolled-up screen.."
  },
  {
    "poem": "綠絲低拂鴛鴦浦，想桃葉，當時喚渡。又將愁眼與春風，待去，倚蘭橈、更少駐。金陵路，鶯吟燕舞。算潮水、知人最苦。滿汀芳草不成歸，日暮，更移舟、向甚處？",
    "translate": "Willow strands droop low to stir the pond with mandarin ducks, It reminds me of a lady called Peach Leaf who once asked to cross the river here. I shall be casting my melancholy eyes to follow the spring breeze, As we are about to part, I lean against the paddle to linger a little longer.Sailing pass Jinling, I pass by many soft spoken ladies and their dancing figures. I guess tides know best that most toilsome is our obligation to life endure. The verdure spreads to the entire sandbar cover leaving no way home, In the sunset, I steer the boat along, but where towards?."
  },
  {
    "poem": "古城陰，有官梅幾許，紅萼未宜簪。池面冰膠，牆腰雪老，雲意還又沈沈。翠藤共、閒穿徑竹，漸笑語、驚起臥沙禽。野老林泉，故王臺榭，呼喚登臨。南去北來何事？蕩湘雲楚水，目極傷心。朱戶黏雞，金盤簇燕，空嘆時序侵尋。記曾共、西樓雅集，想垂柳、還嫋萬絲金。待得歸鞍到時，只怕春深。",
    "translate": "At the back of this town, there are a few mature plum trees, They haven't fully blossomed for use as hairpins. The surface of the pond has iced over, by the walls snow has piled waist high, Heavy are the clouds that are growing heavier still. Green vines traverse paths in bamboo groves at ease, As laughters approach, fowls resting on the sand take off startled. These wild woods and springs that have long been here, And terraces and halls of bygone eras call to me to them mount and visit.I've ventured to the south and to the north, yet whatever for? Now I have come to roam the waters of Chu under the clouds of Xiang, Everywhere I look it grieves me. Stuck on crimson doors are figures of roosters on January the seventh, And there are gilded platters of swallows to spring greet, Evoking sentimental sighs over the passage of time. I remember the day when we had a nice gathering in the west chamber, There were drooping willows swaying millions of golden strands. By the time I there return on the saddle, I'm afraid spring would probably have long vanished.."
  },
  {
    "poem": "亭皋正望極，亂落江蓮歸未得。多病卻無氣力，況紈扇漸疏，羅衣初索。流光過隙，嘆杏梁雙燕如客。人何在？一簾淡月，彷佛照顏色。幽寂，亂蛩吟壁，動庾信清愁似織。沈思年少浪跡，笛裏關山，柳下坊陌。墜紅無信息，漫暗水涓涓溜碧。飄零久、而今何意，醉臥酒壚側？",
    "translate": "From the hall on the terrace I gaze at the faraway, Lotuses have withered and I haven't been able to return home. I've been stricken with illnesses and lacking in strength, Especially as the need for a white silk fan grows rare, I'm beginning to feel the need to put on more clothes. Time slips like sand through the fingers, How fleeting it is like swallows' visits in pairs to beams made from apricot trees. Where could she be? A screened window frames a pale moon, On which I seem to see her lovely features.Deep must have been the silence, accompanied by crickets' disorderly chirps That disturbed Yu Xin's spirit causing his melancholy to multiply and complicate. I dwell in memories of my youth and those roaming days, Music from a flute used to a dividing range cross, And peaceful was life by the willows in the countryside. Yet I've heard no more of those fallen blossoms, Hushed is the murmur of the flowing water that let go its lucid green. For so long I've been adrift, yet what else is there to prompt me  To lie drunk by a little burner used for warming up spirits?."
  },
  {
    "poem": "柳暗花明春事深，小闌紅芍藥，已抽簪。雨餘風軟碎鳴禽，遲遲日，猶帶一分陰。往事莫沈吟。身閒時序好、且登臨。舊游無處不堪尋，無尋處，惟有少年心。",
    "translate": "In the shade of willows and in the presence of bright blossoms long dwells spring, Those crimson peonies by the balustrade have budded and ready to bloom. Light is the rain and soft the breeze as birds chirp and twitter away, On a day that arrives overcast, carrying a shade of grey.Mention not the bygone times. If health and weather permit, let us make a climb. There is no places we've been before that cannot be found and revisited, Yet never ever reacquired is a person's innocence.."
  },
  {
    "poem": "蘆葉滿汀洲，塞沙帶淺流。二十年、重過南樓。柳下繫船猶未穩，能幾日，又中秋。黃鶴斷磯頭，故人曾到否？舊江山、渾是新愁。欲買桂花同載酒，終不似，少年游。",
    "translate": "Reeds cover the entire sandbar, Over the sand and silt flows a shallow stream. Twenty years have gone by before I again mount this southern tower. We moor the boat by tying it to a willow tree, yet it unsecured seems, We are only days away before we again the Mid Autumn moon greet.The Tower of Yellow Cranes and the hill it sits on, Did you ever come to they visit again, my friend? Same as ever is the landscape that becomes enshrouded in melancholy of the day. We're hoping to pick up some cinnamon to go with the spirits, Yet we'll never have the mood we once had in our younger days.."
  },
  {
    "poem": "春風只在園西畔，薺菜花繁蝴蝶亂。冰池晴綠照還空，香徑落紅吹已斷。意長翻恨游絲短，盡日相思羅帶緩。寶奩如月不欺人，明日歸來君試看。",
    "translate": "Spring breezes waft only in the garden's western corner,Over a ground of shepherd's purse butterflies flit between its flourishing flowers. Icy is the viridescent pond that reflects with its abyss, Paved are garden paths with scattered petals blown to their fall.Sentiments grow provoking regrets when my hair becomes wispy and short, As I dwell in thoughts of you, my robes seem loose as I thin and pallid become. The precious mirror box offers reflections clear as moonlight that deceive not, You can have a look for yourself on your return tomorrow.."
  },
  {
    "poem": "一春長費買花錢，日日醉湖邊。玉驄慣識西湖路，驕嘶過、沽酒樓前。紅杏香中簫鼓，綠楊影裏鞦韆。暖風十里麗人天，花壓鬢雲偏。畫船載取春歸去，餘情付、湖水湖煙。明日重扶殘醉，來尋陌上花鈿。",
    "translate": "Throughout spring I've spent a considerable amount on ladies, Ending up inebriated by the lake day after day. Even my white stallion has become familiar with the directions to the West Lake. It would give a proud neigh as we arrive at the front of a drinking house. A garden of red apricot blossoms' scent is immersed in the sound of pipes and drums, There in the shade of viridescent willows a swing sways.A fine day it was, warm breezes wafted for miles along the way, Ladies took to pinning flowers to their head tipping their hair. Adorned cruise vessels set sail carrying spring away, Cheerful sentiments lingered over the misty waters of the lake. Tomorrow I shall there return with what remains of my intoxication To seek her out along the trails.."
  },
  {
    "poem": "月洗高梧，露漙幽草，寶釵樓外秋深。土花沿翠，螢火墜牆陰。靜聽寒聲斷續，微韻轉、淒咽悲沉。爭求侶、殷勤勸織，促破曉機心。兒時曾記得，呼燈灌穴，斂步隨音。任滿身花影，獨自追尋。攜向華堂戲鬥，亭臺小、籠巧妝金。今休說，從渠床下，涼夜伴孤吟。",
    "translate": "Lofty phoenix trees washing in moonlight and grasses moist with dew Depict late autumn that surrounds the House of Precious Hairpins. Like wild flowers blooming in the green, fireflies flit by the wall. In the still of the night I hear a intermittent dreary noise, There is little change to the notes that are doleful and dismal. Vying for a partner, it eagerly murmurs and whirs, Urging wholeheartedly for a new day to dawn.I remember when I was little, I'd carry a lantern to water its hole, Then I'd tiptoe and follow its sound. I'd brush by flowers as I search by myself for its whereabouts. Then I'd bring it to the front of the hall for fighting games, Although small was our place, I had a delicate showy cage. I shall say no more, its hum from a groove under my bed Accompanies my lonely sigh on this chilly night.."
  },
  {
    "poem": "幽夢初回，重陰未開，曉色催成疏雨。竹檻氣寒，蕙畹聲搖，新綠暗通南浦。未有人行，纔半啟、回廊朱戶。無緒，空望極霓旌，錦書難據。苔徑追憶曾游，念誰伴鞦韆？彩繩芳柱。犀廉黛捲，鳳枕雲孤，應也幾番凝竚。怎得伊來？花霧繞、小堂深處。留住，直到老、不教歸去。",
    "translate": "I've just woken from a dream to a heavily overcast sky,  Light is the shower rushed here by daybreak. Cold air pervades the bamboo groves, acres of trees sough and sway, Fresh green has spread all over to reach the southern waterways. There hasn't been anyone coming by, So I let ajar the crimson doors that a cloister face. Disconsolate I feel, casting at the clouds an empty gaze, A letter from him is something I've yet to obtain.I'm reminiscent of our excursion along this mossy path, Who else could accompany me on the swing? Colourful are the ropes and polished the posts. I roll up the screens made of rhinoceros skin, To look at clouds that seems lonely like my pillow embroidered with a phoenix, There must have been many times I've stood long to gaze. How could I bid him to come hither? A flowery mist the little courtyard pervades. How I'd like to keep him here until we are grey and never let him go away.."
  },
  {
    "poem": "做冷欺花，將煙困柳，千里偷催春暮。盡日冥迷，愁裏欲飛還住。驚粉重、蝶宿西園，喜泥潤、燕歸南浦。最妨他、佳約風流，鈿車不到杜陵路。沈沈江上望極，還被春潮晚急，難尋官渡。隱約遙峰，和淚謝娘眉嫵。臨斷岸、新綠生時，是落紅、帶愁流處。記當日、門掩梨花，翦燈深夜語。",
    "translate": "Cold is the air that flowers are shivering in, smoky the mist that willows shrouds, Hundreds of miles have been stealthily urging along the passage of spring. Grey and gloomy is the atmosphere throughout the day, Dwelling in melancholy I thought of taking off but I stayed on. For the fear of heavy moist pollen, butterflies spend the night in the West Court, For the love of moist soil, swallows make their return to the southern waterways. Yet rain is most annoying when it interferes with a romantic rendezvous, Stopping an adorned coach from driving down the trail of the Hills of Du.The lookout from the dim and dismal river Is a scene of the spring tide turning into evening rapids, Yet hard to locate is a state ferry crossing. Faint is the distant mountain peaks, Charming like a teary Lady Xie's brows. Along the shores, it is the time for fresh green to multiply, And for fallen blossoms to carry away sorrows in the tide. How I remember the day when we close the doors to keep pear blossoms inside, And trimmed the wick of the lamp as we talked throughout the night.."
  },
  {
    "poem": "過春社了，度簾幕中間，去年塵冷。差池欲住，試入舊巢相並。還相雕梁藻井，又軟語、商量不定。飄然快拂花梢，翠尾分開紅影。芳徑，芹泥雨潤，愛貼地爭飛，競誇輕俊。紅樓歸晚，看足柳昏花暝。應自棲香正穩，便忘了、天涯芳信。愁損翠黛雙蛾，日日畫闌獨恁。",
    "translate": "Visible is the passage of early spring through the screens, The swallows that return have hardship endured in the cold. With their wings spread they hope to all cram into their former nests. So they scrutinised the carvings on the coffers and beams, In whispers they discuss, yet a decision is hard to reach. Then with elegance they flit away brushing through blossoms, As their green tails shades of crimson cleave.Fragrant is the path, muddy the soil under the grass soaked in rain. They race one another close to the ground, rivalling one another's grace. From the building in red I come home late, Seeing plenty of shady willows and blossoms along the way. Those swallows must be resting comfortably among flowery scents, Forgetting that there is someone wistful at the world's end. Grief and frowns have ruined her teal, delicate brows, Day after day in solitude  her thoughts drift beyond the decorated balustrade.."
  },
  {
    "poem": "巧沁蘭心，偷黏草甲，東風欲障新暖。漫疑碧瓦難留，信知暮寒猶淺。行天入鏡，做弄出、輕鬆纖軟。料故園、不捲重簾，誤了乍來雙燕。青未了、柳回白眼。紅欲斷、杏開素面。舊游憶著山陰，後盟遂妨上苑。寒爐重熨，便放漫、春衫針線。怕鳳靴、挑菜歸來，萬一灞橋相見。",
    "translate": "Spring snow swiftly drifts to the heart of orchids and onto grass blades, While easterlies attempt to intervene and fresh warmth provide. Somehow I doubt there'd be much left Of the coolness that lingers from the cold of dusk. Their whirring in the sky is caught in the mirror, Posing their soft and flexible poise and figure. I guess at home they probably don't have the screens raised,  Inevitably missing out on a pair of swallows that abruptly there return.Green has not yet fully spread, yet willows have begun to white buds show. Almost out of bloom are peach trees, already blooming are apricot blossoms. I recall an old acquaintance from a previous trip to a mountain's shady side, We agreed on visiting the garden there another time. Pots that have cooled need to be fired up for ironing, So I take a break from pulling needles that spring clothes stitch. I'm afraid if I wear my embroidered shoes to vegetables pick, I might drifting snow encounter on the Ba Bridge.."
  },
  {
    "poem": "月波疑滴，望玉壺天近，了無塵隔。翠眼圈花，冰絲織練，黃道寶光相直。自憐詩酒瘦，難應接、許多春色。最無賴，是隨香趁燭，曾伴狂客。蹤跡，漫記憶，老了杜郎，忍聽東風笛。柳院燈疏，梅廳雪在，誰與細傾春碧？舊情拘未定，猶自學、當年游歷。怕萬一，誤玉人夜寒，窗際簾隙。",
    "translate": "The moon seems to ripple with drops of ray, close to heaven is its clarity, Unstained by the earthly. Everywhere eyes can see gather colourful lanterns and silvery silk ribbons, Like the zodiac's starry radiance. I regret that impoverished are my desire for poetry and spirits, Letting down much of spring's scenery. The most bored of all are those accompanying scented candles That follow many a wild and eccentric tourist.Places I've been are scattered in memory, Master Du had long become history, I can hardly bear to hear the music of reed blowing in easterlies. Dim is the lamp in the Willow Garden, by the Plum Blossom Hall snow piles, Who have I to share my heart over fresh spring wine? What I have with an old flame still hasn't come to fruition, So I shall follow what I did once and travel wide. Except I'm afraid that I might cause her grief on wintry nights, Who'd stare through the screen of her windows as she pines.."
  },
  {
    "poem": "煙光搖縹瓦，望晴檐多風，柳花如灑。錦瑟橫床，想淚痕塵影，鳳弦常下。倦出犀帷，頻夢見、王孫驕馬。諱道相思，偷理綃裙，自驚腰衩。惆悵南樓遙夜，記翠箔張燈，枕肩歌罷。又入銅駝，徧舊家門巷，首詢聲價。可惜東風，將恨與、閒花俱謝。記取崔徽模樣，歸來暗寫。",
    "translate": "As hazy light reflects off colourful roof tiles that are glazed, Visible on a sunny day are breezes along the eaves carrying a drizzle of catkins. I lay my zither across the bed, recalling where tear trails that dust replace When I used to these strings play along its phoenix neck. I venture wearily beyond the bedchamber drapes, Lately I've often dreamed of a nobleman and his stallion. I dare not say this is me pining, yet when I adjust my skirt by myself, I'm dismayed by a narrowing waist.I am reminiscent of that distant night on the southern loft, I remember among bright lanterns with green tinsels we sang abreast. When I set foot on the Bronze Camel street again, I knocked on every door To enquire about her fame and reputation. Regretfully along with easterlies She passed away with her regret like all blooming flower must wither and fade. Now I can only rely on what I remember of this belle To write down a description of her once I am by myself.."
  },
  {
    "poem": "江水蒼蒼，望倦柳愁荷，共感秋色。廢閣先涼，古簾空暮，雁程最嫌風力。故園信息，愛渠入眼南山碧。念上國，誰是、膾鱸江漢未歸客？還又歲晚、瘦骨臨風，夜聞秋聲，吹動岑寂。露蛩悲、青燈冷屋，翻書愁上鬢毛白。年少俊游渾斷得，但可憐處，無奈苒苒魂驚，采香南浦，翦梅煙驛。",
    "translate": "Grey and gloomy is the river, in sight are shrivelled willows and withered lotuses Sharing with me shades of autumn. This neglected chamber braves the cold first, beyond worn screens is a dusky sky, A flight of wild geese on their journey forceful winds loathe. Letters from home, How I wish they could appear before my eyes like the blue southern mountains. I think of a bygone era, Who was it that never returned from enjoying bream delicacies of the south?Again arrives the end of a year, withered I am as I brave the wind, In the night I hear the sound of autumn, swaying the stillness of my peace. Crickets in the wild chirp their grief, cold is the room around a gleaming lamp, I read and book leaves turn becoming sentimental over my greying strands. I've lost all acquaintances from my youth, Pitiful and poignant Is the inevitable passage of time that disturb the soul, We used to fragrances gather in the waters of the south, And we once plum blossoms plucked by the misty roadhouse.."
  },
  {
    "poem": "柳鎖鶯魂，花翻蝶夢，自知愁染潘郎。輕衫未攬，猶將淚點偷藏。念前事，怯流光，早春窺、酥雨池塘。向消凝裏，梅開半面，情滿徐妝。風絲一寸柔腸，曾在歌邊惹恨，燭底縈香。芳機瑞錦，如何未織鴛鴦？人扶醉，月依牆。是當初、誰敢疏狂！把閒言語，花房夜久，各自思量。",
    "translate": "Willows lock in the spirit of orioles, among flowers swirl butterflies' reveries, Caught up in Pan An's melancholy I must have been. Before I a light robe don, I've become absorbed in concealing tears and their trails. As I bygones recall, my fear of the passage of time grows, Spring has long arrived to visit bringing a fine drizzle to the pond. At the scenery I gaze, half abloom are the trees of plum, Very much like Lady Xu's half-finished make-up.Every waft of breeze an inch of tender heart disturbs, How she used to in the songs she sang her grief express Under candlelight surrounded by smoky twirls of burning incense. On the loom spreads a piece of magnificent fabric, Why hasn't it been embroidered with a pair of mandarin ducks? In my tipsiness I lean, there is the moon that inclines next to a parapet. Back in those days, who dares to frivolous and foolish behave! Those endearing words I withheld, In a scented chamber on this long night, I shall them recollect.."
  },
  {
    "poem": "晚雨未摧宮樹，可憐閒葉，猶抱涼蟬。短景歸秋，吟思又接愁邊。漏初長、夢魂難禁，人漸老、風月俱寒。想幽歡，土花庭甃，蟲網闌干。無端。啼蛄攪夜，恨隨團扇，苦近秋蓮。一笛當樓，謝娘懸淚立風前。故園晚、強留詩酒，新雁遠、不致寒暄。隔蒼煙、楚香羅袖，誰伴嬋娟？",
    "translate": "The evening rain hasn't struck down any trees in the palace, On their pitiful, sparse leaves settle cicadas that in the cold linger. Short is the season that has autumn turned into, Causing any mood to verses compose to fall melancholic. Night-time longer extends, it's hard to refrain the soul from dreaming away, I'm growing old as the scenery is turning cold. I long for the joy of seclusion, where wild flowers bloom by the garden's brick well, And spiders cobwebs weave in the corners of its rails.For no reason, mole crickets chirp disturbing the night, Like the lady who wrote on fans self-torturing poems, And lotuses that bitter seeds produce in fall. In front of her chamber she played her reed, In the wind Lady Xie let her tears roll. In dusk in this familiar garden, in reluctance I continue with verses and spirits, Young wild geese have travelled far, offering no more greetings. Hindered by a vast stretch of mist, the land of Chu is home to many pretty ladies, Yet who shall my lovely companion be?."
  },
  {
    "poem": "秋江帶雨，寒沙縈水，人瞰畫閣愁獨。煙蓑散響驚詩思，還被亂鷗飛去，秀句難續。冷眼盡歸圖畫上，認隔岸、微茫雲屋。想半屬、漁市樵邨，欲暮競燃竹。須信風流未老，憑持尊酒，慰此淒涼心目。一鞭南陌，幾篙官渡，賴有歌眉舒綠。只悤悤殘照，早覺閒愁掛喬木。應難奈、故人天際，望徹淮山，相思無雁足。",
    "translate": "A river in autumn carrying rain flows its water pass the chilly sand, From a loft I look out in my melancholy solitude. Amid the mist the rustle of straw capes disturbs my poetic thoughts, And there is also the frantic flitting of gulls that interrupts, Making nice lines hard to come up with. Coldly I look at the picturesque scenery before me, I recognise on the other shore a faint outline of cottages. Half of which must be a village of fishermen and woodsmen, As twilight approaches they rush to bamboos set alight.I should have confidence that my fine taste hasn't stale become, In hand I have a cup of wine, To console my lonely heart and state of mind. I speed along in the southern fields and pole past many ferry crossings, Just so I get to see her comely teal brows when she sang. Yet the remains of the day fade in a hurry, Casting all the worries in the world onto the foliage of mature trees. I cannot help it that we are a world apart, I look as far as I can in the direction of the Huai Hills, Though wistful I am, there comes no wild geese to a message bring.."
  },
  {
    "poem": "繁燈奪霽華，戲鼓侵明發。物色舊時同，情味中年別。淺畫鏡中眉，深拜樓中月。人散市聲收，漸入愁時節。",
    "translate": "The brilliance of lanterns outshines moonlight's glory, As the drumming of dramas and shows last into the wee hours. Everything is the same as it has been as always, Except my state of mind and feelings have differed from that of the middle-aged.Lightly I render my brows that appear in the mirror, With sincerity I pay my respect to the moon I see from the chamber. When crowds scatter and city noise disappears, Close creeps the season of melancholy.."
  },
  {
    "poem": "深院榴花吐，畫簾開、綀衣紈扇，午風清暑。兒女紛紛誇結束，新樣釵符艾虎。早已有、游人觀渡。老大逢場慵作戲，任陌頭、年少爭旗鼓，溪雨急，浪花舞。靈均標致高如許，憶生平、既紉蘭佩，更懷椒醑。誰信騷魂千載後，波底垂涎角黍？又說是、蛟饞龍怒。把似而今醒到了，料當年、醉死差無苦、聊一笑，弔千古。",
    "translate": "Deep within a garden pomegranates flowers give, Inside, raised are the drapes, I'm dressed in hemp clothes holding a round fan, There comes a midday breeze to ease the summer heat. Boys and girls vie with one another boasting their own craft, New designs of hair charms and tiger figures in wormwood. There have been many tourists lining up by the shore to boats race watch. The old and senile have outgrown such occasions to join in the fun, Leaving youths of the fields to vie for the flags and the drums, By the creek sprays splash and spatters prance.His spirit was virtuous and honourable his soul, We are reminded of his life by the summer orchid we pin to our clothes, And by the delicacies and spirits we offer as sacrifice. Who'd believe that his grieving apparition would after a thousand years Crave for rice dumplings at the bottom of these billows? Not to mention his complaints of greedy pythons and angry dragons. If he could really wake up to the present day, His death by drunkenness back all those years would not have so painful seemed, Let it all be in the name of humour, as we give our condolences to bygone millennia.."
  },
  {
    "poem": "湛湛長空黑，更那堪、斜風細雨，亂愁如織。老眼平生空四海，賴有高樓百尺。看浩蕩、千崖秋色。白髮書生神州淚，儘淒涼、不向牛山滴。追往事，去無迹。少年自負凌雲筆，到而今、春華落盡，滿懷蕭瑟。常恨世人新意少，愛說南朝狂客。把破帽、年年拈出。若對黃花孤負酒，怕黃花、也笑人岑寂。鴻北去，日西匿。",
    "translate": "Deep and intense is the darkness of the infinite sky, How it the windswept drizzle tolerateThat chaotic strands of melancholy interweave. I used to set my eyes high that had no regard for the seas of the four corners, I rely on tall buildings over a hundred feet To the sight of an expansive precipitous landscape gather in autumn colours. Now this grey-headed scholar is teary over a great nation's disgrace, Yet as dismal as it seems, I won't be heading north to any tear shed. Though I'm reminiscent of bygones, they leave not a trace in their wake.Arrogant was I in my youth and trenchant my writings with lofty aspirations, Now my glorious moments have all but withered away. Leaving me a heart imbued with bleakness. I've been sentimental over the lack of fresh minds nowadays, So I love to mention the liberal intellects of the era of Jin. I'd recount the tale of the blown away hat year after year. If we snubbed spirits in the presence of chrysanthemums, They just might make fun of our reticence. Wild geese are about to take off for the north, as the sun takes cover in the west.."
  },
  {
    "poem": "年年躍馬長安市，客舍似家家似寄。青錢換酒日無何？紅燭呼盧宵不寐。易挑錦婦機中字，難得玉人心下事。男兒西北有神州，莫滴水西橋畔淚。",
    "translate": "Year after year my horse gallops along the streets of Changan City, As I take an inn for home making home seem like an inn. Shelling out coins for spirits, yet how little does that cost a day? Under candlelight I'd gamble away nights catching no sleep.Easy to obtain seem an embroidered message of a weaving wife, Hard to ascertain is what weighs on her mind. A man can achieve a great deal for China from being in the northwest, I shall not shed any tears into the water next to the Bridge of Water's West.."
  },
  {
    "poem": "畫樓簾幕捲新晴，掩銀屏，曉寒輕。墜粉飄香，日日喚愁生。暗數十年湖上路，能幾度、著娉婷？年華空自感飄零，擁春酲，對誰醒？天闊雲閒，無處覓簫聲。載酒買花年少事，渾不似，舊心情。",
    "translate": "I raise the drapes at the front of the chamber to reveal a new fine day, I put out the light of the lantern, the chill of morning lingers. The fragrance of scattered powder drifts, day after day I grieve among them. I recount to myself the decade that I'd spent in and around the West Lake, How often did I really have the company of a pretty maid?Past has my prime, I grow sentimental over my roaming solitude, So I hold onto spirits, why should I stay sober for anyone? Vast is the sky and idle the clouds, yet I no longer hear any flute music. Carting spirits and shelling out for flowers are what youths would do, Yet I just don't seem to be in that previous mood.."
  },
  {
    "poem": "春訊飛瓊管，風日薄，度牆啼鳥聲亂。江城次第，笙歌翠合，綺羅香暖。溶溶澗淥冰泮，醉夢裏，年華暗換。料黛眉，重鎖隋隄，芳心還動梁苑。新來雁闊雲音，鸞分鑑影，無計重見。春啼細雨，籠愁淡月，恁時庭院。離腸未語先斷，算猶有、憑高望眼。更那堪、衰草連天，飛梅弄晚。",
    "translate": "The reed plays the message of spring's arrival, Light is today's breeze, chaotic is the chirps and warbles I hear through the wall. In this river town, rushing to rise and fall is singing from all over, And ladies donning damask and silken clothes balmy fragrances scatter. The waters of the river gurgle to riverside ice dissolve, In tipsiness and in dreams, my best years have stealthily slipped away. If the lady with teal brows was ever again detained behind the Sui moat, Her heart would flee nonetheless away from the palace.Lately shrieks of wild geese would come from stretches of clouds, Followed by their graceful appearance in a flight, then never to be seen again. Drizzling is the sound of spring, pale is the moon enshrouded by melancholy, Such is this season's garden scene. Sorrowful on the inside, rent is the heart before a word could be uttered, Even though I have yet to make a climb so that I could look out far. How unbearable would be the sight of wilting grass that spreads to the horizon, And drifting plum blossoms that whirl at dusk.."
  },
  {
    "poem": "生怕倚闌干，閣下溪聲閣外山。惟有舊時山共水，依然，暮雨朝雲去不還。應是躡飛鸞，月下時時整佩環。月又漸低霜又下，更闌，折得梅花獨自看。",
    "translate": "I am afraid to lean against the balustrade, Below the chamber gurgle the creek and beyond the chamber hills range. Here remains the landscape of old times That changes not, yet never returning are evening drizzles and morning glory.They seem to be taking after phoenixes whirling in a heavenly soft flutter, Under the moon often heard is the clatter of jade pieces hanging off their waist. Lower inclines the moon and heavy grows frost, As the night falls deeper, I pick a bloom of plum blossom to admire alone.."
  },
  {
    "poem": "濕雲黏雁影，望征路愁迷，離緒難整。千金買光景，但疏鐘催曉，亂鴉啼暝。花悰暗省，許多情，相逢夢境。便行雲、都不歸來，也合寄將音信。孤迥，盟鸞心在，跨鶴程高，後期無準。情絲待翦，翻惹得，舊時恨。怕天教何處，參差雙燕，還染殘朱賸粉？對菱花、與說相思，看誰瘦損？",
    "translate": "Moist clouds adhere themselves to the silhouettes of wild geese, I look at the long journey ahead and in melancholy I lose myself, Steeped in parting sorrows I find it difficult to composure maintain. How I wish a thousand gold could buy time, Yet there comes faint tolling of bells urging the day to break, Followed by crows cawing from everywhere for night-time to arrive. I think to myself the joyful blossoming periods, How they many emotions harbour, yet they could only be revisited in dreams. Even though floating clouds never return, They should some correspondence send at least.I feel extremely alone, I still bear in mind our vows and oaths, I aimed for a soaring future like a crane, leaving an open end to our rendezvous. My attempt to our affections sever Has only caused even more regrets over time. Why does heaven allow flitting pairs of swallows To dash in the glow that powder the remains of the day? Looking into a mirror we could our wistful thoughts relay, To see who has withered away?."
  },
  {
    "poem": "千霜萬雪，受盡寒磨折。賴是生來瘦硬，渾不怕、角吹徹。情絕，影也別，知心惟有月。原沒春風情性，如何共、海棠說？",
    "translate": "As heavy snow drifts and falls, I suffer the torture of the wintry cold. Born lean and tough is my saving grace, Utterly fearless I am of bugles that blare without a break.Extremely gloomy is the atmosphere, even shadows take their leave, There is only the moon that I could confide to. From the outset I possess not the disposition of the spring breeze, Yet how do I tell this to the cherry apple trees?."
  },
  {
    "poem": "羞紅鬢淺恨，晚風未落，片繡點重茵。舊隄分燕尾，桂棹輕鷗，寶勒倚殘雲。千絲怨碧，漸路入、仙塢迷津。腸漫回，隔花時見、背面楚腰身。逡巡，題門惆悵，墮履牽縈。數幽期難準，還始覺、留情緣眼，寬帶因春。明朝事與孤煙冷，做滿湖、風雨愁人。山黛暝，塵波澹綠無痕。",
    "translate": "A bashing blooming flower my greying sideburns contrast, Though it fell not in the evening breeze, its petals now embellish the lush grass. The waterway comes to a fork shaped like a swallow’s tail, On oars rest gulls, I rein in my horse tarrying under lingering clouds of the day. Among thousands of strands of willows and their plaintive green By and by I lose my way in what seems a heavenly place. Something takes hold of my heart, I saw her with blossoms between us, all I saw of her was her back and slim waist.I loitered by her residence, yet regretfully there is no way in, I so wished she would leave behind a shoe for me to hold on to. As another rendezvous would be impossible to expect, I’ve only come to realise that fateful attractions Can cause one to wither away in spring. What tomorrow brings is as hard to predict as the wintry haze That can shroud over the entire lake causing troubling windswept rains. Dusky is the silhouette of hills, green ripples scatter leaving not a trace.."
  },
  {
    "poem": "柳暝河橋，鶯清臺苑，短策頻惹春香。當時夜泊，溫柔便入深鄉。詞韻窄，酒杯長。翦燭花、壺箭催忙。共追遊處，凌波翠陌，連棹橫塘。十年一夢淒涼，似西湖燕去，吳館巢荒。重來萬感，依前喚酒銀罌。谿雨急，岸花狂，趁殘鴉、飛過蒼茫。故人樓上，憑誰指與，芳草斜陽？",
    "translate": "The willows shade the river bridge, Over the Gusu Terraces orioles melodious warbles give. My whip is often scented by the fragrances of spring. How I used to moor overnight, tenderness would draw me into a deep dream. I'd be composing using a rare rhyme, my cup would be staying filled with spirits. We'd be trimming the wick every so often as the timekeeper rushed along. We went on excursions together, chasing each other through verdurous fields, And rowing side by side in a mere.For the past decade it's been a reverie of loneliness, Much like the West Lake without swallows and empty nests at the Wu Palace. A revisit emotions evokes, leaving me to steep in spirits like I've always been. In the creek the rain splashes hard, on the shore flowers tremble in the wind, I should follow the last few crows and flit across this boundless desolation. From the loft where she used to reside, who could point out for me Where we had spent our time at sunset in a grassy field?."
  },
  {
    "poem": "斷煙離緒，關心事，斜陽紅隱霜樹。半壺秋水薦黃花，香噀西風雨。縱玉勒、輕飛迅羽，淒涼誰弔荒臺古？記醉踏南屏，彩扇咽、寒蟬倦夢，不知蠻素。聊對舊節傳杯，塵箋蠹管，斷闋經歲慵賦。小蟾斜影轉東籬，夜冷殘蛩語。早白髮、緣愁萬縷，驚飆從捲烏紗去，漫細將、茱萸看，但約明年，翠微高處。",
    "translate": "Cleaving through the haze is the parting sorrow that cuts my heart, The setting sun conceals itself and its glow behind frosted trees. I water the chrysanthemums with half a teapot of autumn spray, Raising a scent that scatters after a windswept rain from the west. I let loose the bridle to allow the horse to dash like a bird, Yet bleak is the terrace, who'd come hither to bygones mourn? I recall passing through the mountain range's south when I was tipsy, Among colourful fans came sobs of cicadas in the cold that put me to sleep, Paying no attention to the ladies who waited on me.I shall follow the tradition of the festival and have a spree, Dusty is paper and filled with grubs are brush barrels, For a year I haven't a poem composed for I've trouble to even a verse complete. Tiny is the moon that shifts away from the fence in the east, Wintry is the night with odd chirps of a few odd crickets. Already turned grey is my hair, a million strands of fatefulness and melancholy, A startling change of wind has come to blow away my bonnet that is my office, So I concentrate on admiring the dogwood flowers, Next year I shall arrange to return to this blue peak.."
  },
  {
    "poem": "繡幄鴛鴦柱，紅情密、膩雲低護秦樹。芳根兼倚，花梢鈿合，錦屏人妒。東風睡足交枝，正夢枕、瑤釵燕股。障灩蠟、滿照歡叢，嫠蟾冷落羞度。人間萬感幽單，華清慣浴，春盎風露。連鬟並暖，同心共結，向承恩處。憑誰為歌長恨？暗殿鎖、秋燈夜語。敘舊期、不負春盟，紅朝翠暮。",
    "translate": "Embroidered drapes hang between mandarin duck columns in pairs, Around the dense red blossoms, heavy clouds hang low to Qin trees shelter. Their delicate roots intertwine and their flowers overlap, Envious of their charm are those behind the beautiful screens. In easterlies stems and roots cross as they sleep, Dreaming of becoming hairpins in the shape of a swallow's tail Surrounded by bright candles that a cheery grove illuminate, The widowed moon would feel deserted and shy away.Overwhelming are myriads of sentiments that shroud one's loneliness, She used to bathe in the Pond of Magnificent Purity with spring water and breezes. She used to braid her hair into connecting buns to two united hearts signify And to express her gratitude towards His Majesty's grace. Who would rather be in her place to utter words of immortal regrets? In darkness within a locked-up hall, insects hum by the dimming lights. Let us bygones recount and disappoint not the fanciful spirit of springtime The glowing blossoms in the morning and the verdant fields at twilight.."
  },
  {
    "poem": "煙波桃葉西陵路，十年斷魂潮尾。古柳重攀，輕鷗聚別，陳跡危亭獨倚。涼颸乍起，渺煙磧飛帆，暮山橫翠。但有江花，共臨秋鏡照憔悴。華堂燭暗送客，眼波回盼處，芳豔流水。素骨凝冰，柔蔥蘸雪，猶憶分瓜深意。清尊未洗，夢不濕行雲，漫沾殘淚。可惜秋宵，亂蛩疏雨裏。",
    "translate": "Misty waves pile towards the western hills and the Peach Leaves Wharf, I ride the tail of the tide with ten years of heartbreak. Again I those willows pluck, telling the agile gulls of my parting sorrows, Alone I lean over the lofty pavilion looking at what has become a thing of the past. A sudden cold draught blows, over the sand mist floats, beyond which sails pass In the twilight before a range of verdant hills. Then there is the splashing river water To a mirror of autumn colours provide and my withered look reflect.At the magnificent hall candles had dimmed seeing off guests, When she turned to cast a glance, beautiful was her sparkling eyes. Immaculate was her unblemished figure and her soft hands touched by snow, I still remember the affections and a piece of melon that we shared. Empty cups haven't been rinsed, my dream isn't wet from walking through clouds, But from bearing the tears I still have to shed. What a pitiful autumn night, there come crickets' chaotic chirps in a drizzling rain.."
  },
  {
    "poem": "小娉婷、清鉛素靨，蜂黃暗偷暈。翠翹欹鬢。昨夜冷中庭，月下相認，睡濃更苦淒風緊。驚回心未穩，送曉色、一壺蔥蒨，纔知花夢準。湘娥化作此幽芳，凌波路，古岸雲沙遺恨。臨砌影，寒香亂、凍梅藏韻。熏爐畔、旋移傍枕，還又見、玉人垂紺鬒。料喚賞、清華池館，臺杯須滿引。",
    "translate": "Graceful is her delicate bloom, bright is her colour with white dimples, Yellow like bees are her filaments that a faint halo resemble. Verdant and vivid leaves by her side her beauty complement. Last night chilly was the courtyard, under the moon I her bloom met, In my deep sleep I worried about her suffering the force of winds. While my heart had yet to recover from being fretful, The day had dawned, and there was the pot green and fresh, I realised that true was the portent of a blooming dream.The spirit of the Goddess of River Xiang pervades this remote green, Her graceful waves lead to ancient sandy shores and clouds where regrets heap. In the shadow of rock piles, Her faint fragrance scatters, the charm of plum blossoms pales in the chill. Next to the incense burner, twirls of its scent towards pillows drift, I seem to see her with her beautiful hair let down. I should call for company to she admire in the Hall of the Magnificently Pure Mere, With stacks of cups filled to their brim.."
  },
  {
    "poem": "門隔花深舊夢游，夕陽無語燕歸愁，玉纖香動小簾鉤。落絮無聲春墮淚，行雲有影月含羞，東風臨夜冷於秋。",
    "translate": "Flowers blossom in clusters at the front, behind the doors she dwells in an old dream, Silent is the sunset as swallows return with melancholy, She works her delicate hands to draw the drapes from hooks and clips.Drifting flowers give no sound as spring sheds her tears, Floating clouds shadows cast and a bashful moon screen, Easterlies of night-time can be wintrier than autumn winds.."
  },
  {
    "poem": "波面銅花冷不收，玉人垂釣理纖鉤，月明池閣夜來秋。江燕話歸成曉別，水花紅減似春休，西風梧井葉先愁。",
    "translate": "The mirror-like rippling water surface reflects every trace of the chill, There she is by the water as if she's angling for a crescent, Moonlight washes over the pavilion by the pond as the night like autumn feels.Swallows make mention of their return awaiting to take off at dawn, Those waterside flowers seem to have lost their brilliance from spring, As westerlies sough the phoenix tree by the well begins to shed its sentimental leaves.."
  },
  {
    "poem": "捲盡愁雲，素娥臨夜新梳洗。暗塵不起，酥潤凌波地。輦路重來，彷佛燈前事。情如水，小樓熏被，春夢笙歌裏。",
    "translate": "Clouds of grey have been blown away, Lunar Goddess arrives at night to show her fresh, cleansed face. There is not a grain of dust, smooth and silky is the celestial realm.As I revisit this place where imperial coaches once passed through, Everything seems to have happened only yesterday. Her tenderness flowed like gentle water, in a small chamber with scented bedding, A springtime reverie accompanied by music and singing is taking place.."
  },
  {
    "poem": "翦紅情，裁綠意，花信上釵股。殘日東風，不放歲華去。有人添燭西窗，不眠侵曉，笑聲轉、新年鶯語。舊尊俎，玉纖曾擘黃柑，柔香繫幽素。歸夢湖邊，還迷鏡中路。可憐千點吳霜，寒消不盡，又相對、落梅如雨。",
    "translate": "Among festive red cut-outs adorned with greenery, Blossoms of spring have hairpins on hair become. Easterlies in the remains of the day the passage of time takes hold of. Someone a candle lights by the western window, Wakefulness makes its approach towards dawn, Amid rounds of laughters arrives the New Year among warbles of orioles.These wine cups are from before, her hands used to bright mandarins open, Her affections still touch somewhere deep within. In a reverie I return to the lake shore, only to lose my way in its mirror. Have mercy on  the land of Wu over which drift countless speckles of frost, Where wintriness eases not, Against them, like rain plum blossoms fall.."
  },
  {
    "poem": "采幽香，巡古苑，竹冷翠微路。鬭草溪根，沙印小蓮步。自憐兩鬢清霜，一年寒食，又身在、雲山深處。晝閒度，因甚天也慳春，輕陰便成雨？綠暗長亭，歸夢趁風絮。有情花影闌干，鶯聲門徑，解留我、霎時凝竚。",
    "translate": "Following a redolence of seclusion I've come to an ancient garden pace, Along its narrow paths through cold but verdant bamboo groves. By the creek we struggled with the grass, your feet left on the sand prints of lotus. On my frosted sideburns I take pity, This year's Cold Fare has arrived To again find me deep in the cloudy hills.I idle away the daytime, why do the heavens seem hard on spring, Turning a slight overcast into a shower? Along the gallery spreads sap green, riding the wind is my homecoming dream. I become sentimental over the shadows of blossoms by the balustrade at home, Where along the paths warble orioles, They bring me to suddenly stand still and brood, turning me into a stone.."
  },
  {
    "poem": "盤絲繫腕，巧篆垂簪，玉隱紺紗睡覺。銀瓶露井，彩箑雲窗，往事少年依約。為當時、曾寫榴裙，傷心紅綃褪萼。炊黍夢、光陰漸老，汀洲煙蒻。莫唱江南古調，怨抑難招，楚江沉魄。薰風燕乳，暗雨槐黃，午鏡澡蘭簾幕。念秦樓、也擬人歸，應翦菖蒲自酌。但悵望、一縷新蟾，隨人天角。",
    "translate": "Around her wrist wrapped rainbow silk strands, ornate cut-outs draped over her hair, Concealed behind azure silk curtains she slept. With a silver carafe in an open courtyard, she sang by the window with cloudy inlays, The past that was my youth is becoming faint. Remember how I once wrote on her red dress, It breaks my heart to think that long faded have those florid characters on scarlet. Dreaming in May, long gone are  my years of prime, Like soft sweet flag leaves on the sandbar I am frail.Sing not those classical melodies from south of the Yangtze, No amount of suppressed sorrow could raise the submerged spirit of a Chu river. In the balmy breeze swallows their fledglings nurture, As a drizzle falls on yellowing pagoda trees, A clear, reflective river is good for bathing in orchids behind curtains and screens. The romantic tale of Qin's Phoenix Terrace reminds me that I too should head home To prepare spirits infused with cuts of calamus for drinking by myself. Yet in melancholy I steep as I a new moon admire, Which has been following me from its distant corner in the sky.."
  },
  {
    "poem": "聽風聽雨過清明，愁草瘞花銘。樓前綠暗分攜路，一絲柳、一寸柔情。料峭春寒中酒，交加曉夢啼鶯。西園日日掃林亭，依舊賞新晴。黃蜂頻撲鞦韆索，有當時、纖手香凝。惆悵雙鴛不到，幽階一夜苔生。",
    "translate": "I listen to the wind and I listen to the rain, passing away the day of vernal equinox, Grasses once wilted have grown thick to bury petals of blossoms. Before the building among green foliage the path comes to a fork, Every strand of willow is an inch of tender heart. In the chill of spring I was overwhelmed by what I had drunk, On top of which I had a dream before I woke to a morning and orioles' warbles.Day after day in the west garden I tend to its upkeep, And continue to admire every lovely day. Yellow bees make their way towards the rope of the swing time and again, All because there still lingers the fragrance from her delicate hands. I lament over the fact that you're not here for us to be like a pair of mandarin ducks, Overnight mosses have grown to cover the secluded stairs.."
  },
  {
    "poem": "殘寒正欺病酒，掩沈香繡戶。燕來晚、飛入西城，似說春事遲暮。畫船載、清明過卻，晴煙冉冉吳宮樹。念羈情游蕩，隨風化為輕絮。十載西湖，傍柳繫馬，趁嬌塵軟霧。遡紅漸、招入仙溪，錦兒偷寄幽素。倚銀屏、春寬夢窄，斷紅濕、歌紈金縷。暝隄空，輕把斜陽，總還鷗鷺。幽蘭旋老，杜若還生，水鄉尚寄旅。別後訪、六橋無信，事往花委，瘞玉埋香，幾番風雨。長波妒盼，遙山羞黛，漁燈分影春江宿。記當時、短楫桃根渡，青樓彷佛。臨分敗壁題詩，淚墨慘淡塵土。危亭望極，草色天涯，嘆鬢侵半苧。暗點檢、離痕歡唾，尚染鮫綃。嚲鳳迷歸，破鸞慵舞。殷勤待寫，書中長恨，藍霞遼海沈過雁，漫相思、彈入哀箏柱。傷心千里江南，怨曲重招，斷魂在否？",
    "translate": "The lingering wintriness deprives the ill of their liquor, Leaving them behind closed adorned windows with aloewood incense. Arriving late are swallows that fly towards the town's west, Seemingly aware of spring's coming to its end. Decorated boats make their shifts, the vernal equinox has come and gone, Light mist slowly rises to shroud the trees around where the Wu Palace used to be. I think of my curbed affections that accompanyiesmy drift, They have all but scattered with tiny catkins in the wind.For a decade I lived by the West Lake, to the willows I'd have my horse tied, When the dust was light and the mist mild. Then I'd follow the drifting red up a creek that seem so heavenly, For there was a lovely maid who secretly wrote to me of her affections. Next to a silver candle holder generous was spring and contrived seemed dreams, There was singing and dancing in splendid clothes as red candle wax dripped. Deserted is the embankment at dusk, let's hand it over to twilight, Returning it to gulls and egrets.Secluded orchids wilt apace, around which pollia clusters continue to spread, Here I am still roaming this watery region. Ever since I left, I've not heard from the six bridges of the Lake, Gone has the past like withered flowers, buried is the verdure along with its scent, That have endured many storms and their rage. The glisten of ripples jealously show, distant hills have the look of bashful brows, Lamps from fishing boats cast shadows on those inns by the river in spring. Remember when we once crossed the Wharf of Peach Leaves with stubby oars, It is as if I am back at the red-light house. At our parting I wrote a poem on the shabby wall, And our tears and ink fell bleakly onto the dusty ground.I look out from a lofty pavilion into the distance, it's verdurous all the way, I lament over my sideburns that are turning grey. I secretly check up on myself, traces of laughters and tears of sorrow Remain visible on my handkerchief made of raw silk. A lost phoenix with its wings drawn cares not to dance to a broken mirror. I only wish to a letter write diligently to express in full all my regrets and grief For a wild goose to carry away across broad waters and through clouds in the azure. Long is my longing that I can only press onto the zither's frets. A heart has been broken to pieces over thousands of miles south of the Yangtze,  I could the tune of “Raise a Soul” play again, yet is there any wounded spirit?."
  },
  {
    "poem": "送客吳皋，正試霜夜冷，楓落長橋。望天不盡，背城漸杳，離亭黯黯，恨水迢迢。翠香零落紅衣老，暮愁鎖、殘柳眉梢。念瘦腰、沈郎舊日，曾繫蘭橈。仙人鳳咽瓊簫，悵斷魂送遠，九辯難招。醉鬟留盼，小窗翦燭，歌雲載恨，飛上銀霄。素秋不解隨船去，敗紅趁、一葉寒濤。夢翠翹，怨鴻料過南譙。",
    "translate": "By a shore off the Wu waters I bid a guest farewell, frostily wintry is the night, By a long-span bridge maple leaves take their fall. We gaze at the sky but see not its boundary, the town behind us fades, We pass by gloomy pavilions, with regret we let the water carry us further away. The sight of withering verdant patches and wilting red outfits Deepens melancholy that brings a deep frown to the brows. This is reminiscent of Shen Yue's thinning waist in those days, On a magnolia canoe he idled away.The music from an immortal's jade flute called away phoenixes, Crushing a forlorn spirit that had since faded away, irrecoverable by any eloquence. Tipsy was her hair as she asked you to stay, by the porthole you a candle trimmed, Wishing you could sing away your regrets for clouds to carry into the heavens. Simple is autumn that comprehends not and follows not your boat. Yet the dying red follows the lead of a drifting canoe in chilly billows. When you dream of her, you'd be grieving like a wild goose over the South Tower.."
  },
  {
    "poem": "宮粉雕痕，仙雲墮影，無人野水荒灣。古石埋香，金沙鎖骨連環。南樓不恨吹橫笛，恨曉風、千里關山。半飄零、庭上黃昏，月冷闌干。壽陽空理愁鸞，問誰調玉髓，暗補香瘢？細雨歸鴻，孤山無限春寒。離魂難倩招清些，夢縞衣、解佩溪邊。最愁人、啼鳥晴明，葉底清圓。",
    "translate": "Traces of powder and make-up have fallen with the shadows of heavenly clouds, In the wild waters of the deserted bay there is no one around. Buried under ancient piles of rocks are remains of a fragrant nature, Golden sands latch onto bones in chains. It's not the playing of a flute coming from the South Tower that I detest, I hate the morning breeze that reminds me of the great dividing range. Being a vagabond half of my life, here in the garden at twilight, Cold is the moon over the balustrade.In the Long Life Palace she attends to her gloomy look in the mirror in vain, Is there anyone still applying the plum bloom make-up And secretly covering up blemishes on her face? In the drizzle returns a wild goose To this lonely mountain where the spring chill spreads without end. Even an aria cannot a drifting spirit raise, I'm dreaming of someone in white untying her jade by the creek. Yet disturbed I am by warbling birds in a sky bright and clear, Moist and round are broad leaves.."
  },
  {
    "poem": "修竹凝妝，垂楊駐馬，憑闌淺畫成圖。山色誰題？樓前有雁斜書。東風緊送斜陽下，弄舊寒、晚酒醒餘。自消凝，能幾花前，頓老相如？傷春不在高樓上，在燈前攲枕，雨外熏鑪。怕檥游船，臨流可奈清臞？飛紅若到西湖底，攪翠瀾、總是愁魚。莫重來、吹盡香緜，淚滿平蕪。",
    "translate": "Slender bamboos stand still with grace, next to drapes of willows I halt my horse, By the balustrade I look out to a picturesque portrayal of a fleeting moment. Who is around to an inscription of this mountainous scenery provide? Before the House there fly wild geese writing a slanted flight. An easterly hurries along seeing off the setting sun on its incline, Stirring the chill that lingers as I sober up from the evening drinks I imbibed. I ponder over how often we get to come before blossoms, And why did Xiangru suddenly find himself senile?Our sentimentality is evoked not by the lofty height, But by aslant pillows next to a lamp and a smoky burner when it's raining outside. Afraid of rowing a boat I've become, Afraid perhaps of seeing my withered reflection in the water that flows? Should drifting petals be able to sink to the bottom of the West Lake And stir up green billows, those fish would be most worried. I hope I won't have to here return when all velvety petals have been blown away, That would have me pouring tears over wastes.."
  },
  {
    "poem": "湖山經醉慣，漬春衫啼痕，酒痕無限。又過長安，嘆斷襟零袂，涴塵誰浣。紫曲門荒，沿敗井、風搖青蔓。對語東鄰，猶是曾巢，謝堂雙燕。春夢人間須斷，但怪得當年，夢緣能短。繡屋秦箏，傍海棠偏愛，夜深開宴。舞歇歌沈，花未減、紅顏先變。竚久河橋欲去，斜陽淚滿。",
    "translate": "Used to getting drunk among the landscape of lakes and mountains I am, Staining spring clothes with tear marks and liquor spills everywhere. Again I pass through the capital,Over my threadbare collar and sleeves with holes I lament, I've no one to wash off the dirt and dust on me. Petunias wind along the winding path behind the doors of the ruins, Off an abandoned well green vines sway in the wind. I look to offer my greetings to my host's neighbours, Where paired swallows that flitted before the Xies used to their nests build.In the world of mortals, vernal dreams must come to an end, I could only blame my youthful self, ever so short is our fateful reverie. Well adorned was the house with the music of a Qin zither, Next to cherry apple trees that I have a predilection for, Banquets would run into the night. Then dancing came to a rest and hushed were singing, Still blooming were the blossoms, yet you had decided to change your mind. Long I stand on the bridge over the river, though I should go, Tears stream all over my face in the twilight.."
  },
  {
    "poem": "渺空煙四遠是何年？青天墜長星。幻蒼崖雲樹，名娃金屋，殘霸宮城。箭徑酸風射眼，膩水染花腥。時靸雙鴛響，廊葉秋聲。宮裏吳王沉醉，倩五湖倦客，獨釣醒醒。問蒼波無語，華髮奈山青。水涵空、闌干高處，送亂鴉、斜日落漁汀。連呼酒，上琴臺去，秋與雲平。",
    "translate": "Vague is the sky in which mist spreads far in all directions, what era am I in? From the azure of the sky a shooting star takes a fall. In a mirage I see a grey precipice and cloudy trees, A gilded estate for young ladies within an overlord's palace has ruins become. Along the path as straight as an arrow, piercing winds my eyes prod. The water stained with make-up flowers dye and an odour gives. Sounding like the passing of a pair of mandarin duck slippers Are rustling autumn leaves along the gallery.In the Palace, deeply intoxicated is Lord Wu, The weary guest of the five lakes who their beauty gather angles wide awake. I ask the grey ripples which reticent remain, Grey is my hair that cannot mountains' green compete with. Waves hurl sprays into air as I look over the balustrade from a high altitude, Seeing off scattered water fowls and the inclining sun that sets over the sandy bay. I call for spirits to be taken to the Zither Terrace, To offer a toast to autumn that is as high as clouds.."
  },
  {
    "poem": "潤玉籠綃，檀櫻倚扇，繡圈猶帶脂香淺。榴心空疊舞裙紅，艾枝應壓愁鬟亂。午夢千山，窗陰一箭，香瘢新褪紅絲腕。隔江人在雨聲中，晚風菰葉生秋怨。",
    "translate": "Her smooth skin is enshrouded by voile, a fan hides her cherry lips, The powdery print around her neck still a faint scent of make-up diffuse. Cut pomegranates pile like whirling crimson skirts, Wormwood figures have her worrying hair tipped.In a dream at noon I see endless hills, out the window shoots time like an arrow. Scars have healed and lightened on the wrist wearing threads of rainbow. In the sound of rain the river do us apart, In the evening breeze leaves of wild rice sway provoking autumnal sorrows.."
  },
  {
    "poem": "晴絲牽緒亂，對滄江斜日，花飛人遠。垂楊暗吳苑，正旗亭煙冷，河橋風暖。蘭情蕙盼，惹相思、春根酒畔。又爭知、吟骨縈消？漸把舊衫重翦。淒斷。流紅千浪，缺月孤樓，總難留燕。歌塵凝扇，待憑信，拚分鈿。試挑燈欲寫，還依不忍，箋幅偷和淚捲。寄殘雲、剩雨蓬萊，也應夢見。",
    "translate": "Strands of warmth my chaotic thoughts tug at, As I stare at a hazy river and the setting sun, far and away drift blossoms and she. Drooping willows shade the gardens of the Wu Palace, Right in the misty chill are the town squares, over bridges waft warm breezes. Her tender affections and kindness Draw me into a longing, yet I have only spring wine by my side. How could I have known that growing thin are my creaking bones? By and by needing to be re-tailored are my old clothes.Miserably gut-wrenched I am. Away flow blossoms with countless waves, A crescent moon hangs over a lonely tower, it's been hard to make swallows stay. Fans used for dancing have gathered much dust, I'm still waiting for a pledge pieced together from your broken jewellery. I thought of lighting a candle to a letter write, Yet I have not the heart, In silence I roll up the notepaper with my tears. Although she might have gone to a heavenly place of crushed desires, We should be able to dream of each other at least.."
  },
  {
    "poem": "池上紅衣伴倚闌，棲鴉常帶夕陽還。殷雲度雨疏桐落，明月生涼寶扇閒。鄉夢窄，水天寬，小窗愁黛淡秋山。吳鴻好為傳歸信，楊柳閶門屋數間。",
    "translate": "In the pond lotuses dressed in red offer their company as I lean on the balustrade, Crows on their return often bring along a sunset. Cloudy or rainy as the weather may be, leaves from phoenix trees take their fall, While under a bright moon, a precious fan some coolness provides.Slim is the hope of homecoming in the vastness of waters and skies, Through the porthole, pale is the blue silhouette of hills in autumn. Wild geese, who have returned to the land of Wu, do help me to a letter send To a cluster of dwellings by some willows not far from the Gate of Heaven.."
  },
  {
    "poem": "人去西樓雁杳，敘別夢，揚州一覺。雲淡星疏楚山曉，聽啼烏，立河橋，話未了。雨外蛩聲早，細織就、霜絲多少？說與蕭娘未知道，向長安，對秋燈，幾人老？",
    "translate": "I see no other on the West Tower, I see no wild geese either, My memory of our parting seems a dream, like a Yangzhou reverie. Light are clouds and sparse the stars as dawn arrives over the mountains of Chu, I hear crows cawing, as I stand on a bridge over the river, Yet much remains unsaid and unsettled.Among the sound of rain hum insects, As their sound interweave, how many strands of hair have turned grey? Even if I could divulge to Lady Xiao how I feel, she might not comprehend, Pining after Changan and staring at a lamp in autumn, How many have worn themselves out doing so?."
  },
  {
    "poem": "喬木生雲氣，訪中興、英雄陳跡，暗追前事。戰艦東風慳借便，夢斷神州故里。旋小築、吳宮閒地，華表月明歸夜鶴，歎當時、花竹今如此，枝上露，濺清淚。遨頭小簇行春隊，步蒼苔、尋幽別墅，問梅開未？重唱梅邊新度曲，催發寒梢凍蕊。此心與、東君同意，後不如今今非昔，兩無言、相對滄浪水。懷此恨，寄殘醉。",
    "translate": "Cloudy mist shrouds over tall and mature trees, I'm visiting the historical site honouring the hero who fought to our nation revive, Recounting history in silence. To those warships easterlies offered little help, Wrecking dreams of recovering our great country and homeland. He returned to build a little villa on this land that used to be part of the Wu Manor. Under the bright moon, to the splendid columns cranes makes their return at night, Regretfully blossoms and bamboos of those days are no longer around, The dew on sprigs bear splashes of my sparkling tears.Our leader takes our little spring-seeking flock, Stepping on darkened mosses in search of this secluded cottage, Wondering whether the plums have blossomed? There I sing by the plum trees my newly composed melody over and again, Urging those frozen buds and twigs to burst into a bloom. My intent must be the same as our host's,  The future cannot compete with the present that is no better than former times. Neither of us said a word as we gaze at the water surrounding the Billows. Bearing such a regret, we allow alcohol to our spirit absorb.."
  },
  {
    "poem": "何處合成愁？離人心上秋，縱芭蕉、不雨也颼颼。都道晚涼天氣好，有明月、怕登樓。年事夢中休，花空煙水流，燕辭歸、客尚淹留。垂柳不縈裙帶住，漫長是、繫行舟。",
    "translate": "How do you depict a depressed soul? It is the sinking of a leaver's heart in the season of fall, While plantain leaves either raindrops drip or rustle in the wind. As we all know the weather tends to clear up in the evening chill, Though a bright moon hangs overhead, I dread mounting upstairs to see far afield.In dreams years don't pass, Flowers may be out of bloom, yet misty waters continue to flow, Swallows are bidding farewells, yet I am still held up here. Regretfully drooping willows could not clasp onto her dress, For they might have extended endlessly to follow her sailing boat.."
  },
  {
    "poem": "近清明，翠禽枝上消魂。可惜一片清歌，都付與黃昏。欲共柳花低訴，怕柳花輕薄，不解傷春。念楚鄉旅宿，柔情別緒，誰與溫存？空尊夜泣，青山不語，殘月當門。翠玉樓前，惟是有、一陂湘水，搖蕩湘雲。天長夢短，問甚時、重見桃根？者次第，算人間沒箇、并刀翦斷，心上愁痕。",
    "translate": "The spring equinox draws near, on boughs warbles of blue birds move the heart. Wasted are arias all over in vain, Giving way to the twilight that fades. I wish to appeal to the blossoms of willows, Yet I'm hesitant of catkins' frivolous nature that may not spring cherish. The travellers' inn in the Chu region comes to mind, tender were parting sorrows, Who have I to love and hold?Over empty cups I tears shed in the night, reticent are blue mountains, Through the doors shines a crescent. Before this adorned edifice, There is only a stretch of the Xiang water, And swaying clouds of Xiang that float. Days are long yet dreams short, When, I'd like to know, could I again cross path with the lovely maiden? In the face of all this, There is nothing on earth as sharp as a pair of Bing scissors that could sever Melancholy that scars the heart.."
  },
  {
    "poem": "戲馬臺前，采花籬下，問歲華、還是重九。恰歸來、南山翠色依舊。簾櫳昨夜聽風雨，都不似、登臨時候。一片宋玉情懷，十分衛郎清瘦。紅萸佩，空對酒。砧杵動微寒，暗欺羅袖。秋已無多，早是敗荷衰柳。強整帽檐欹側，曾經向、天涯搔首。幾回首、故國蓴鱸，霜前雁後。",
    "translate": "Before the Circus Terrace, by the fence of chrysanthemums, I consult the calender and again comes the Double Ninth. Right on its return, still lush are the southern mountains. Last night I listened to the storm through the windows and curtains, It was nothing like the season for a climb. I have a heart filled with Song Yu's feelings, And a complete likeness of Wei Jie's hollow cheeks.Wearing scarlet evodia, in vain I drink. The sound of garment pressing pestles brings a slight chill That cools its way through my sleeves. Autumn has all but passed, for already withered are lotuses and willows. With reluctance I adjusted my hat that has slanted to one side, When I gazed at the horizon and scratched my head. Frequent are recollections of homeland's vegetables and breams  In season before the fall of frost and after wild geese have left.."
  },
  {
    "poem": "年年社日停針線，怎忍見、雙飛燕？今日江城春已半，一身猶在，亂山深處，寂寞溪橋畔。春衫著破誰針線？點點行行淚痕滿。落日解鞍芳草岸，花無人戴，酒無人勸，醉也無人管。",
    "translate": "Every year on spring and fall's Shrine Day all needlework stops, How unbearable it is seeing pairs of dashing swallows! On this day in this river town half expired is spring, Here I am by myself still deep in the mountains behind many folds, By the bridge over the creek lies loneliness.Worn out are my spring clothes yet who could mend them for me? Full of spots and streaks of tear marks they are. In the sunset I get off the saddle on the verdurous shore, There is no one to flowers wear and no one to urge me to quaff, I'd intoxicated become and there'd still be no one to hold me back.."
  },
  {
    "poem": "對西風、鬢搖煙碧，參差前事流水。紫絲羅帶鴛鴦結，的的鏡盟釵誓。渾不記、漫手織回文，幾度欲心碎。安花著葉，奈雨覆雲翻，情寬分窄，石上玉簪脆。朱樓外，愁壓空雲欲墜，月痕猶照無寐。陰晴也只隨天意，枉了玉消香碎。君且醉，君不見、長門青草春風淚。一時左計，悔不早荊釵，暮天修竹，頭白倚寒翠。",
    "translate": "In the westerlies, my sideburns float in the green fog, In the water fragments of bygones flow. Purple ribbons and silk belts in double knots Remind me of our pledge in front of a mirror and our oath with a hairpin. Yet difficult to recall they are, so I go about weaving a verse of reply, Only to my heart break time and again. Content was the flower relying on leaves, yet full of vicissitudes is life, We had ample affections yet slim luck, jade hairpins break easily against rocks.Beyond the red chamber, about to fall seem clouds in the pressing autumnal sky, The shadowy moon shines still on my wakefulness. Only heaven could ever decide whether to rain or shine, In vain was the wistful who withered away. You should drink up, do you not see, The tears in the spring breeze outside the Long Gate? It was a moment of ill decision, I regret not having opted for plain clothes sooner, Among slender bamboos and twilight, leaning against the wintry green is my grey.."
  },
  {
    "poem": "送春去，春去人間無路。鞦韆外、芳草連天，誰遣風沙暗南浦？依依甚意緒？漫憶海門飛絮。亂鴉過、斗轉城荒，不見來時試燈處。春去。誰最苦？但箭雁沉邊，梁燕無主，杜鵑聲裏長門暮。想玉樹凋土，淚盤如露。咸陽送客屢回顧，斜日未能度。春去。尚來否？正江令恨別，庾信愁賦，蘇隄盡日風和雨。嘆神游故國，花記前度。人生流落，顧孺子，共夜語。",
    "translate": "As I see off spring, gone is spring, not to be found amongst us. Beyond the swing, the verdure spreads to the horizon, Who is it that charged dust storms to the southern waterways obscure? Reluctant to leave, what is it that I feel? I'm reminded of the drifting catkins at the estuary, Flitting crows pass me by, a change of scene turns a city desolate, No longer sighted are bright lanterns and banners that I saw when I first came.Gone is spring. Who suffers the most? None but wild geese shooting for the border, And swallows on beams without hosts, Twilight shrouds over the Long Gate in the warbles of cuckoos. I think of the jade trees that have withered and soiled become, Full of tears would be the Han emperor's plate for collecting heavenly dews. As I see off my guest at the capital I looked back many times, Inclined has the sun yet I'm unable to go along.Gone is spring. Would it come again? It is all just like Jiang's proses on parting sorrows and Yu Xin's on melancholy, Along the Su embankments the storm rages throughout the day. How I have dreamt of homecoming, in a blossom like what I'd once experienced. Life has me stranded in poverty, Looking after my little child, chatting the night away.."
  },
  {
    "poem": "紅妝春騎，踏月呼影，竿旗穿市。望不盡、樓台歌舞，習習香塵蓮步底。簫聲斷、約彩鸞歸去，未怕金吾呵醉。甚輦路、喧闐且止，聽得念奴歌起。父老猶記宣和事，抱銅仙、清淚如水。還轉盼、沙河多麗。滉漾明光連邸第，簾影凍、散紅光成綺。月浸葡萄十里，看往來、神仙才子，肯把菱花撲碎。腸斷竹馬兒童，空見說、三千樂指。等多時、春不歸來，到春時欲睡。又說向、燈前擁髻，暗滴鮫珠墜。便當日、親見霓裳，天上人間夢裏。",
    "translate": "Dressed in red for a ride in spring, We galloped under the moon over shadows of poles and banners through the city. I cannot see an end to the dancing and singing taking place on balconies, Where lively lotus trot fragrant dust raises. The music of flutes has stopped inviting the bright phoenixes to rise homeward, There is no fear of the golden vanguards falling intoxicated. I wonder why along the imperial avenue the hustle and bustle would die away When the songs reminiscent of the charm of a Tang songstress are performed.Those a generation before us still remember the Xuanhe days, Holding a bronze dew plate gathering tears crystal clear like water. I cast my eyes about at the sandy bay where many beauties reside. On the water moonlight ripples by noblemen's estates, Their curtains reflections in the water make, casting ribbons of scarlet rays. The moon is like an immersed grape spreading her luminosity for miles, Visible to all those immortals and the talented, Yet not one would such a kaleidoscopic image disturb and break.Even children on bamboo horses are broken-hearted, Let along those three thousand music players of the palatial band. Long I've waited, yet spring hasn't returned, When spring does come I shall languid become. I think of getting in front of a lamp to my hair comb, Yet I end up crying pearls under the rose. Even if I had ever seen with my own eyes the dance of the Rainbow Robe, A heavenly memory as such on earth I could only in dreams evoke.."
  },
  {
    "poem": "璧月初晴，黛雲遠淡，春事誰主？禁苑嬌寒，湖隄倦暖，前度遽如許。香塵暗陌，華燈明晝，長是懶攜手去。誰知道、斷煙禁夜，滿城似愁風雨。宣和舊日，臨安南渡，芳景猶自如故。緗帙離離，風鬟三五，能賦詞最苦。江南無路，鄜州今夜，此苦又、誰知否？空相對、殘釭無寐，滿邨社鼓。",
    "translate": "The moon has just shown her face shining like a round piece of jade, Thinning clouds fade and drift away, who springtime dominates? In the palatial garden wintriness lingers, by the lake warmth wears me out, As bygones flash before my eyes. Among the grass is fragrant dust, bright lanterns light the night, More often than not I've grown lazy towards going out side by side. Yet how could anyone have know that on this night of no fire and smoke, This town would melancholy seem as if it is enduring a storm.In the old days of Xuanhe, the capital had crossed the waters to Lin'an, Pretty was the scenery and things were much the same. Turning the pages of volumes and volumes of literature on a windy fifteenth, Those who verses compose suffer the most. There is no place to take refuge south of the Yangtze, like Du Fu's night in Fuzhou, The bitterness he suffered, who really knows how to cope? In vain I face the dimming lamp wide awake, All over the village resonates the drumming of the Shrine Day.."
  },
  {
    "poem": "怎知他、春歸何處？相逢且盡尊酒。少年嫋嫋天涯恨，長結西湖煙柳。休回首，但細雨斷橋，憔悴人歸後。東風似舊，向前度桃花，劉郎能記，花復認郎否？君且住，草草留君翦韭，前宵正恁時候。深杯欲共歌聲滑，翻濕春衫半袖。空眉皺，看白髮尊前，已似人人有。臨分把手，嘆一笑論文，清狂顧曲，此會幾時又？",
    "translate": "How would I know where to spring has receded? Now we've come across each other we should drink till we cups empty. In our tender youth we had travelled the world with regrets, By the smouldering willows of the West Lake I've come to take up residence. Look back not, for the drizzle over the Parted Bridge   Drowns you in depression once you turn your head. Easterlies waft through as before, in the face of peach blossoms in bloom again, Master Liu would recognise them, yet could they also him recognise?Stay, my friend, I'll harvest some chives for you this very moment, Just like I did yesternight. Deep were our cups as we drank and let loose our voices over songs, Knocking over drinks dampening half of the sleeves of our spring robes. I frowned in vain at the image of my grey hair in my drink, Unavoidable it seems for each and everyone of us. When parting we each other's hands grasp recalling delightful literary discussions And our unreserved singing, yet when will we gather again like this?."
  },
  {
    "poem": "照野旌旗，朝天車馬，平沙萬里天低。寶帶金章，尊前茸帽風欺。秦關汴水經行地，想登臨、都付新詩。縱英游、疊鼓清笳，駿馬名姬。酒酣應對燕山雪，正冰河月凍，曉隴雲飛。投老殘年，江南誰念方回？東風漸綠西湖岸，雁已還、人未南歸。最關情、折盡梅花，難寄相思。",
    "translate": "Throughout the field flutter pennants on the capital-bound coaches, For thousands of miles sands sweep in the sky that hangs low. A golden seal hangs off your precious cummerbund, The wind attempts to your felt hat steal as you hold a drink in hand. As you the Qin region enter, the waters of Bian follow, As you heights climb, I supposed you'd want to new verses compose. You'll be enjoying an outstanding tour and the music of Tartar pipes and drums, On top of coming across gallant stallions and famed songstresses.In your tipsiness you'd come face to face with the Yan Mountains' snow, Under the freezing moon frozen would be the river, And there'd be clouds drifting over the mountain range at dawn. I've senile become with only a few years left, Fanghui used to roam the Yangtze's south, yet who pays that any attention now? Easterlies gradually waft green across the shores of the West Lake, Wild geese have made their return, yet I haven't made it back to the river's south. I hold most dear our friendship, I could pluck all plums blossoms bare, And I would still fail to my wistful thoughts convey.."
  },
  {
    "poem": "朱鈿寶玦，天上飛瓊，比人間春別。江南江北，曾未見、漫擬梨雲梅雪。淮山春晚，問誰識、芳心高潔？消幾番、花落花開，老了玉關豪傑。金壺翦送瓊枝，看一騎紅塵，香度瑤闕。韶華正好，應自喜、初亂長安蜂蝶。杜郎老矣，想舊事花須能說。記少年、一夢揚州，二十四橋明月。",
    "translate": "Ruby jewellery, precious nephrite and the floating jadeite in the heavens, How they represent the passage of spring on earth. In the Yangtze's south or her north, Never seen was the flower of jade, I imagine it would look like puffy pear blossoms or snowy plum blooms. The hills by the Huai River weather what remains of spring, Has anyone come across the noble and virtuous class? Time and again flowers wilt and bloom, Becoming jaded are the able and the courageous of the Jade Pass.Tales have it that they sent a cut of a jade flower bloom in a golden vase On a horse trailing red dust towards the capital with its fragrance. Magnificent and harmonious was the time, It appealed to most, it caused a stir drawing close Changan's bees and butterflies. Although old would have been Du by then, Yet I'm sure of his bygones, blossoms could still relay. Especially of note was his youth; his Yangzhou reverie, There was one bridge under the bright moon, Twenty Four was its name.."
  },
  {
    "poem": "煙水闊，高林弄殘照，晚蜩淒切。畫角吹寒，碧砧度韻，銀牀飄葉。衣濕桐陰露冷，采涼花、時賦秋雪。嘆輕別，一襟幽事，砌蟲能說。客思吟商還怯，怨歌長、瓊壺暗缺。翠扇恩疏，紅衣香褪，翻成消歇。玉骨西風，恨最恨、閒卻新涼時節。楚簫咽，誰寄西樓淡月？",
    "translate": "Wide is the misty water, in the remains of twilight wavers lofty trees, Evening cicadas their misery bleat. The sound of bugles wafts in the cold among the rhythm of garment pressing, Leaves drift over the metallic rails surrounding the well. My clothes are dampened in the shade of phoenix trees by chilly dew, Flowers of reeds scatter like snow in this autumn season. I regret over our parting, and I've been grieving inside, Yet I have only insects of fall to relate to.Being a traveller I fear recitals in low tones, Long are bitter arias, beating to their rhythm had once chipped a spit pot. Parted have precious fans and affections, faded has the fragrance of ruby robes, There goes everything vanishing into thin air. As I try maintaining elegance in westerlies, Most vexing of all is the chill of a new season. The southern flute sobs, under a pale moon who is it that in a west chamber stays?."
  },
  {
    "poem": "禁苑東風外，揚暖絲晴絮，春思如織。燕約鶯期，惱芳情偏在，翠深紅隙。漠漠香塵隔，沸十里、亂絲叢笛。看畫船、盡入西泠，閒卻半湖春色。柳陌，新煙凝碧，映簾底宮眉，隄上游勒。輕暝籠寒，怕梨雲夢冷，杏香愁冪。歌管酬寒食。奈蝶怨、良宵岑寂。正滿湖碎月搖花，怎生去得？",
    "translate": "Beyond the easterlies of the royal garden, Flying in the air are warm strands and sunny catkins weaving spring sentiments. Swallows and orioles have returned on time,  Ruffled are their feathers for spring loiters deep among rubies and jade. Fragrant is the dust under a misty cloak, Simmering for miles accompanied is the flute music among wild willows. There goes an adorned boat sailing under the Bridge of West Chill, Leaving behind half a lake's vernal landscape.Among willow trees rises the mist forming condensate on the green, In the reflection are beauties behind palatial screens and riders on levees. Mild is the dusk shrouded by the cold, vulnerable are pear blossoms to icy dreams,  The fragrance of apricot blossoms casts a melancholy veil. Here is a toast to the Cold Fare with singing and orchestral play. Not even butterflies can help with the loneliness of otherwise a fine night. The lake is now filled with a moon and blossoms, shattered and shaken, How could I take leave of her on such an occasion?."
  },
  {
    "poem": "楚江湄，湘娥再見，無言灑清淚，淡然春意。空獨倚東風，芳思誰寄？凌波路冷秋無際。香雲隨步起，漫記得、漢宮仙掌，亭亭明月底。冰絲寫怨更多情，騷人恨，枉賦芳蘭幽芷。春思遠，誰嘆賞國香風味？相與共、歲寒伴侶，小窗淨、沉煙熏翠袂。幽夢覺、涓涓清露，一枝燈影裏。",
    "translate": "Along the shore of River Chu, I see again lovely tender narcissi, I cannot utter a word but splash a few crystal tears, yet apathetic is spring. I face easterlies in vain, for whom have I to my sentiments share with? Over the rippling water cold is the path of sail amid an endless fall. Fragrances waft following footsteps, Calling to mind the dew-collecting immortal palm of the Han Palace That stands firm and tall under the bright moon.These frigid stalks are ever more expressive of grief, Poets have long wasted time composing odes to delicate orchids and angelicas. Far drifts springtime, who is there that truly relish her majestic scent? Let us accompany each other through the wintriness of a year's end, By the spotless porthole, incense smoke falls over the green duvet. As I wake from a silent reverie, I see pristine dewdrops roll On a stalk of white swaying between light and shadow.."
  },
  {
    "poem": "紺煙迷雁迹，漸碎鼓零鐘，街喧初息。風檠背寒壁，放冰蟾，飛到，蛛絲簾隙。瓊瑰暗泣，念鄉關、霜華似織。漫將身、化鶴歸來，忘卻舊遊端的。歡極。蓬壺蕖浸，花院梨溶，醉連春夕。柯雲罷弈，櫻桃在，夢難覓。勸清光乍可，幽窗相伴，休照紅樓夜笛。怕人間、換譜伊涼，素娥未識。",
    "translate": "In smoky twilight sky lost is any trace of wild geese, Drumming and bell toll linger in odd beats, Just drawing to a close is the bustle of streets. The wind blows lanterns against wintry walls, Moonlight scatters falling on chinks of cobwebs. In silence I cry tears of petals of succulent rose, I think of home, years of time has woven into a head of grey. Perhaps if I could after death return as a homecoming crane, I would be able to let go of how I had once made my way.How extremely joyful! It was a heavenly spot immersed in the fragrance of lotus, In the garden pear blossoms melted as we steeped in liquor on New Year's eve. Only to realised at the end of a chess game that it was a century of a dream, Although there were cherry pits to prove something, traceless remain reveries. Lucid brilliance, I suggest you take the company of a reticent window Instead of some nocturnal reed play from a red chamber. For I'm afraid here on earth we often rearrange the tunes of Liang and Yi, Which Your Ladyship may not recognise as our loneliness.."
  },
  {
    "poem": "夢冷黃金屋，嘆秦箏、斜鴻陣裏，素弦塵撲。化作嬌鶯飛歸去，猶認紗窗舊綠。正過雨、荊桃如菽。此恨難平君知否？似瓊臺、湧起彈棋局，消瘦影，嫌明燭。鴛樓碎瀉東西玉，問芳蹤、何時再展？翠釵難卜。待把宮眉橫雲樣，描上生綃畫幅。怕不是、新來妝束。彩扇紅牙今都在，恨無人、解聽開元曲，空掩袖，倚寒竹。",
    "translate": "In a mansion of riches and wealth cold is my dream, Regretfully the Qin zither sits aslant like a flight of wild geese, Where dust falls on its strings. You must have turned into a golden oriole and flew home, Yet you should still be able to recognise my green-screened window. As it rains, cherry blossoms fall like peas and beans. Do you know how hard it is for such a regret to abate? Opportunities of fame and fortune surge like turns of a game of chess. Pallid and thin is my own shadow which leads me to bright candles detest.At the House of Mandarin Ducks, in pieces is a jade flagon and spilt is wine, And I ask of her whereabouts, when will I be able to her presence see? Yet a jade hairpin cannot this divine. Let me her graceful brows that heavenly seem Depict and embroider onto a canvas of raw silk. However, it'll never be a match for her coming in a new dress and fresh make-up. Still available are rainbow fans and red clappers, Yet regretfully there are no one who can the tunes from the Kaiyuan era appreciate,  Leaving my sleeves to drape in vain as I cold bamboos lean against.."
  },
  {
    "poem": "蕙花香也，雪晴池館如畫。春風飛到，寶釵樓上，一片笙簫，琉璃光射。而今燈漫掛，不是暗塵明月，那時元夜。況年來，心懶意怯，羞與蛾兒爭耍。江城人悄初更打。問繁華誰解，再向天公借？剔殘紅灺，但夢裏隱隱，鈿車羅帊。吳箋銀粉砑，待把舊家風景，寫成閒話。笑綠鬟鄰女，倚窗猶唱，夕陽西下。",
    "translate": "The orchids are fragrant, The raised pavilion in the pond and a clear sky after snow a picture paint. Spring breezes have arrived at the House of Precious Hairpins, In the music of pipe and wind instruments that pervades, reflections coruscate. Though now lights and lanterns decorate everywhere, It is not the same bright moon from that very year's first full-moon night. Besides, years have gone by, and I've grown indolent and weary, I've been shying away from taking note of hair jewellery that ladies wear.Quiet is the township along the river upon the evening's first gong. Has anyone learnt to prosperity cherish before they borrow from heaven more? As I the wick trim and red wax remove, in a dreamy moment I seem to see Her gilded coach furnished with silk. On the notepaper of the Wu region glitter words written with silvery powder, Ready to depict in a literary piece my homeland's landscape. My neighbour's girl with her hair knot wearing green brings a smile to my face, By the window she sings still, as the dusky sun sets in the west.."
  },
  {
    "poem": "少年聽雨歌樓上，紅燭昏羅帳。壯年聽雨客舟中，江闊雲低、斷雁叫西風。而今聽雨僧廬下，鬢已星星也。悲歡離合總無情，一任階前、點滴到天明。",
    "translate": "In my youth I listened to the rain in houses where singing pervaded, Surrounded by bed curtains that candlelight veiled. In my prime I listened to the rain as I travelled by boat, The river was vast and clouds low, in westerlies trilled wild geese lost on their way.These days I listen to the rain in the hut of a monk, My sideburns have turned sparkling grey. Ever so relentless are the joy of coming together and parting sorrows that follow, Here I am taking heed of the rain dribbling on the stairs as a new day breaks.."
  },
  {
    "poem": "接葉巢鶯，平波捲絮，斷橋斜日歸船。能幾番遊？看花又是明年。東風且伴薔薇住，到薔薇、春已堪憐。更悽然，萬綠西泠，一抹荒煙。當年燕子知何處？但苔深韋曲，草暗斜川。見說新愁，如今也到鷗邊。無心再續笙歌夢，掩重門、淺醉閒眠。莫開簾，怕見飛花，怕聽啼鵑。",
    "translate": "In the foliage orioles nest, calm are ripples carrying away petals that drift, In the sunset boats sail past the Parted Bridge. How often do we come across such scenery? We must wait for next year to blossoms admire again. Easterlies should seek company in rosebushes, When rosebushes are in bloom, there is little that remains of spring. Even more depressing is the verdure that spreads to the Bridge of West Chill, Accompanied by twilight mist.Where have those swallows migrated to? Already covered in mosses would be the bend where the Weis used to reside, Lush would be grasses by the Sloping Creek. The ever expanding melancholy has now reached where gulls have taken off to. My mind is no longer on continuing my opulent reverie, Shutting tight doors after doors, I dose off slightly tipsy. Raise not the drapes for I dread seeing drifting blossoms And tremble at cuckoos' trills.."
  },
  {
    "poem": "山空天入海，倚樓望極，風急暮潮初。一簾鳩外雨，幾處閒田，隔水動春鋤。新煙禁柳，想如今、萍到西湖。猶記得、當年深隱，門掩兩三株。愁余，荒洲古漵，斷梗疎萍，更漂流何處？空自覺、圍羞帶減，影怯燈孤。常疑即見桃花面，甚近來、翻笑無書。書縱遠，如何夢也都無？",
    "translate": "Over the mountains vast is the sky that extends into the sea, On a loft I look into the distant, the wind rages as the evening tide begins to swell. Beyond the drapes turtledoves trill in the drizzle, On the fields here and there, farmers work their spring hoes under the rain. Willows fresh leaves sprout around the time of the Cold Fare, By now the West Lake must have the viridescent received. I still remember when I lived in seclusion there, Outside by the door there stood two or three willow trees.Sentimental I am at this desolate crossing on River Xu, These stemless, scattered duckweeds, where after all do they float towards? Anyhow, I've noticed that I'm slimming around the waist losing inches, Even my shadow has become afraid of being drawn out by a solitary lamp. I've often imagined that I might her lovely face see, Yet of late, though optimistic I remain I've not a letter received. Understandably letters have a long way to journey, Yet how come I've received not even a dream?."
  },
  {
    "poem": "記玉關、踏雪事清遊，寒氣脆貂裘。傍枯林古道，長河飲馬，此意悠悠。短夢依然江表，老淚灑西州。一字無題處，落葉都愁。載取白雲歸去，問誰留楚佩，弄影中州？折蘆花贈遠，零落一身秋。向尋常、野橋流水，待招來、不是舊沙鷗。空懷感，有斜陽處，卻怕登樓。",
    "translate": "Memory of the Jade Pass lingers, where we strolled about treading on snow, Where wintriness chilled through our marten coats. By the old track in a withered forest, horses drank from the Long River, And at leisure we were. Ephemeral are my dreams that take me back to the Yangtze's left bank, Out pours tears from this old fellow by the city gate of the West Shire. Although I didn't any inscription leave, my sorrows were felt by drifting leaves.How I wish I could rein a cloud and ride away, Who was it that dropped his pendant in River Chu Giving the sandbar there its landscape? I could pluck a reed flower and post it afar, yet I fear of stirring fall. As I come face to face with ordinary bridges and water that flows, What respond to my call are not the same seagulls of the old days. In vain churns my sentimentality, wherever reaches twilight I dread to a higher level climb.."
  },
  {
    "poem": "楚江空晚，悵離群萬里，怳然驚散。自顧影、卻下寒塘，正沙淨草枯，水平天遠。寫不成書，只寄得、相思一點。料因循誤了，殘氈擁雪，故人心眼。誰憐旅愁荏苒？漫長門夜悄，錦箏彈怨。想伴侶、猶宿蘆花，也曾念春前，去程應轉。暮雨相呼，怕驀地、玉關重見。未羞他、雙燕歸來，畫簾半捲。",
    "translate": "Dusky is the sky over River Chu, Depressed am I being ten thousand miles from most, drifting in a stupor. I look at the image of myself that plunges into the cold pond, Cleansed is the sand yet withered has the grass, still is the water and distant the sky. Unable to be completed is the letter I'm writing, I should just put in the post a wistful thought. Yet this would likely disappoint Someone with a worn felt coat in the snow, an acquaintance with hope.Who can comprehend a traveller's melancholy that piles? Long and still is the night at the Long Gate where a fine zither renders grief. I think of my comrades who still reside among flowers of reeds, I recall it's about time, come spring, for them to be on a journey home. We call out to one another in the evening rain, For chances are, we might just reunite at the Gate of Jade. Let us tease not the returning swallows in pairs, When the painted screen is half raised.."
  },
  {
    "poem": "碧圓自潔，向淺洲遠渚，亭亭清絕。猶有遺簪，不展秋心，能捲幾多炎熱？鴛鴦密語同傾蓋，且莫與、浣紗人說。恐怨歌、忽斷花風，碎卻翠雲千疊。回首當年漢舞，怕飛去、漫皺留仙裙摺。戀戀青衫，猶染枯香，還嘆鬢絲飄雪。盤心清露如鉛水，又一夜、西風吹折。喜淨看、匹練飛光，倒瀉半湖明月。",
    "translate": "Viridescent, round and pure, They spread from the shallow bay towards the distant isle with unrivalled grace. I still have the hairpin she left behind, If autumn offers not sympathy, how much scorching heat can it alleviate? Under leaves that overlap mandarin ducks whispers exchange, Do not tell this to the silk washers though. I only fear that a song of sorrow would make disappear a fragrant waft, And thousands of layers of green clouds would shatter.I'm reminded of Lady Zhao's dance in the era of Han, Fearing she'd fly away, the emperor's grab left creases in her heavenly dress. Her much talked about robe still gives a withered scent, Yet sentimental I've become over my sideburns peppered with snow. Whirling in the shape of heart are dewdrops shimmering like quicksilver, Yet overnight westerlies could blow them over. I like to gaze at the lustrous and the silky that glitter splatter, Tipping over half a lake's moonlight.."
  },
  {
    "poem": "萬里孤雲，清游漸遠，故人何處？寒窗夢裏，猶記經行舊時路。連昌約略無多柳，第一是、難聽夜雨。漫驚回淒悄，相看燭影，擁衾無語。張緒、歸何暮？半零落依依，斷橋鷗鷺。天涯倦旅，此時心事良苦。只愁重灑西州淚，問杜曲、人家在否？恐翠袖、正天寒，猶倚梅花那樹。",
    "translate": "I'm a cloud that has roamed ten thousand miles, Increasingly distant were pleasant times, yet where are old friends of mine? By the window in the chill, in memory I dwell, I'm still able to recall the paths we had taken. There must be very few willows left at the Estate of Successive Prosperity. Most irritating would be the noise of the nocturnal rain. All of a sudden miserably wakeful I become Facing a candle and shadows, in silence I can only a quilt embrace.Zhang Xu, why did you return so late? Half of the willows by the Parted Bridge have wilted leaving gulls and egrets. A traveller's weariness after roving the world is the most bitter at such a time. I only dread re-entering the West Shire for inevitably I'd tears shed When I the Du neighbourhood and her whereabouts enquire? I'm afraid of seeing her in her green sleeves, when the weather is at its wintriest, Still standing by a blossoming plum tree.."
  },
  {
    "poem": "孤嶠蟠煙，層濤蛻月，驪宮夜采鉛水。汎遠槎風，夢深薇露，化作斷魂心字。紅磁候火，還乍識、冰環玉指。一縷縈簾翠影，依稀海天雲氣。幾回殢嬌半醉，翦春燈、夜寒花碎。更好故溪飛雪，小窗深閉。荀令如今頓老，總忘卻、尊前舊風味。漫惜餘薰，空篝素被。",
    "translate": "On a lonely peak rise waves of mist, in undulating billows the moon renews in hue, The Dragon in his palace gathers at night drops of quicksilver. Water rises sending adrift a raft in the wind, deep are dreams when roses are dewy, Ready to be processed into intoxicating incense in the shape of heart. On a red-hot burner over ideal heat, They are turned into incense in the form of delicate jade rings. A curl of green smoke whirls around the curtains, Like a cloudy atmosphere over a sea it seems.How often she drank herself half intoxicated compromising her charm, She'd set alight spring lanterns, yet wintry are nights wilting flowers. On top of it all, over that creek there'd  be drifting snow, Tightly shut would be her porthole. Like the honourable Xun, when he of his old age took notice, He inevitably forgot the good times he had when he used to drink. I shall cherish the incense that lingers, keeping it trapped with my white quilt.."
  },
  {
    "poem": "漸新痕懸柳，淡彩穿花，依約破初暝。便有團圓意，深深拜，相逢誰在香徑？畫眉未穩，料素娥、猶帶離恨。最堪愛、一曲銀鉤小，寶奩掛秋冷。千古盈虧休問，歎慢磨玉斧，難補金鏡。太液池猶在，淒涼處、何人重賦清景？故山夜永，試待他、窺戶端正。看雲外山河，還老盡、桂花影。",
    "translate": "Over willows a new crescent emerges, through flowers its pale hue shines, Abiding by its time as the night begins to fall. I have a hope for us to reunite, Pious is my worshipping, would I therefore someone meet on a fragrant path? Not yet fully drawn is a painted brow, Perhaps Her Ladyship still carries with her parting sorrows. What I love the most is a curve of a small silvery hook Hanging over the incense case in the autumn cold.Never mind the wax and wane throughout the ages, A jadeite axe may sharpen gradually, yet imperfect the golden mirror remains. Still there is the Grand Liquid Pond, Yet how lonesome the place is, who would again odes to its comeliness compose? Long is the night of these familiar hills, As I wait to steal glances of her roundness through the window. Then I look beyond the clouds at our country's landscape, Suddenly as old as the hills seem all cinnamon blossoms and their shade.."
  },
  {
    "poem": "一襟餘恨宮魂斷，年年翠陰庭樹。乍咽涼柯，還移暗葉，重把離愁深訴。西窗過雨，怪瑤佩流空，玉箏調柱。鏡暗妝殘，為誰嬌鬢尚如許？銅仙鉛淚似洗，嘆移盤去遠，難貯零露。病翼驚秋，枯形閱世，消得斜陽幾度？餘音更苦，甚獨抱清商，頓成淒楚。漫想薰風，柳絲千萬縷。",
    "translate": "A shroud of Her Highness's grief lingers on Humming year after year in the shade of trees in the court. One minute they sob on boughs in the chill, the next they are among the foliage, Pouring out their parting sorrows yet again. A shower rains over the west window, That falls like crystals that turn to nothing like notes from a jade zither's neck. Lacklustre is the mirror and dull her make-up, For whom does she her charming fringes maintain?The bronze immortals let silvery tears wash their face, Ever since the collecting plate was removed, hard to gather is dew. Autumn disturbs their sickly wings, in their withered form they the world survive, Yet for how many more day do they get to a sunset live through? Ever more bitter seems their lingering sound, In extreme loneliness I the Pure Bass play, suddenly I am overcome by sorrows.  My thoughts drift away thinking of soft breezes and millions strands of willows.."
  },
  {
    "poem": "泛孤艇東皋過徧，尚記當日，綠陰門掩。屐齒莓苔，酒痕羅袖事何限？欲尋前迹，空惆悵、成秋苑。自約賞花人，別後總、風流雲散。水遠，怎知流水外，卻是亂山尤遠。天涯夢短，想忘了、綺疏雕檻。望不盡、苒苒斜陽，撫喬木、年華將晚。但數點紅英，猶識西園淒婉。",
    "translate": "Rowing a boat all over the swamp in the east, I still remember that day closed were the doors under the shade of the green. Covered in mosses are the bottom of my clogs, How could history matter when I have wine stains on my sleeves? Although I wish to look for traces of the past, Filled with melancholy is a garden that is turning autumnal. Ever since a rendezvous when we blossoms admired, Since our parting, their whereabouts are as diffused and scattered as winds and clouds.Far travels water, yet who knows beyond where waters flow Farther still are myriads of mountains and hills. Vast is the world and ephemeral are dreams, Forgetful must be those delicately carved balusters and balustrades. Hazy is the outlook in the twilight that pervades, As I pat a mature tree, at hand is old age. There are all but a few red blooms That a graceful yet lonesome West Garden embellish.."
  },
  {
    "poem": "殘雪庭陰，輕寒簾影，霏霏玉管春葭。小帖金泥，不知春是誰家？相思一夜窗前夢，奈箇人、水隔天遮。但淒然、滿樹幽香，滿地橫斜。江南自是離愁苦，況游驄古道，歸雁平沙。怎得銀箋，殷勤說與年華。如今處處生芳草，縱憑高、不見天涯。更消他，幾度東風，幾度飛花。",
    "translate": "In the shade of the garden lie remnants of snow, In the shadow of drapes nippy is the cold, Luxuriant and lush are green reeds looking like pipes of jade. It's time for greetings written in ink of gold, I wonder whose household spring has arrived at? After a night of longing I fell into a dream by the window. Regretfully who I thought of are separated by waters and shield by skies. Miserable I feel, though trees are blossoming with a faint fragrance, And shadows of their branches the ground traverse.The Yangtze's south ineluctably offers a bitter contrast to parting sorrows, Furthermore, on established avenues there are galloping horses, while on the sandbar returning wild geese gather. I wonder how I can get my hand on some notepaper To diligently record what went on during those magnificent years. These days everywhere I go grasses grow, Yet even if I some height mount, not seen is the edge of the world. Mention not how many times easterlies have approached And how many times flowers have blossomed and flown.."
  },
  {
    "poem": "層綠峨峨，纖瓊皎皎，倒壓波浪清淺。過眼年華，動人幽意，相逢幾番春換。記喚酒、尋芳處，盈盈褪妝晚。已消黯，況淒涼、近來離思，應忘卻、明月夜深歸輦。荏苒一枝春，恨東風、人似天遠。縱有殘花，灑征衣、鉛淚都滿。但殷勤折取，自遣一襟幽怨。",
    "translate": "Lofty and lush grow layers of green, bright and delicate is the white, Surpassing ripples and gentle waves. In the blink of an eye passes time, appealing is the secluded feel, We've met up again after spring has come around many a time. I remember asking for wine where we blossoms admired, Graceful they were and did not lose their powder till late.Now in the gloom I am, Especially miserable I've been of late, pining away, I've almost forgotten the joy of returning at night on a coach under moonlight. There is now only a branch of spring in bloom, And I do easterlies resent, for you are as far away as the sky's end. Although there are wilting blooms, Scattered on battle clothes are quicksilver tears that fall everywhere. Still, I make a pick with care To while away a chest of suppressed regret.."
  },
  {
    "poem": "江空不渡，恨蘼蕪杜若，零落無數。遠道荒寒，婉娩流年，望望美人遲暮。風煙雨雪陰晴晚，更何須、春風千樹。盡孤城、落木蕭蕭，日夜江聲流去。日晏山深聞笛，恐他年流落，與子同賦。事闊心違，交淡媒勞，蔓草沾衣多露。汀洲窈窕餘醒寐，遺佩環、浮沈澧浦。有白鷗、淡月微波，寄語逍遙容與。",
    "translate": "The season cannot the river and the sky cross,  Regretfully grasses that fragrances give are wilting and on the drift. Long is the road and desolate the wintriness, smoothly passes time, Seeing beauties into their twilight years. Misty winds and frosty rains the evening weather shift, Making redundant breezes that brush through thousands of trees. The lonely town is left as is with deciduous trees that whistle, And the sound of the river flows day and night.In the afternoon from the deep of the mountain comes the sound of a reed, I fear that there'd be time when I'm in distress, then I'd offer my symphonic ode. A multitude of things and matters negate the heart, Weak friendship wears out those who go between, Dewy are vines that cling onto clothes. Secluded is life on the sandbar, yet between sleeps I've lost the round pendant to the rippling waters of Li. There are white gulls among light waves and the pale moonlight, I tell them how I'm enjoying the unfettered clime.."
  },
  {
    "poem": "似東風老大，那復有、當時風氣。有情不收，江山身是寄，浩蕩何世？但憶臨官道，暫來不住，便出門千里。癡心指望回風墜，扇底相逢，釵頭微綴。他家萬條千縷，解遮亭障驛，不隔江水。瓜洲曾檥，等行人歲歲，日下長秋，城烏夜起。帳廬好在春睡，共飛歸湖上，草青無地。愔愔雨、春心如膩，欲待化、豐樂樓前，帳飲青門都廢。何人念、流落無幾，點點摶作雪緜鬆潤，為君裛淚。",
    "translate": "Easterlies seem weak and feeble, They have not the spirit they used to breathe. Emotions need not be suppressed, for we live in the countryside, Why be bothered by the mighty world? Nonetheless I think of the way of office, stays are short and never long-term, One soon finds oneself thousands of miles from home. My wishful thinking hopes for the breeze to turn its head, So we could meet under fans of foliage as hairpin-like sprigs sway. There are those who have millions of willow strands To shade provide for their garden which the river cannot divide and separate.Once I docked at the Melon Bay where crowds pass one another year after year, The sun fell drawing out a feel of fall, crows in the town fluttered at night. Sleeping on board, luckily I had a sweet dream, Back to linger on a lake I was, there was not a spot not covered by grass. Silent is the drizzle, boredom encumbers the vernal spirit, Which one hopes to alleviate at the House of Joy and Prosperity, Yet in ruins is the drinking place by the Blue Gate. I wonder who keeps in mind a destitute soul with little left, Down dribble sparkling, soft and snowy drops and droplets To my saturated tears shed.."
  },
  {
    "poem": "近重陽、偏多風雨，絕憐此日暄明。問秋香濃未，待攜客、出西城。正自羈懷多感，怕荒臺高處，更不勝情。向尊前、又憶漉酒插花人，只座上、已無老兵。淒清，淺醉還醒，愁不肯、與詩平。記長楸走馬，雕弓射柳，前事休評。紫萸一枝傳賜，夢誰到、漢家陵。盡烏紗、便隨風去，要天知道，華髮如此星星，歌罷涕零。",
    "translate": "The Double Ninth approaches, yet winds and rains have been persistent, Rare is a lovely fine day that today is. I wonder whether the fragrance of autumn has grown strong and thick, As I'm about to take my guest and head west out of the town. Feeling like a traveller, sentimental I am right now, I fear when I a desolate terrace climb, I'd be even more overwhelmed. The drinks remind me of the daisy grower who filters wine with his head cloth, Except of the seated, there is not a seasoned soldier who'd drown in alcohol.Extremely saddened I am, I'd soon sober up from being mellow, Yet my melancholy cannot keep itself level-headed like the poems I compose. I remember galloping in woods of catalpas, Where my engraved bow shot with precision, yet let's dwell not on bygones. I hear there has been an imperial award of a fuchsia evodia, I wonder who could it deliver to the Han mausoleum. Even if the bonnet signifying office goes with the wind, I'd want heaven to know, my hair has become so very starry white, At the end of a song, down shall trickle my tears.."
  },
  {
    "poem": "天闊雲高，溪橫水遠，晚日寒生輕暈。閒階靜、楊花漸少，朱門掩、鶯聲猶嫩。悔悤悤、過卻清明，旋占得餘芳，已成幽恨。卻幾日陰沉，連宵慵困，起來韶華都盡。怨入雙眉閒鬥損，乍品得情懷，看承全近。深深態、無非自許，厭厭意、終羞人問。爭知道、夢裏蓬萊，待忘了餘香，時傳音信。縱留得鶯花，東風不住，也則眼前愁悶。",
    "translate": "Expansive is the sky and lofty the clouds, A creek traverses before me and far travels water, As the sun sets, spells of chill set in. On the deserted garden stairs all is quiet, diminishing are catkins that drift here, The scarlet doors are shut, still tender are the warbles of orioles. I regret that in haste lapsed the vernal equinox, I guess I still possess a lingering scent that has turned into inexpressible grieve. For days the weather has been heavily grey, Night after night I've been lethargic and drowsy, waking up to wilted blooms.Locked into the brows is lament that compromises leisure, When I could its essence savour, then I would an overview comprehend. Deep and thorough is my attitude, yet it could all be self-assumed, Steeping in lassitude I am, yet I'm afraid of being asked about it. Who really knows that I've been dreaming of the Immortal Place, While I've been hoping to the faint fragrance disremember, there come letters. Even if I could orioles and blossoms retain, Easterlies do not draw in their reins, Therefore what I see before me only melancholy creates.."
  },
  {
    "poem": "香冷金猊，被翻紅浪，起來慵自梳頭。任寶奩塵滿，日上簾鉤。生怕離懷別苦，多少事、欲說還休。新來瘦，非干病酒，不是悲秋。休休，者回去也，千萬徧陽關，也則難留。念武陵人遠，煙鎖秦樓。惟有樓前流水，應念我、終日凝眸。凝眸處，從今又添，一段新愁。",
    "translate": "Cold is the incense from the wild lion of bronze, My quilt red waves make as I toss and turn, So I rise in languor to my hair comb. Neglected is my mirror set as it dust collects, the sun has risen above curtain hooks. I'm most afraid of the bitterness of parting sorrows, There are so many things I'd like to say yet I leave them unsaid. I've been losing weight of late, but it isn't the doing of drinking, Neither is it because of autumn-induced woe.Let it go, let them go, our parting this time Is not something that singing the Sun Gate melody a million times could put off. The age-old tale of the Wuling tribe comes to mind, As mist conceals the houses by the waters of Qin. There is only the waters that flow by the house That could perhaps remember my pondering gaze. Yet wherever I fix my gaze, from now on it shall have added to it A share of fresh melancholy.."
  },
  {
    "poem": "昨夜雨疏風驟，濃睡不消殘酒。試問捲簾人，卻道海棠依舊。知否？知否？應是綠肥紅瘦。",
    "translate": "Last night the rain drizzled and rough winds blew, Deep in slumber I remain, still lingering is the residual effect of spirits. If I ask the curtain raiser, She'd be sure to reply that those cherry apple trees are blossoming still. Yet, doesn't she know? Doesn't she know? It should be the season of thinning red and rich green.."
  },
  {
    "poem": "薄霧濃雲愁永晝，瑞腦消金獸。佳節又重陽，玉枕紗廚，半夜涼初透。東籬把酒黃昏後，有暗香盈袖。莫道不消魂？簾捲西風，人比黃花瘦。",
    "translate": "A light mist and dense clouds shroud a long day in melancholy, The fragrance of an exquisite essence scatters from the gilded beast-shaped burner. Come again has the season of the Double Ninth, Through the silk drapes and the embroidered pillow Chilliness begins to penetrate in the middle of the night.I sip at my wine by the east fence past the twilight, I chrysanthemums and their subtle scent keep in my sleeves. How could anyone not agree that this is soul lifting? Yet when a westerly raises the screen, I realise I have withered thinner than those yellow petals and leaves.."
  },
  {
    "poem": "尋尋覓覓，冷冷清清，淒淒慘慘戚戚。乍暖還寒時候，最難將息。三杯兩盞淡酒，怎敵他、晚來風急？雁過也，正傷心，卻是舊時相識。滿地黃花堆積。憔悴損、如今有誰堪摘？守著窗兒， 獨自怎生得黑？梧桐更兼細雨，到黃昏、點點滴滴。這次第，怎一個、愁字了得！",
    "translate": "Lonely and lonesome, bleak and bitter, Deep in dreary thoughts I missed you miserably so. In a season when warmth could suddenly a chill become, Unable to rest was a weary soul. How could light wine of two or three pours Fend off a rush of wind in the late hours? As wild geese flew by, in sorrow I dwelled, And remembered how I had seen them before.On grounds in piles were petals of yellow. Wilting in grief, who'd these flowers pick? By the window I pined, In solitude how could I while away the day till darkness arrived? Drizzle through phoenix trees fell, At twilight, drops and drips dribbled and rolled. In fall, how could sorrow possibly spell a melancholy overflow!."
  },
  {
    "poem": "蕭條庭院，有斜風細雨，重門須閉。寵柳嬌花寒食近，種種惱人天氣。險韻詩成，扶頭酒醒，別是閒滋味。征鴻過盡，萬千心事難寄。樓上幾日春寒，簾垂四面，玉闌干慵倚。被冷香消新夢覺，不許愁人不起。清露晨流，新桐初引，多少游春意。日高煙斂，更看今日晴未。",
    "translate": "Bleak is the courtyard, windswept the drizzle, Doors and windows need to be closed. As the Cold Fare approaches with esteemed willows and charming blossoms, So do various irritating elements of weather. I've just finished composing a poem adopting a narrow rhyme, I prop my head as I'm sobering up, special is the flavour of leisure. Once all wild geese have taken off on their long flight, No longer deliverable are millions of thoughts weighing on my mind.For days the chill of spring pervades upstairs, Low hang drapes on all sides, I don't even bother to gaze beyond the balustrade. Cold is the quilt, burned out the incense, and I've just woken from a dream That disallow a lugubrious soul from not rising out of bed. This morning's lucid dew trickles, phoenix trees have begun to blossoms give, How I wish to explore the awakening of spring. High rises the sun and scattered has the smoky haze, I shall wait and see if today turns out to be one fine day.."
  },
  {
    "poem": "落日鎔金，暮雲合璧，人在何處？染柳煙濃，吹梅笛怨，春意知幾許？元宵佳節，融和天氣，次第豈無風雨。來相召、香車寶馬，謝他酒朋詩侶。中州盛日，閨門多暇，記得偏重三五。鋪翠冠兒，撚金雪柳，簇帶爭濟楚。如今憔悴，風鬟霜鬢，怕見夜間出去。不如向、簾兒底下，聽人笑語。",
    "translate": "The sun sets into molten gold, evening clouds a doughnut of jade form, Yet where is the person I'm thinking of? Smoky mist willows shrouds, from under a plum trees sounds a reed's lament, How much has spring awakened? On the day of this year's first full moon, balmy is the weather, This time round there is no wind nor rain. An invitations comes by way of a scented coach with a prized horse, Thanks to a group of poetic drinking friends.In our capital on its best days, often at leisure I was in my boudoir, I remember the first full moon was especially emphasised. I'd wear a jade coronet, cut a few paper flowers of white and gold, And put on a cummerbund for an immaculate look. These days I'm languishing away, my hair is thinning and my fringes grey, Of going out at night I've become afraid. Why don't I just keep myself behind the curtains, And listen as others laugh and chat away.."
  },
  {
    "poem": "髻子傷春懶更梳，晚風庭院落梅初，淡雲來往月疏疏。玉鴨薰鑪閒瑞腦，朱櫻斗帳掩流蘇，通犀還解辟寒無？",
    "translate": "Slouching is my coiled bun that I can't be bothered combing as I brood over spring, The evening breeze puffs in the garden where plum blossoms begin to fall adrift, Thin are clouds that float to and fro, among which a bright moon beams.The jade duck incense burner the fragrance of an exquisite essence disperses, Cherry red drapes of the bed chamber its bright tassels veil, Are those rhinoceros horns still effective in shielding against the chill?."
  }
]